{
  "podcast": "BookBytes",
  "episode": "1",
  "transcript": [
    {
      "speaker": "Adam Garrett-Harris",
      "text": "Hello and welcome to the first episode of BookBytes. This is a show for programmers who like to read books."
    },

    {
      "speaker": "Jen Luker",
      "text": "And for programmers who don't love to read books and would rather have us tell them all about it."
    },

    {
      "speaker": "Adam Garrett-Harris",
      "text": "Hopefully you like to learn, because we're going to be talking about books. And so, you can choose to read the books along with us, or just listen and see what we said about the books, and maybe you'll find it interesting, and maybe you'll want to read the books too."
    },

    {
      "speaker": "Jason Staten",
      "text": "We are a group of people that are interested in improving our craft and one of the ways that we know to do that is by reading books and discussing them with one another so we can get an outside perspective, and I'm really excited to be a part of it."
    },

    {
      "speaker": "Adam Garrett-Harris",
      "text": "In this show, we're going to introduce the show in general, and the hosts, and then we'll introduce the first book we're going to be talking about."
    },

    {
      "speaker": "Safia Abdalla",
      "text": "If you've listened to this point, keep listening. At the end of the podcast, we'll be announcing a super exciting giveway, so stay tuned for that."
    },

    {
      "speaker": "Adam Garrett-Harris",
      "text": "Ok, so now we can do the part where we introduce ourselves."
    },

    {
      "speaker": "Jen Luker",
      "text": "I am Jen Luker. I am a lead software engineer at Deseret Digital Media and I'm known as [knitcodemonkey](https://twitter.com/knitcodemonkey) on Twitter. As the name designates,  I never ever ever stop knitting, so if I ever say I'm too sick to knit, I'm certainly not doing the podcast."
    },

    {
      "speaker": "Adam Garrett-Harris",
      "text": "I'm Adam Garrett-Harris, and I've been a developer since 2010, when I got a CS degree and I got a job as a web developer at a rodeo company. And currently, I'm at a consulting company, so I get to move around to a lot of different clients and work on their front-end with JavaScript and React, and currently learning Elm. I have started knitting, but I don't knit that often, and currently I'm really into typewriters."
    },

    {
      "speaker": "Jen Luker",
      "text": "You have no idea how excited I am about the knitting thing!"
    },

    {
      "speaker": "Safia Abdalla",
      "text": "I think I might break the knitting streak here. I'm Safia Abdalla. I started programming when I was 10 years old and haven't stopped since. Currently you can find me contributing to open source, blogging on my blog, which is [blog.safia.rocks](https://blog.safia.rocks/), and running my solo bootstrapped startup, called [Tanmu Labs](https://tanmulabs.com/). And that's pretty much it about me."
    },

    {
      "speaker": "Adam Garrett-Harris",
      "text": "I love your domain name. It's so cool."
    },

    {
      "speaker": "Safia Abdalla",
      "text": "Thank you. It's only $10."
    },

    {
      "speaker": "Adam Garrett-Harris",
      "text": "Oh man. The .fm domain is about $90."
    },

    {
      "speaker": "Jason Staten",
      "text": "I'm Jason Staten. I am a full-stack developer, currently, I'm working as a technical lead over at Domo in Utah. I find myself, when I'm not on the computer, often doing ham radio. You can hear me as NovemberSierra8India."
    },

    {
      "speaker": "Adam Garrett-Harris",
      "text": "Oh, you got your custom name?"
    },

    {
      "speaker": "Jason Staten",
      "text": "I did get it. And I'm always trying to convince people at work to get on the airwaves as well."
    },

    {
      "speaker": "Jen Luker",
      "text": "We actually have a ham radio club at work. So there's a whole group of people that went and got their tests and their licenses. It's quite fun to hear the chatter."
    },

    {
      "speaker": "Safia Abdalla",
      "text": "I don't think it's the same as ham radio, but I have a friend here in Chicago, who has a whole thing built around police scanners. It's pretty cool. He built an app to listen to different police scanner feeds and issue real-time alerts on crime. And he works with a lot of people who are interested in civic data and public works. I've always been fascinated about that, but I think it's completely different from ham radio. I might be wrong. I'm just rambling about nothing..."
    },

    {
      "speaker": "Jason Staten",
      "text": "There's some overlap in the communities."
    },

    {
      "speaker": "Adam Garrett-Harris",
      "text": "Our first book is called Apprenticeship Patterns by David Hoover and Adewale Oshineye. I first came across this book about 4 years ago, and it was a free book online. It was pretty early in my career and I found it to be very useful, and I think it's still useful today. We're actually recording this after we've all read it. What was everyone's expectations before reading the book and how did that change as you read it?"
    },

    {
      "speaker": "Safia Abdalla",
      "text": "When we initially decided to read the book, I thought that it would be much more thought-leadery and a little self-helpish. As we were reading it, that perspective changed. I realized that it's much more of a technical manual, and as we discussed on the podcast, a set of patterns or communication tools to discuss the same ideas around how our careers develop and what our career goals are."
    },

    {
      "speaker": "Jason Staten",
      "text": "When I was first approached by Adam about reading the Apprenticeship Patterns book, I didn't quite know what to expect. The first thing that jumped into mind was the [Gang of Four Design Patterns](https://www.amazon.com/Design-Patterns-Elements-Reusable-Object-Oriented/dp/0201633612/?tag=adaharris09-20) that I remembered studying in college. And after reading it, it actually made me wish that I had read Apprenticeship Patterns before reading the Gang of Four. It's been really nice to go through as a way of doing some self-assessment and to learn about ways that I can still continue to grow myself as a developer. It's something that I would recommend to any new developer or developer who's looking to progress themselves a bit more."
    },

    {
      "speaker": "Adam Garrett-Harris",
      "text": "And I had read it online before, but I got the physical copy this time, and I really enjoyed it. The book is really tiny when you have the physical copy, which is great because you can reference the little sections really easily and you can read it pretty quick. And something about having the physical copy makes it easier to read. I don't know how to explain it, but when you're reading online, it just feels like a really long article, and when you're reading the book, it just feels like a really small book."
    },

    {
      "speaker": "Safia Abdalla",
      "text": "I can definitely understand that feeling. I was reading a digital copy and there were definitely times when I was scrolling through the single page view in Preview on mac, and it definitely started to feel like a technical manual."
    },

    {
      "speaker": "Jen Luker",
      "text": "I did expect it to be about how to get started in development and how to progress beyond the apprentice process and into more of a leader process. I was pleasantly surprised to discover that as opposed to assumming that everyone is at a different level (junior, mid-level, senior devs), it very much focused on your own journey and your own path. And it gave us a common language, in which to discuss our experiences. So, as we're working together we can talk about those things and understand what we're referring to."
    },

    {
      "speaker": "Adam Garrett-Harris",
      "text": "So, here's how the format for the show is going to work. It's a fortnightly podcast, so it's going to come out every 2 weeks on Mondays. First, we'll do a short episode like this one to introduce the book that we'll be reading. And then we'll have a certain number of episodes where we talk about the book a few chapters at a time. And we'll let you know in advance what chapters we're going to be talking about in case you want to read along with us, or if not, that's cool. And then hopefully we will bring the author on to talk about the book in an episode. So we're definitely going to have one of the authors of Apprenticeship Patterns, Dave Hoover, on the show, and we have the author of the next book lined up as well.\nNext time we'll talk about chapters 1-2, then 3-4, and then finally 5-7. Then we'll be talking with Dave Hoover.\nAnother thing we're doing is a book giveaway. I have 5 copies of Apprenticehip Patterns signed by Dave Hoover, that I'll be giving away to 5 listeners of the show."
    },

    {
      "speaker": "Safia Abdalla",
      "text": "To participate in the giveaway, you'll need to go to [orbit.fm/bookbytes/giveaway](https://www.orbit.fm/bookbytes/giveaway/). There you'll find the instructions for participating in the giveaway."
    },

    {
      "speaker": "Adam Garrett-Harris",
      "text": "And since we're a new show, we're asking for you to leave an iTunes review, hopefully a good one, doesn't have to be. But leave an iTunes review and then fill out the form on the giveaway page. We really appreciate any and all reviews we can get, and any feedback we can get. Please subscribe in your favorite podcast player. We're on iTunes, Stitcher, Google Play, wherever you get your podcasts. And you can also subscribe on YouTube, if you want. It's just audio, but it's on there."
    },

    {
      "speaker": "Jason Staten",
      "text": "We appreciate any and all feedback that you have to share with us."
    }
  ]
}
