{
  "note": "Do not edit this file directly. Edit the txt file and then run the convertTranscript script to generate this file.",
  "podcast": "BookBytes",
  "episode": "34",
  "transcript": [
    {
      "text": "(Intro music: Electro swing)"
    },
    {
      "timestamp": "0:00:11.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Hello and welcome to BookBytes, a book club podcast for developers. This week we’re talking about “Life in Code: A Personal History of Technology” by Ellen Ullman. I’m Adam Garrett-Harris."
    },
    {
      "timestamp": "0:00:24.6",
      "speaker": "Jason Staten",
      "text": "[Overlapping voices] I’m Jason Staten."
    },
    {
      "timestamp": "0:00:24.6",
      "speaker": "Megan Duclos",
      "text": "[Overlapping voices] I’m Megan Du- (laughs)"
    },
    {
      "timestamp": "0:00:28.4",
      "speaker": "Jason Staten",
      "text": "I’m Jason Staten."
    },
    {
      "timestamp": "0:00:30.0",
      "speaker": "Megan Duclos",
      "text": "And I’m Megan Duclos."
    },
    {
      "timestamp": "0:00:31.7",
      "speaker": "Adam Garrett-Harris",
      "text": "All right. So, Megan, you picked out this book and I was super excited about it because I’ve heard that, well, one of the books by Ellen Ullman, I don’t remember which one, is one of the best books of all time that you must read before you die."
    },
    {
      "timestamp": "0:00:47.7",
      "speaker": "Megan Duclos",
      "text": "Oh! I didn’t know that!"
    },
    {
      "timestamp": "0:00:49.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I think it was actually “Close to the Machine”?"
    },
    {
      "timestamp": "0:00:51.9",
      "speaker": "Megan Duclos",
      "text": "Okay."
    },
    {
      "timestamp": "0:00:53.1",
      "speaker": "Adam Garrett-Harris",
      "text": "‘Cause on the cover this one it says, “Author of ‘Close to the Machine’”."
    },
    {
      "timestamp": "0:00:55.8",
      "speaker": "Megan Duclos",
      "text": "Okay, cool."
    },
    {
      "timestamp": "0:00:56.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Which is a novel."
    },
    {
      "timestamp": "0:00:58.2",
      "speaker": "Jason Staten",
      "text": "Hmm."
    },
    {
      "timestamp": "0:00:58.2",
      "speaker": "Adam Garrett-Harris",
      "text": "And then this one, I just want to go ahead and read this one. It’s her newest one and it’s more of a memoir about her life in technology and she’s been in technology for a really long time so I thought that’d be really cool; and she’s a woman in technology and I wanted to see her perspective, especially from that long of a time ago."
    },
    {
      "timestamp": "0:01:17.5",
      "speaker": "Megan Duclos",
      "text": "Yeah. Yeah, I did, too. I think you were the one who told me about this book and about Ellen and then I was like, “Yeah, we have to read it. Obviously.”"
    },
    {
      "timestamp": "0:01:29.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:01:29.8",
      "speaker": "Megan Duclos",
      "text": "But those are exactly the same reasons why it was really interesting to me and why I wanted to read it was just to hear her story of being a woman in this industry, especially in the ‘70s when it was in its infancy, and just how it’s evolved and how she’s seen the whole industry evolve over time."
    },
    {
      "timestamp": "0:01:52.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:01:53.0",
      "speaker": "Jason Staten",
      "text": "I did not know quite what to expect getting into it other than it was a title of a book that was brought up by the two of you and, uh, I am very glad that I read this. I think Ellen’s experience throughout her life is… Okay, it’s a pretty awesome timeline to be along. Like awesome, not necessarily in terms of all good, but just the number of things that she was near or lived through are one of those things that, like, I feel like we look back on and reflect on, I mean, it’s still going on today but, like, the number of historical event things that she was there around and, like, it’s just, it was really a great read. I loved it."
    },
    {
      "timestamp": "0:02:41.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! And she’s an excellent author. It’s very well written and it just kind of sucks you in."
    },
    {
      "timestamp": "0:02:47.6",
      "speaker": "Megan Duclos",
      "text": "Yeah, I agree. I really loved it. It’s more like a collection of essays than it is a memoir. It kind of serves both purposes there."
    },
    {
      "timestamp": "0:02:57.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:02:58.4",
      "speaker": "Megan Duclos",
      "text": "But I think there were a couple of her essays that kind of lost my interest a little bit but, like, most of them were amazing and I loved them. I mean, I loved them all, there were just some that I’m like, “I could have done without this one.” But, I don’t know, I still really loved the book."
    },
    {
      "timestamp": "0:03:16.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Right. Yeah! And so the collection of essays are written from 1994 through 2017 and some of them, a lot of them, were published in different places like Wired Magazine or different places like that in some form, maybe it was edited down, I’m sure. But I’d never come across any of these."
    },
    {
      "timestamp": "0:03:37.5",
      "speaker": "Megan Duclos",
      "text": "Yeah, me neither."
    },
    {
      "timestamp": "0:03:38.5",
      "speaker": "Jason Staten",
      "text": "Yeah, they were all new to me and I had to double check, too, on some of them. Like, the note about the dates?"
    },
    {
      "timestamp": "0:03:47.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:03:47.5",
      "speaker": "Jason Staten",
      "text": "I wasn’t quite sure, like, having listened to it, I was like, “She is, her writing then was very much writing, I feel like, is applicable now, or feels very modern now, like, in the perspectives-"
    },
    {
      "timestamp": "0:04:00.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yes!"
    },
    {
      "timestamp": "0:04:02.4",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:04:02.4",
      "speaker": "Adam Garrett-Harris",
      "text": "I felt like it was very insightful for the time that it was written."
    },
    {
      "timestamp": "0:04:06.2",
      "speaker": "Megan Duclos",
      "text": "Yeah, I agree."
    },
    {
      "timestamp": "0:04:07.3",
      "speaker": "Jason Staten",
      "text": "I mean, one thing in particular, is the “Silicon Valley Boys’ Club”-type of perspective. That is something that we reflect back on now, but that’s something that she lived through and had remarks to say as it was ongoing."
    },
    {
      "timestamp": "0:04:25.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. Yeah, it said very early on she left full-time engineering for consulting because she felt out of place. Like, engineering culture is very teenage-boy puerile."
    },
    {
      "timestamp": "0:04:36.4",
      "text": "And (laughs) there’s a story where she was back at a place where she used to work, talking to a coworker, and he was very understanding about why she left and then someone, like, yells across from across the room that he has to come quick because their water gun battle was about to start. "
    },
    {
      "timestamp": "0:04:58.9",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:05:00.1",
      "speaker": "Jason Staten",
      "text": "Yeah."
    },
    {
      "timestamp": "0:05:00.8",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:05:01.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Okay. Okay."
    },
    {
      "timestamp": "0:05:04.7",
      "speaker": "Jason Staten",
      "text": "I think it was, yeah, it was at in my first job, probably two or three weeks in, I was working at my desk and recall getting hit in the back by one of the nerf bazookas, you remember those with, like, the huge rocket?"
    },
    {
      "timestamp": "0:05:22.9",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:05:23.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Not particularly. (laughs)"
    },
    {
      "timestamp": "0:05:24.7",
      "speaker": "Jason Staten",
      "text": "Like, I don’t know, I just recall as, like, a kid, it’s something that other kids had in the neighborhood or something and I was like, “Whoa! That’s huge!” And yeah, having somebody from the QA team, like, arc a shot over a wall and hit me in the back with it when we were working a little bit later one night. And this… like, that’s kind of the embodiment of it. Like you said, kind of, like, teenager-like type humor and approach to things that doesn’t necessarily match the culture or people or, like, expectation that everybody has in the workplace."
    },
    {
      "timestamp": "0:06:06.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and there’s this quote that said, “Software engineering is a meritocracy. Anyone with the talents and abilities can join the club. However, if rollerblading, Frisbee playing, and water-balloon wars are not your idea of fun … you are not likely to stay long.”"
    },
    {
      "timestamp": "0:06:20.4",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:06:21.7",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:06:23.1",
      "speaker": "Megan Duclos",
      "text": "Yeah. Do we want to go into some more specific things? Like, maybe we just go through the parts and we can kind of talk about what we liked from each of those? Or do we each want to just bring something up that stuck out to us?"
    },
    {
      "timestamp": "0:06:36.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I think just talking about some of our favorite parts because there are five parts to this book but they’re just kind of loosely…"
    },
    {
      "timestamp": "0:06:45.7",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:06:46.5",
      "speaker": "Adam Garrett-Harris",
      "text": "You know? Like, they’re all kind of loosely related, kind of not related? (laughs)"
    },
    {
      "timestamp": "0:06:50.5",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:06:51.3",
      "speaker": "Megan Duclos",
      "text": "Yeah, yeah. Um… It’s hard to know what to bring up first because I have so many thoughts about this book! (laughs)"
    },
    {
      "timestamp": "0:06:58.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Go for it!"
    },
    {
      "timestamp": "0:06:59.9",
      "speaker": "Megan Duclos",
      "text": "Okay, I’m trying to think of what, there’s some I’m going to save for later, but more in the beginning when she’s talking about just the programming life and what it was like and when she first started, like, I think it was in the ‘70s, she talks about her job and what it was like and especially as a woman working with a bunch of men and just the blatant sexism; which, of course I knew existed at the time, but some of her stories were enraging."
    },
    {
      "timestamp": "0:07:39.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh! Oh my gosh."
    },
    {
      "timestamp": "0:07:40.9",
      "speaker": "Megan Duclos",
      "text": "(laughs) And I think it really showed me, like, how far we’ve come as a society. And I know that, like, I personally have it really good where I’m working right now where everyone’s really just, I don’t know the right words to use here. Everyone’s really respectful and they don’t expect me to be bad at my job because I’m a woman. There’s-"
    },
    {
      "timestamp": "0:08:06.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:08:07.5",
      "speaker": "Megan Duclos",
      "text": "You know what I mean? I, like-"
    },
    {
      "timestamp": "0:08:09.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:08:10.5",
      "speaker": "Megan Duclos",
      "text": "I’m having trouble with my words tonight. But I know that that’s not true everywhere, now. I hear stories all the time from women in our industry, and outside of it, of hearing almost exactly the same things that men said to her at that time. And it’s still alive and well (laughs) in the workplace, unfortunately, but I just…"
    },
    {
      "timestamp": "0:08:34.9",
      "text": "Comparing that to my own experience now, showed me how far we’ve come. I mean, there’s still a lot of work to be done because not every workplace is as good as mine (laughs). I feel like I’m bragging about where I work but-"
    },
    {
      "timestamp": "0:08:49.1",
      "speaker": "Adam Garrett-Harris & Jason Staten",
      "text": "(laughing)"
    },
    {
      "timestamp": "0:08:50.0",
      "speaker": "Megan Duclos",
      "text": "Like, not every work place tolerates that behavior but a lot do. So, like, there’s still work to be done, but we have come a long way, as well."
    },
    {
      "timestamp": "0:09:00.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Really terrible bosses. She mentions one that, “...he rubbed his clammy hands up and down my back while I worked.” That was one of the quotes."
    },
    {
      "timestamp": "0:09:09.3",
      "speaker": "Megan Duclos",
      "text": "Yeah, that’s… nauseating. Yeah."
    },
    {
      "timestamp": "0:09:11.4",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:09:11.6",
      "speaker": "Adam Garrett-Harris",
      "text": "And then she worked for a man who said at a meeting, “I hate to hire you girls, but you’re all so smart.”"
    },
    {
      "timestamp": "0:09:18.8",
      "speaker": "Megan Duclos",
      "text": "Yep."
    },
    {
      "timestamp": "0:09:19.6",
      "speaker": "Adam Garrett-Harris",
      "text": "“He would also interrupt me often to say, ‘Gee, you have pretty hair.’”"
    },
    {
      "timestamp": "0:09:23.3",
      "speaker": "Megan Duclos",
      "text": "Yep, yep. That was…"
    },
    {
      "timestamp": "0:09:26.0",
      "speaker": "Jason Staten",
      "text": "That was just scummy. She even talks later on in the book, or later on in one of the essays, where she was talking about them having too big of storefronts on one of the streets and that they needed to have smaller footprints so that way people could go and build kind of their mom-and-pop type shops."
    },
    {
      "timestamp": "0:09:53.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:09:54.3",
      "speaker": "Jason Staten",
      "text": "And the people that she was talking to just, kind of, looked the other way as if, like-"
    },
    {
      "timestamp": "0:09:58.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:09:59.9",
      "speaker": "Jason Staten",
      "text": "“Little girl, you don’t know what you’re talking about.” When-"
    },
    {
      "timestamp": "0:10:02.4",
      "speaker": "Megan Duclos",
      "text": "Hmm!"
    },
    {
      "timestamp": "0:10:03.0",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:10:02.4",
      "speaker": "Jason Staten",
      "text": "In turn she actually took on her dad’s real estate company when she was pretty young and so she did know what she was talking about."
    },
    {
      "timestamp": "0:10:11.8",
      "speaker": "Adam Garrett-Harris",
      "text": "She ran a building in New York City."
    },
    {
      "timestamp": "0:10:13.6",
      "speaker": "Jason Staten",
      "text": "Yeah!"
    },
    {
      "timestamp": "0:10:14.3",
      "speaker": "Megan Duclos",
      "text": "Yeah. Yeah."
    },
    {
      "timestamp": "0:10:15.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:10:16.2",
      "speaker": "Jason Staten",
      "text": "That intimidates me."
    },
    {
      "timestamp": "0:10:17.1",
      "speaker": "Megan Duclos",
      "text": "Yeah! (laughs) Well, yeah. Just, like, putting all of these life experiences together in the skills she had, and what she taught herself, and just all the nonsense she dealt with... It’s just, I’m a big fan. I’m fangirling right now and I’m not ashamed. She’s just great."
    },
    {
      "timestamp": "0:10:38.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, so I really did, I loved her story of how she became a programmer and it doesn’t get into that until part four."
    },
    {
      "timestamp": "0:10:46.5",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:10:47.2",
      "speaker": "Adam Garrett-Harris",
      "text": "In 1970 she was a student at Cornell University. She lived in a farm house and met these poor farmers nearby and then she kind of moved away and lost connections. Then the Sony Portapak came out which was this low-cost, high-quality video camera and it cost $1500 which was, like-"
    },
    {
      "timestamp": "0:11:09.0",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:11:09.2",
      "speaker": "Adam Garrett-Harris",
      "text": "I think she said $9,000 in today’s money or something. So it’s really expensive. They got a grant to get it, plus some other gear that they needed, started a club, and started making documentary videos and it was always trying to promote social change. They would film an addict shooting up to dispel any glamour that drugs are glamorous. They did one about the Onondaga Indians fighting to prevent the construction of a road through their land and they taught classes on it."
    },
    {
      "timestamp": "0:11:42.2",
      "text": "Then they made a video of these farmers, I thought this was really interesting, the farmers had milk cans that would get picked up by a co-op and then all of a sudden the co-op said, “No, you need to buy this giant tank.” And the tank was prohibitively expensive for them. So they couldn’t afford the debt because it cost tens of thousands of dollars for the tank and honestly, they would need twice as many cows to even fill it up to a decent level. So they made a documentary about this, tried to show that, you know, it’s more efficient but it’s going to drive out small dairies, and in the end the milk collective still won. "
    },
    {
      "timestamp": "0:12:18.5",
      "text": "But then, years later, she’s just walking down the street and sees a TRS-80 in a window and she’s like, “Well, I don’t know anything about computers but it’s technology, kind of like the portapak. It’s like personal technology, so it’s for individuals.” So she thought, “I can fool around with it and see what happens.” You know? It promises adventures in electronics and she was just kind of wondering, “What could you do with it, you know? Could you make art with it?” And that’s what led to her career as a programmer. Like, a year later she got her first job as a programmer. "
    },
    {
      "timestamp": "0:12:51.8",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:12:52.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Because there was such a lack of programmers, because computer science was just a sub department of engineering and engineers don’t want to go write code, so anyone who had written any code could get a job. So she turned down all sorts of job offers, worked temp jobs, taught herself, learned BASIC, and became an ordinary computer programmer, and then eventually became a software engineer. And I feel like, now, that distinction is kind of lost. We just call people software engineers right away."
    },
    {
      "timestamp": "0:13:27.6",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:13:28.3",
      "speaker": "Jason Staten",
      "text": "Yeah, we’re definitely quick to jump into it. I think, also, the accessibility of getting in now is definitely lower in some regards. Like, having a TS-80, like, going out and making that purchase is prohibitively expensive for many, many people. And so the fact that, like, she was able to do that, like-"
    },
    {
      "timestamp": "0:13:55.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:13:55.6",
      "speaker": "Jason Staten",
      "text": "...got her into that. So, in some ways, we have certainly lowered barriers; but I mean, continuing along that thought is, like, she had her flow but I love that she also reflected at what we now have for, kind of, intro to programming, and-"
    },
    {
      "timestamp": "0:14:15.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh, yeah!"
    },
    {
      "timestamp": "0:14:16.1",
      "speaker": "Jason Staten",
      "text": "And the review-"
    },
    {
      "timestamp": "0:14:16.6",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:14:17.3",
      "speaker": "Jason Staten",
      "text": "Of, like, the… what is it? Udemy course?"
    },
    {
      "timestamp": "0:14:19.7",
      "speaker": "Megan Duclos",
      "text": "Yeah (laughs)"
    },
    {
      "timestamp": "0:14:20.6",
      "speaker": "Jason Staten",
      "text": "And just, kind of, her perspective on, like, what it takes to learn Python. Like, if you go and Google, “Learn Python” you’re probably going to wind up on this course. So how you are, kind of, met with, she describes it as (laughs) four men standing in a semi-circle in front of you-"
    },
    {
      "timestamp": "0:14:42.6",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Four white men."
    },
    {
      "timestamp": "0:14:43.4",
      "speaker": "Jason Staten",
      "text": "Yes. And trying to be humorous by having you do your first exercise being, “Rock, paper, scissor, lizard, spock.” And making, like, immediately making some type of cultural reference that you may not be able to connect with."
    },
    {
      "timestamp": "0:15:00.9",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:15:01.5",
      "speaker": "Jason Staten",
      "text": "And, I mean, in some ways it’s like, it’s giving you that intro of, like, yeah, this is the type of stuff that you’ll encounter. But at the same time, like, it could be a very fast turn off for people to say, “Oh, this isn’t the place for me.”"
    },
    {
      "timestamp": "0:15:18.4",
      "speaker": "Megan Duclos",
      "text": "Yeah, yeah."
    },
    {
      "timestamp": "0:15:19.6",
      "speaker": "Jason Staten",
      "text": "And, like, it made me cringe."
    },
    {
      "timestamp": "0:15:22.9",
      "speaker": "Megan Duclos",
      "text": "(laughs) I really loved that part, too. I loved her description of the guys on the video and how she talked about how, I don’t know if she used this word in the book, but she talked about how it was kind of endearing and she kind of just loved them."
    },
    {
      "timestamp": "0:15:40.8",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:15:40.1",
      "speaker": "Megan Duclos",
      "text": "Or was it someone else? I don’t remember but she was just like, “It’s like these nerds with, like, their terrible dad jokes.”"
    },
    {
      "timestamp": "0:15:48.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, yeah."
    },
    {
      "timestamp": "0:15:48.4",
      "speaker": "Megan Duclos",
      "text": "And it was so familiar to her and it was, kind of like you said, she said you may realize this is not the type of people you want to be working with, but it is kind of going to be the type of people you’ll be working with so it was kind of accurate. (laughs)"
    },
    {
      "timestamp": "0:16:03.4",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Yeah."
    },
    {
      "timestamp": "0:16:03.5",
      "speaker": "Jason Staten",
      "text": "Yeah, and then kind of the second side of it is where you have those forums of people who are actually, like, struggling through this and making their way along despite things that may sway them the wrong way. And I do feel like she does a pretty good of job of not necessarily, like, calling them out as being malicious or of being gatekeepers, but rather just, like, it is kind of the structural norms that exist and that we’re familiar with and it’s like, biases that we’re unaware of."
    },
    {
      "timestamp": "0:16:38.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. Yeah, there is a good quote in this section. It says, The crucial question, the answer to which determines how easily one crosses into the programming room—indeed, into any room—is this: Do you feel invited in?"
    },
    {
      "timestamp": "0:16:53.2",
      "speaker": "Megan Duclos",
      "text": "Yes!"
    },
    {
      "timestamp": "0:16:54.9",
      "speaker": "Jason Staten",
      "text": "Yeah."
    },
    {
      "timestamp": "0:16:53.8",
      "speaker": "Adam Garrett-Harris",
      "text": "And it’s so true. You walk into a room, whether you’re walking into a church, or you’re walking into a gym, or walking into a workplace, or a school, is there anyone here who looks like me?"
    },
    {
      "timestamp": "0:17:06.6",
      "speaker": "Megan Duclos",
      "text": "Yep."
    },
    {
      "timestamp": "0:17:06.6",
      "speaker": "Jason Staten",
      "text": "Mm-hmm (affirmative). And for some people that is dramatically easier than others. (laughs)"
    },
    {
      "timestamp": "0:17:12.0",
      "speaker": "Megan Duclos",
      "text": "Yes. (laughs)"
    },
    {
      "timestamp": "0:17:12.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yep."
    },
    {
      "timestamp": "0:17:13.6",
      "speaker": "Jason Staten",
      "text": "Hmm."
    },
    {
      "timestamp": "0:17:15.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, so she did that Python course and then she did The Design and Analysis of Algorithms course."
    },
    {
      "timestamp": "0:17:22.4",
      "speaker": "Megan Duclos",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:17:23.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Taught by some university, I don’t remember which one."
    },
    {
      "timestamp": "0:17:26.8",
      "speaker": "Jason Staten",
      "text": "I don’t-"
    },
    {
      "timestamp": "0:17:26.8",
      "speaker": "Megan Duclos",
      "text": "Was it MIT? Was it-"
    },
    {
      "timestamp": "0:17:28.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Stanford, maybe?"
    },
    {
      "timestamp": "0:17:29.0",
      "speaker": "Jason Staten",
      "text": "Stanford? Yeah."
    },
    {
      "timestamp": "0:17:30.0",
      "speaker": "Megan Duclos",
      "text": "Stanford… it was some, ivy-league something."
    },
    {
      "timestamp": "0:17:33.2",
      "speaker": "Adam Garrett-Harris",
      "text": "And right off the bat, here's the reasons to learn Algorithms; impress prospective employer, ace your technical interviews, become a card-carrying computer scientist-"
    },
    {
      "timestamp": "0:17:43.8",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:17:44.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Have the lingo to fit into the higher levels of the technical community, and you won’t feel excluded at dinner parties where they joke about Dykstra’s algorithm."
    },
    {
      "timestamp": "0:17:53.0",
      "speaker": "Jason Staten",
      "text": "Yeah."
    },
    {
      "timestamp": "0:17:54.0",
      "speaker": "Megan Duclos",
      "text": "(laughs) Those are really silly reasons to learn Algorithms."
    },
    {
      "timestamp": "0:17:58.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, but honestly, the “technical interviews” is a big one."
    },
    {
      "timestamp": "0:18:02.4",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:18:03.3",
      "speaker": "Jason Staten",
      "text": "Yeah, that’s very true. I had to think about that a little bit with Dykstra’s algorithm because we did that in “The Imposter’s Handbook”-"
    },
    {
      "timestamp": "0:18:13.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Right."
    },
    {
      "timestamp": "0:18:14.2",
      "speaker": "Jason Staten",
      "text": "When we went through that long, long ago. I mean, I could still definitely not implement it off the cuff, but that is the reality of interviews, though. You get that sort of stuff thrown at you where it’s totally irrelevant to your day-to-day and-"
    },
    {
      "timestamp": "0:18:30.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:18:31.7",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:18:31.9",
      "speaker": "Jason Staten",
      "text": "I mean, other than, like, you can think through a problem. But I do not know the last time at work where I thought to myself, “Eureka! I no longer have to do this in N squared polynomial time, but rather, like, I can get it in Big O(n) now!”"
    },
    {
      "timestamp": "0:18:49.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:18:50.6",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:18:51.1",
      "speaker": "Adam Garrett-Harris",
      "text": "But it talks about how, okay this is a Stanford course but you’re not getting the Stanford experience."
    },
    {
      "timestamp": "0:18:57.2",
      "speaker": "Jason Staten",
      "text": "Hmm."
    },
    {
      "timestamp": "0:18:57.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Because you're not in the room, you don’t have access to the professor’s office hours, I don’t even think they had a forum, and then the grading was not accurate because-"
    },
    {
      "timestamp": "0:19:08.2",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:19:09.4",
      "speaker": "Adam Garrett-Harris",
      "text": "They couldn’t have a person grade your work, there were too many people in the course, so they had an automated system and the automated system just wasn’t very good. So you couldn’t know for sure if you were actually learning it."
    },
    {
      "timestamp": "0:19:21.5",
      "text": "And then at one point, the professor, like, turns to the camera and he’s like, “What do I expect of you? Nothing.” (laughs) "
    },
    {
      "timestamp": "0:19:28.7",
      "speaker": "Jason Staten",
      "text": "“Nothing.” (laughs)"
    },
    {
      "timestamp": "0:19:30.9",
      "speaker": "Megan Duclos",
      "text": "That’s so disheartening to hear."
    },
    {
      "timestamp": "0:19:32.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:19:33.3",
      "speaker": "Megan Duclos",
      "text": "She said, she’s like, I could practically, like, see so many people just closing the window and not coming back because who wants to hear that from an instructor of a class?"
    },
    {
      "timestamp": "0:19:43.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and then, you know, so later on she’s feeling more and more excluded from that class and wondering, like, “Well how do I even get invited to a dinner party where they’re joking about Dykstra’s algorithm and what would that joke even be?”"
    },
    {
      "timestamp": "0:19:59.2",
      "speaker": "Megan Duclos & Jason Staten",
      "text": "(laughing)"
    },
    {
      "timestamp": "0:20:01.0",
      "speaker": "Adam Garrett-Harris",
      "text": "And then the next course she went through was ‘Programming For Everyone’ and she was like, “This is going to be it! This is going to be the course I’m looking for that... it’s for everyone!”"
    },
    {
      "timestamp": "0:20:08.9",
      "speaker": "Megan Duclos",
      "text": "It was so close to being it. (laughs)"
    },
    {
      "timestamp": "0:20:11.3",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:20:11.3",
      "speaker": "Adam Garrett-Harris",
      "text": "And then before she even started the course, she found the instructor interviewing another instructor, so he had a whole bunch of courses taught by different people, ‘Programming is For Everyone…’ on different topics, and he turned out to be, like, a sexist mansplainer."
    },
    {
      "timestamp": "0:20:30.3",
      "speaker": "Jason Staten",
      "text": "(Scoffs)"
    },
    {
      "timestamp": "0:20:30.7",
      "speaker": "Megan Duclos",
      "text": "Yup."
    },
    {
      "timestamp": "0:20:31.9",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Oh, I could not believe it! She put the exact transcript in the book."
    },
    {
      "timestamp": "0:20:37.6",
      "speaker": "Megan Duclos",
      "text": "Oh, she did?"
    },
    {
      "timestamp": "0:20:38.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. Where she said something about, the woman instructor said something about, “Oh yeah! I just learned about how the menu with three lines, that’s called a hamburger menu.”"
    },
    {
      "timestamp": "0:20:52.0",
      "speaker": "Jason Staten",
      "text": "Oh, yeah."
    },
    {
      "timestamp": "0:20:52.6",
      "speaker": "Megan Duclos",
      "text": "Yeah. Yeah, and then he just-"
    },
    {
      "timestamp": "0:20:53.8",
      "speaker": "Adam Garrett-Harris",
      "text": "And then he was like, “You just learned that?” And then he starts mansplaining to her about it."
    },
    {
      "timestamp": "0:20:58.8",
      "speaker": "Megan Duclos",
      "text": "And it was a live stream. Like, it wasn’t-"
    },
    {
      "timestamp": "0:21:01.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh, yeah."
    },
    {
      "timestamp": "0:21:01.9",
      "speaker": "Megan Duclos",
      "text": "Just some prerecorded video that he could have edited it out, it was a live stream. So he, like, completely goes from, “Yeah, we’re gonna, this is what our course is, this is what we’ll teach you about.” To, like, publicly shaming her for not knowing a thing which is just ridiculous."
    },
    {
      "timestamp": "0:21:17.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, you can’t know everything and yeah…"
    },
    {
      "timestamp": "0:21:22.3",
      "speaker": "Jason Staten",
      "text": "I think there’s a relevant XKCD for that where… when you say something to somebody and you say, “What? You don’t know about this?” As, like, a downward thing?"
    },
    {
      "timestamp": "0:21:34.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah!"
    },
    {
      "timestamp": "0:21:34.9",
      "speaker": "Jason Staten",
      "text": "When, in fact, like, nobody knows everything, like you said, and so be joyous that they’re getting to experience that new thing."
    },
    {
      "timestamp": "0:21:44.0",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:21:44.6",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:21:45.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. Oh, and he also made a really dumb joke. He said, “Do you know what it’s called when those three little lines, when there’s a shape of a human cut out in the three little lines?” Which, that question doesn’t even make sense."
    },
    {
      "timestamp": "0:21:56.6",
      "speaker": "Megan Duclos",
      "text": "A, what did he say? A Man hamburger or something? What did he say?"
    },
    {
      "timestamp": "0:21:59.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, he said it’s called a manburger. That doesn’t even make sense!"
    },
    {
      "timestamp": "0:22:04.2",
      "speaker": "Megan Duclos",
      "text": "It’s just a bad joke."
    },
    {
      "timestamp": "0:22:05.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and he was like, “You got to know what the hamburger icon is, and you have to know what manburger icon is.”"
    },
    {
      "timestamp": "0:22:11.9",
      "speaker": "Megan Duclos",
      "text": "I, it just, it’s just not even funny. Like… (laughs)"
    },
    {
      "timestamp": "0:22:13.7",
      "speaker": "Adam Garrett-Harris",
      "text": "No. But she had a good quote in here, too. She said, “Here’s your chance-” I mean, she was just not interested in the course anymore, but she said, “Here’s your chance to learn the difficult feat of looking at prejudice and refusing to be diminished.”"
    },
    {
      "timestamp": "0:22:27.6",
      "speaker": "Jason Staten",
      "text": "Hmm."
    },
    {
      "timestamp": "0:22:28.2",
      "speaker": "Megan Duclos",
      "text": "Yeah. That’s a good line."
    },
    {
      "timestamp": "0:22:29.1",
      "speaker": "Adam Garrett-Harris",
      "text": "So, like, just learn what you need to know from this man and move on with your life."
    },
    {
      "timestamp": "0:22:35.2",
      "speaker": "Megan Duclos",
      "text": "Yeah, yeah. Take what you need and leave the rest."
    },
    {
      "timestamp": "0:22:39.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. (laughs)"
    },
    {
      "timestamp": "0:22:39.9",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:22:40.6",
      "speaker": "Adam Garrett-Harris",
      "text": "And again, like, just like the dad jokes and the sci-fi references and U.S. television references, this is kind of what it’s going to be like, unfortunately."
    },
    {
      "timestamp": "0:22:50.1",
      "speaker": "Jason Staten",
      "text": "Which is disheartening given, like, her aspirations that, like, programming really does need to be opened up to everybody. And not necessarily that everybody needs to be a programmer, but rather that it should be an accessible thing to everybody rather than a select few because, like, if you think... if you just have this small niche of society that is making all of these grand decisions for everybody, like, they can’t be culturally sensitive or aware of everybody’s life situation."
    },
    {
      "timestamp": "0:23:23.1",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:23:24.0",
      "speaker": "Jason Staten",
      "text": "And so, but yet that is what’s built around them. I mean in-"
    },
    {
      "timestamp": "0:23:30.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:23:30.8",
      "speaker": "Jason Staten",
      "text": "Reading the book, “Technically Wrong” a while back, and like, seeing things as simple as a bathroom scale that says, “Good job!” If you’re losing weight when in fact you may not be needing to lose weight."
    },
    {
      "timestamp": "0:23:46.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:23:47.5",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:23:48.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Could be going through chemotherapy."
    },
    {
      "timestamp": "0:23:50.2",
      "speaker": "Jason Staten",
      "text": "Exactly."
    },
    {
      "timestamp": "0:23:50.7",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:23:51.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, um-"
    },
    {
      "timestamp": "0:23:52.5",
      "speaker": "Megan Duclos",
      "text": "Or, like, have an eating disorder and that’s just reinforcing the eating disorder. Yeah, it’s just… that’s not good."
    },
    {
      "timestamp": "0:24:01.0",
      "speaker": "Adam Garrett-Harris",
      "text": "And she mentions as well, first off we need to welcome diversity into the mono culture that exists within and we need to challenge the biased data. So that goes back to “Technically Wrong”, or “You Look Like a Thing and I Love You” where the machine-learning Algorithms are fed all this previous biased data. We need to challenge that."
    },
    {
      "timestamp": "0:24:22.9",
      "speaker": "Megan Duclos",
      "text": "Yeah, for sure. I really loved her sentiment on this subject, just talking about, not just for these reasons should people have, kind of, a basic understanding of programming and software engineering, but… well, what was it? She was saying, like the general public should know that humans are writing this code and what type of thought processes we go through while we’re writing the code, how to, kind of, think like a computer."
    },
    {
      "timestamp": "0:24:54.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:24:56.5",
      "speaker": "Megan Duclos",
      "text": "Because it can, I can’t remember exactly what it was and I might just be making this up or maybe this was, like, a thought I had because of something that she said, but I think it informs other people how, I mean, how to do their jobs, how to, kind of, work around that because technology isn’t going away, it’s only going to become a bigger part of our lives. And…"
    },
    {
      "timestamp": "0:25:21.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:25:22.2",
      "speaker": "Megan Duclos",
      "text": "And just having the general public have even a basic understanding of how it works under the cover, one, helps you be more informed when it comes to things like privacy and security; but also, it can kind of inform the way that you, I don’t know, use it. I don’t know what I’m trying to say here. (laughs)"
    },
    {
      "timestamp": "0:25:41.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. Yeah, she also mentioned that one third of humanity has access to the internet."
    },
    {
      "timestamp": "0:25:49.8",
      "speaker": "Megan Duclos",
      "text": "Hmm."
    },
    {
      "timestamp": "0:25:50.5",
      "speaker": "Adam Garrett-Harris",
      "text": "And the other two thirds, even though they don’t have access to the internet, are still subject to that code running on the internet."
    },
    {
      "timestamp": "0:25:56.6",
      "speaker": "Megan Duclos",
      "text": "Yes. Yeah."
    },
    {
      "timestamp": "0:25:58.1",
      "speaker": "Jason Staten",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:25:58.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Because governments run off of it and all sorts of things around them run off of it."
    },
    {
      "timestamp": "0:26:02.9",
      "speaker": "Megan Duclos",
      "text": "Yeah. I liked when she talked about, like, Google’s… I don’t remember what it’s called, Google did a thing trying to bring the internet to everyone?"
    },
    {
      "timestamp": "0:26:14.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh! Project Loon."
    },
    {
      "timestamp": "0:26:15.7",
      "speaker": "Jason Staten",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:26:16.5",
      "speaker": "Megan Duclos",
      "text": "Is that was it is? Yeah. And they’re trying to bring the internet to everyone and she’s like, “Well, in a third world country, if you get, You know, if you’re starving and there’s no food available to you, the internet’s not going to help you. If you get Malaria, the internet’s not going to treat you.”"
    },
    {
      "timestamp": "0:26:35.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, there was a quote from Bill Gates on that topic."
    },
    {
      "timestamp": "0:26:39.3",
      "speaker": "Megan Duclos",
      "text": "Oh, yeah."
    },
    {
      "timestamp": "0:26:39.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Because Bill Gates, I mean he’s a computer guy, but he’s a philanthropist now. He’s trying to cure the entire world of Polio and…"
    },
    {
      "timestamp": "0:26:47.7",
      "speaker": "Jason Staten",
      "text": "Covid!"
    },
    {
      "timestamp": "0:26:48.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! And Covid now. And trying to-"
    },
    {
      "timestamp": "0:26:50.4",
      "speaker": "Megan Duclos",
      "text": "Except for the rumors that he started it. Nevermind. (laughs) I’m just, the conspiracy theory there is just nonsense."
    },
    {
      "timestamp": "0:26:58.7",
      "speaker": "Adam Garrett-Harris",
      "text": "So many conspiracy theories."
    },
    {
      "timestamp": "0:27:01.6",
      "speaker": "Megan Duclos",
      "text": "Yeah. Sorry, I got sidetracked."
    },
    {
      "timestamp": "0:27:02.1",
      "speaker": "Adam Garrett-Harris",
      "text": "And trying to get clean water to people. So he’s trying to put his money where it has the biggest impact and (laughs) getting internet to people is just ridiculous when they have Malaria or just, they have bigger concerns."
    },
    {
      "timestamp": "0:27:18.8",
      "speaker": "Megan Duclos",
      "text": "Yeah. Yeah, it’s like the hierarchy of needs. They’re just going, like, straight to the top when there’s like, some really base-level foundational things that these people need."
    },
    {
      "timestamp": "0:27:28.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yes. Well, I’m miserable, but at least I have the internet."
    },
    {
      "text": "________________"
    },
    {
      "timestamp": "0:27:35.3",
      "speaker": "Adam Garrett-Harris",
      "text": "This episode of BookBytes is sponsored by Pluralsight. Pluralsight is the technology skills platform. You can see where your skills stand, master the latest technologies and show off your expertise."
    },
    {
      "timestamp": "0:27:47.3",
      "text": "They’re currently hiring in Salt Lake City and Boston. They work in small, cross-functional, autonomous teams focused on creating products all the way from talking to customers, coming up with a plan, and testing the solution."
    },
    {
      "timestamp": "0:28:01.0",
      "text": "Each team is autonomous so they own the discovery, design, development, delivery, and production support of their part of the overall system. They encourage test-driven development, pair programming, continuous delivery, as well as refactoring clean code. "
    },
    {
      "timestamp": "0:28:15.1",
      "text": "I actually work there myself and they’re an online learning company and have a culture of continuous learning. They have book clubs and discussion groups which, if you’re listening to this podcast, you would love. "
    },
    {
      "timestamp": "0:28:29.0",
      "text": "Pluralsight was named the #9 Best Workplace and One of the Best Workplaces for Women by Great Place to Work. If you want to work there visit Pluralsight.com/careers/engineering to learn to more. "
    },
    {
      "timestamp": "0:28:40.7",
      "text": "And for those of you who would be interested in checking it out yourself, you can DM @Pluralsight on Twitter and they’ll send you a free trial code so you can check it out for yourself. "
    },
    {
      "timestamp": "0:28:49.9",
      "text": "And thanks to Pluralsight for sponsoring the show. "
    },
    {
      "text": "(Typewriter Dings)"
    },
    {
      "text": "________________"
    },
    {
      "timestamp": "0:28:54.1",
      "speaker": "Megan Duclos",
      "text": "(laughs) Can we talk about the”Close to the Mainframe” essay?"
    },
    {
      "timestamp": "0:28:58.9",
      "speaker": "Jason Staten",
      "text": "Yes, please."
    },
    {
      "timestamp": "0:28:59.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah!"
    },
    {
      "timestamp": "0:29:00.0",
      "speaker": "Megan Duclos",
      "text": "I feel like that was a big one, right?"
    },
    {
      "timestamp": "0:29:02.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:29:03.3",
      "speaker": "Jason Staten",
      "text": "I had a question on that."
    },
    {
      "timestamp": "0:29:06.1",
      "speaker": "Megan Duclos",
      "text": "Oh?"
    },
    {
      "timestamp": "0:29:06.6",
      "speaker": "Jason Staten",
      "text": "So, I mean, I really loved just from the start of it where she says, “In 1981, I decided I could not be a real programmer until I had experience on a mainframe computer. This was a completely abstract idea. I had no idea how to program a mainframe computer.”"
    },
    {
      "timestamp": "0:29:23.9",
      "text": "And I actually had a question for the both of you and that was, have you ever held yourself, or do you hold yourself to a criteria that you need to do something in order to be a real programmer? Not necessarily for everyone, but yourself? "
    },
    {
      "timestamp": "0:29:36.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm. Yeah, actually. I’ve thought about this with front end versus back end, or front end versus full stack. I, kind of, I don’t, I know front end developers are real developers and I love the front end, but I wanted to have that under my belt to feel like a real programmer."
    },
    {
      "timestamp": "0:29:54.7",
      "speaker": "Jason Staten",
      "text": "I can see that."
    },
    {
      "timestamp": "0:29:57.2",
      "speaker": "Megan Duclos",
      "text": "Yeah, yeah. I can see that, too. I feel kind of similarly but now that you bring up the question, I’m kind of challenging that thought of, you know, I have to meet these requirements to be a real software engineer or a real programmer because when I... when she got to that part and she was saying that, I was like, that’s just silly, especially now. Like, you don’t need to be close to the mainframe in order to really be a programmer because there’s.. you know, it’s evolved so much; there’s so many other layers of abstraction between the mainframe and most everyday software engineers that that’s just, like, that’s just such a silly thing."
    },
    {
      "timestamp": "0:30:48.4",
      "text": "And it probably wasn’t silly to her, and especially at the time it wasn’t, so I’m not trying to diminish that at all; but, like, it just seemed outrageous. Like, “Oh well I can’t hold myself to that kind of a standard.” (laughs) But, like, it kind of put into perspective, especially with you asking that question of like, I don’t have any specifics, but I do kind of have that Imposter syndrome sometimes where, like, I’ll see or come across something that I know nothing about and I’ll just be like, “Well, I guess I’m not really that smart, or I guess I really am not a real programmer.” "
    },
    {
      "timestamp": "0:31:22.1",
      "text": "But that perspective there, like seeing her say something like that about herself, and me seeing how me thinking that that’s a little extreme can kind of help me challenge those imposter syndrome thoughts in myself. "
    },
    {
      "timestamp": "0:31:37.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm. Yeah, there’s actually some really good quotes later on in a different chapter about Imposter’s syndrome."
    },
    {
      "timestamp": "0:31:45.7",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:31:46.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Where she’s moved on from job to job, but the quote says, “That state of not knowing proved permanent as I moved from machine to machine, operating system to operating system, language to language; each move a re-encounter with bafflement, as was my introduction to the mainframe.”"
    },
    {
      "timestamp": "0:32:02.2",
      "speaker": "Megan Duclos",
      "text": "(laughs) Yeah."
    },
    {
      "timestamp": "0:32:02.8",
      "speaker": "Adam Garrett-Harris",
      "text": "“Failing was also a permanent state of affairs; programs crash, the causes of bugs hide from discovery, designs lead to dead ends, goals are ill-conceived, deadlines are absurd. One must develop a high tolerance for failure, learn to move forward from discouragement, find a ferocious determination, a near passionate obsession to solve a problem; meanwhile, summoning the pleasures of the hunt."
    },
    {
      "timestamp": "0:32:27.3",
      "speaker": "Megan Duclos",
      "text": "Yeah, I think that was really well said and that it’s really just the nature of our line of work."
    },
    {
      "timestamp": "0:32:35.0",
      "speaker": "Adam Garrett-Harris",
      "text": "And she was, like, really scared about this Imposter’s syndrome."
    },
    {
      "timestamp": "0:32:38.8",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:32:39.7",
      "speaker": "Adam Garrett-Harris",
      "text": "She was just very aware of being self-taught that she said, “Aware at all times, I had only islands of knowledge separated by chasms of not knowing, into one of which, I was certain to fall.” And then eventually she talked to some post-doctoral student at Berkeley and he said, “oh, I feel that way all the time.”"
    },
    {
      "timestamp": "0:32:57.4",
      "speaker": "Megan Duclos",
      "text": "Yeah. (laughs) Yeah, I really identified with that line especially because I, I mean, I’m still pretty new to this line of work and I love it, but I also feel, yeah, I have these little islands of knowledge with huge chasms of the unknown still. And I know I’ll feel like that forever a little bit, but it can be a lot sometimes. (laughs)"
    },
    {
      "timestamp": "0:33:20.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:33:22.6",
      "speaker": "Jason Staten",
      "text": "I think she is a prime example of how to deal with that unknown."
    },
    {
      "timestamp": "0:33:28.2",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:33:28.2",
      "speaker": "Jason Staten",
      "text": "It’s seeing something in particular and saying, “Okay, well I don’t know that thing. I’m going to go do that thing so I know it.” Like, that is very much what is required in the career in general is-"
    },
    {
      "timestamp": "0:33:41.5",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:33:42.2",
      "speaker": "Jason Staten",
      "text": "Working in the unknowns."
    },
    {
      "timestamp": "0:33:44.0",
      "speaker": "Megan Duclos",
      "text": "So she decides to find a job working on a mainframe and she kind of lucked out to get this job. Like, the guy kind of begrudgingly gave her the job so that she’d be someone else’s problem. Like, she-"
    },
    {
      "timestamp": "0:33:59.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Right. (laughs)"
    },
    {
      "timestamp": "0:34:01.0",
      "speaker": "Megan Duclos",
      "text": "Like, her direct report was going to be someone else and it was someone he didn’t like. So he’s like, he told her after she’d started, like, “I thought you were going to be this other guy’s problem.” (laughs)"
    },
    {
      "timestamp": "0:34:18.2",
      "text": "And that’s just a really great thing to hear when you start a new job. "
    },
    {
      "timestamp": "0:34:21.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah…"
    },
    {
      "timestamp": "0:34:22.7",
      "speaker": "Megan Duclos",
      "text": "I’m sure, but she, yeah, she just dives in and she learns and she meets friends, like work friends, and then there’s this bug, can we talk about the bug? That she, like-"
    },
    {
      "timestamp": "0:34:37.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. Well, she-"
    },
    {
      "timestamp": "0:34:39.3",
      "speaker": "Megan Duclos",
      "text": "It inspired her book, “The Bug”!"
    },
    {
      "timestamp": "0:34:41.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh. She found a mentor and the mentor kind of taught her some stuff and then he said, “Go fix bugs.”"
    },
    {
      "timestamp": "0:34:48.6",
      "speaker": "Megan Duclos",
      "text": "Yeah. So she-"
    },
    {
      "timestamp": "0:34:49.9",
      "speaker": "Adam Garrett-Harris",
      "text": "She fixed like, three right off the bat."
    },
    {
      "timestamp": "0:34:52.3",
      "speaker": "Megan Duclos",
      "text": "Yeah. Yeah, and then she fixes, like, they had this huge long list of bugs and she fixes all but one, this one bug that just gave everyone trouble for years, and she shows her boss and he’s, like, pissed off about it. (laughs) Right? Am I remembering that correctly? He was, like, mad that she did all of that because he... I don’t remember why he was so mad, he just didn’t want her to do well?"
    },
    {
      "timestamp": "0:35:21.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and it took her, that one bug took her like 10 months."
    },
    {
      "timestamp": "0:35:26.4",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:35:27.6",
      "speaker": "Jason Staten",
      "text": "Yeah. [inaudible overlapping]"
    },
    {
      "timestamp": "0:35:27.6",
      "speaker": "Adam Garrett-Harris",
      "text": "But that bug had been there since the very beginning."
    },
    {
      "timestamp": "0:35:30.5",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:35:30.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Everyone knew about it. Someone would say, “Oh yeah, it’s closed.” It’s not closed. And then it would get reopened again and it would get closed again and-"
    },
    {
      "timestamp": "0:35:38.0",
      "speaker": "Megan Duclos",
      "text": "And then she found it."
    },
    {
      "timestamp": "0:35:39.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh! And one guy said, “Oh yeah, it's not our problem it’s in some vendor software.” And-"
    },
    {
      "timestamp": "0:35:44.4",
      "speaker": "Megan Duclos",
      "text": "Which, they didn’t even use third party software."
    },
    {
      "timestamp": "0:35:46.0",
      "speaker": "Jason Staten",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:35:47.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, she was, like, “That’s a lie.”"
    },
    {
      "timestamp": "0:35:48.7",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:35:49.4",
      "speaker": "Jason Staten",
      "text": "How many times have you pointed at external code to be the source of your problem? (laughs)"
    },
    {
      "timestamp": "0:35:53.2",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Yeah."
    },
    {
      "timestamp": "0:35:54.2",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:35:55.7",
      "speaker": "Jason Staten",
      "text": "I find that pretty much every time I do that it ultimately winds up being my own fault."
    },
    {
      "timestamp": "0:35:59.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:36:01.2",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:36:02.5",
      "speaker": "Adam Garrett-Harris",
      "text": "And another cool this about this story, this was originally published, the title of this was “Pencils” when it was published in Wired in 2013 because every day she would go into work there was a legless man selling #2 Ticer-, Ticonder-, anyway, selling #2 pencils. She would buy one every day and then she just had a stack of them."
    },
    {
      "timestamp": "0:36:22.7",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:36:24.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Then when she decided to buckle down and try to figure out this code, she... apparently you couldn’t just print stuff yourself, she had to put in an order to have some stuff printed and someone brought a stack of papers to her desk."
    },
    {
      "timestamp": "0:36:38.6",
      "speaker": "Megan Duclos",
      "text": "Of code!"
    },
    {
      "timestamp": "0:36:39.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Like, like they would-"
    },
    {
      "timestamp": "0:36:39.9",
      "speaker": "Megan Duclos",
      "text": "Printed code on paper!"
    },
    {
      "timestamp": "0:36:43.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and it was like the code that was accordion style that you could rip apart and it had the circles on the side that you could rip off?"
    },
    {
      "timestamp": "0:36:48.7",
      "speaker": "Jason Staten",
      "text": "The dot matrix? Yeah."
    },
    {
      "timestamp": "0:36:50.3",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:36:51.1",
      "speaker": "Adam Garrett-Harris",
      "text": "And she just leaned back in her chair, you know, just, it was so much nicer, especially considering the screen sizes they must have had on their desk, to have all of this paper and be able to see that much code at once, and use their pencils and mark it up, and you know? You can’t just read it straight through because there was GoTo statements, you gotta look around the different places; and she just read it, and read it, and read it, and read it; and used those pencils that she was buying!"
    },
    {
      "timestamp": "0:37:18.2",
      "speaker": "Megan Duclos",
      "text": "Yeah, I thought that was a really cool story."
    },
    {
      "timestamp": "0:37:19.8",
      "speaker": "Adam Garrett-Harris",
      "text": "And then when she actually found it, she showed the code, someone had typod a variable name and they had put an underscore instead of a dash in the variable name."
    },
    {
      "timestamp": "0:37:31.4",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:37:31.4",
      "speaker": "Adam Garrett-Harris",
      "text": "So they’re printing out the wrong variable that got initialized to zero and above."
    },
    {
      "timestamp": "0:37:38.0",
      "speaker": "Megan Duclos",
      "text": "Yep."
    },
    {
      "timestamp": "0:37:38.6",
      "speaker": "Adam Garrett-Harris",
      "text": "So that’s why that column was just always zero. But before that, she actually fixed a bug that actually wasn’t even documented that everyone knew was wrong where a number couldn’t be larger than... it would just truncate it after the ten thousands place."
    },
    {
      "timestamp": "0:37:51.8",
      "speaker": "Megan Duclos",
      "text": "Oh, yeah."
    },
    {
      "timestamp": "0:37:53.3",
      "speaker": "Jason Staten",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:37:54.3",
      "speaker": "Adam Garrett-Harris",
      "text": "‘Cause she was like, “Okay, what about this bug?”"
    },
    {
      "timestamp": "0:37:56.2",
      "text": "And then someone was like, “Oh yeah, that report is crap anyway because of this other bug.” You know? Back when it was written, $10,000 [pronounced ten thou-] was a lot of money. (laughs) "
    },
    {
      "timestamp": "0:38:04.9",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:38:07.1",
      "speaker": "Megan Duclos",
      "text": "(laughs) Yeah. That was good."
    },
    {
      "timestamp": "0:38:08.2",
      "speaker": "Adam Garrett-Harris",
      "text": "I also really liked the story about what we feared while we feared Y2K."
    },
    {
      "timestamp": "0:38:13.2",
      "speaker": "Jason Staten",
      "text": "That was a-"
    },
    {
      "timestamp": "0:38:15.1",
      "speaker": "Adam Garrett-Harris",
      "text": "“What we were afraid of as we feared Y2K.” So I was talking to my wife about this, too because she was under the impression that, you know, Y2K came and it went and for the average person, nothing happened. So she was under the impression that the media had just hyped it up and then it turns out it just wasn’t a problem at all; but this tells the story of her going around and talking to different people as they were trying to get their code Y2K-ready, and going to conferences and trying to see what people are doing to fix it, and it was a real problem, but people worked really hard and got it fixed."
    },
    {
      "timestamp": "0:38:53.5",
      "speaker": "Megan Duclos",
      "text": "Yeah, I was under the same impression until recently and then I realized, “Oh yeah, it really was kind of an issue that they had to fix.” But then reading this book, it was… I learned just how big of a project that was. If you can call that a project. (laughs)"
    },
    {
      "timestamp": "0:39:12.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. One interesting thing, well first off, she says it was called a millennium bug but it wasn’t really a bug because a bug is a piece of code that causes a problem to behave not as intended, but the decision to handle years as two digit numbers was intentional, conscious, and utterly rational."
    },
    {
      "timestamp": "0:39:30.6",
      "speaker": "Megan Duclos",
      "text": "Yep."
    },
    {
      "timestamp": "0:39:31.8",
      "speaker": "Adam Garrett-Harris",
      "text": "And then secondly she said it’s not a millennium bug because she thinks, you know, the millennium starts on the year 2001, which I can see both, both ways."
    },
    {
      "timestamp": "0:39:40.5",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:39:42.5",
      "speaker": "Jason Staten",
      "text": "Mm-hmm (affirmative).  I thought some of the perspective was, like, people thinking, “This code isn’t going to be running in 30 years.”"
    },
    {
      "timestamp": "0:39:50.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! (laughs) So they were, like-"
    },
    {
      "timestamp": "0:39:52.0",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:39:52.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Newer programmers and they had to bring in the older programmers to try to figure it out. And what was fascinating is that a lot of the code, they didn’t have the source code, they just had the assembler so they had to write translators to convert from the assembler to cobol, make sure that that’s actually the same program, and then fix the cobol."
    },
    {
      "timestamp": "0:40:13.2",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:40:14.2",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:40:15.1",
      "speaker": "Jason Staten",
      "text": "That just sounds brutal."
    },
    {
      "timestamp": "0:40:18.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! (laughs)"
    },
    {
      "timestamp": "0:40:18.3",
      "speaker": "Megan Duclos",
      "text": "It really does. It does not sound like fun at all."
    },
    {
      "timestamp": "0:40:21.5",
      "speaker": "Adam Garrett-Harris",
      "text": "I wonder at what point they said, “Okay! Let’s actually, finally prioritize this technical debt."
    },
    {
      "timestamp": "0:40:29.6",
      "speaker": "Megan Duclos",
      "text": "I don’t know."
    },
    {
      "timestamp": "0:40:29.8",
      "speaker": "Jason Staten",
      "text": "It didn’t…"
    },
    {
      "timestamp": "0:40:30.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Like, was it the beginning of 1999? Like, “Okay, you have one year.”"
    },
    {
      "timestamp": "0:40:34.5",
      "speaker": "Megan Duclos",
      "text": "Um, yeah. That's when she said she got a phone call from that guy, right? It was the beginning of ‘99?"
    },
    {
      "timestamp": "0:40:42.2",
      "speaker": "Adam Garrett-Harris",
      "text": "I think so."
    },
    {
      "timestamp": "0:40:43.0",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:40:43.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Another interesting part of this was Texaco. So, Texaco had to monitor the flow of oil and they have these little monitors along the line and, I don’t know, something about years was causing some problems with it, but if they didn’t fix the code then it would stop them from monitoring the oil flow and if that happened, and they couldn’t fix it within four hours, then they’d have to shut down the wells; and apparently if you shut down an oil well it’s not as if you can just start it right back up. You may not be able to start it again."
    },
    {
      "timestamp": "0:41:23.6",
      "speaker": "Megan Duclos",
      "text": "So, no pressure."
    },
    {
      "timestamp": "0:41:25.0",
      "speaker": "Jason Staten",
      "text": "Hmm."
    },
    {
      "timestamp": "0:41:25.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! (laughs)"
    },
    {
      "timestamp": "0:41:26.7",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:41:27.2",
      "speaker": "Adam Garrett-Harris",
      "text": "And they had to do all these weird things to make sure it would work; write some new code, test it in a different environment where you would set the year to December 31, 1999 and then watch the clock tick over and see what happens."
    },
    {
      "timestamp": "0:41:41.9",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:41:42.2",
      "speaker": "Adam Garrett-Harris",
      "text": "And then a lot of these people were relying on vendor software but then no one’s talking about their own fixes to Y2K so no one knows if the code they rely on is going to be fixed in time."
    },
    {
      "timestamp": "0:41:53.4",
      "speaker": "Jason Staten",
      "text": "I just pulled up something related to a code that would be running longer than you expected."
    },
    {
      "timestamp": "0:41:59.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Okay."
    },
    {
      "timestamp": "0:42:00.3",
      "speaker": "Jason Staten",
      "text": "So if you have an account for JetBlue, the airline, your password cannot contain Q or Z."
    },
    {
      "timestamp": "0:42:12.4",
      "speaker": "Adam Garrett-Harris",
      "text": "What?"
    },
    {
      "timestamp": "0:42:13.1",
      "speaker": "Jason Staten",
      "text": "And the… yes. So the-"
    },
    {
      "timestamp": "0:42:16.1",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:42:17.3",
      "speaker": "Jason Staten",
      "text": "The reason being is that there is, there was a touch tone phone airline booking program called Sabre that is still used today, it was created in, like, the ‘50s."
    },
    {
      "timestamp": "0:42:31.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:42:32.4",
      "speaker": "Megan Duclos",
      "text": "Sabre like on the… Sorry, I was going to make a dumb joke."
    },
    {
      "timestamp": "0:42:34.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Like, on The Office?"
    },
    {
      "timestamp": "0:42:35.9",
      "speaker": "Megan Duclos",
      "text": "Yeah! (laughs)"
    },
    {
      "timestamp": "0:42:37.1",
      "speaker": "Jason Staten",
      "text": "S-A-B-R-E."
    },
    {
      "timestamp": "0:42:38.8",
      "speaker": "Megan Duclos",
      "text": "Oh! B!"
    },
    {
      "timestamp": "0:42:39.2",
      "speaker": "Jason Staten",
      "text": "So a friend of mine is actually a travel agent and she still uses Sabre for booking-related stuff; and in order to login using that on the phone, like, it required you punching in your password and it just so happened that Q and Z are not mapped consistently on telephones."
    },
    {
      "timestamp": "0:43:03.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:43:04.0",
      "speaker": "Jason Staten",
      "text": "And so because of that, like, your password on JetBlue’s site was using that system from the ‘50s. So just think about that. Like, your internet-connected device is hitting something built in the ‘50s that, I mean, surely they, you know…"
    },
    {
      "timestamp": "0:43:22.3",
      "speaker": "Megan Duclos",
      "text": "That is a little stressful."
    },
    {
      "timestamp": "0:43:24.0",
      "speaker": "Jason Staten",
      "text": "(laughs) Yeah, like, you have to wonder, like, what the interface for that is. Like... (laughs)"
    },
    {
      "timestamp": "0:43:29.2",
      "speaker": "Megan Duclos",
      "text": "Just knowing that that exists is stressing me out. (laughs)"
    },
    {
      "timestamp": "0:43:35.0",
      "speaker": "ALL",
      "text": "(Laughing)"
    },
    {
      "timestamp": "0:43:36.7",
      "speaker": "Adam Garrett-Harris",
      "text": "I mean, I’ve seen the computers airlines type into, it looks very old."
    },
    {
      "timestamp": "0:43:42.2",
      "speaker": "Jason Staten",
      "text": "Yeah but, I mean, if it works and not only is the answer if it works, but also, like, it works and we don’t understand how it works but things rely on it working that way?"
    },
    {
      "timestamp": "0:43:57.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:43:57.6",
      "speaker": "Jason Staten",
      "text": "Then, like, changing it is only going to cause, like, an unknown set of problems. (laughs)"
    },
    {
      "timestamp": "0:44:04.3",
      "speaker": "Adam Garrett-Harris",
      "text": "It’s like when you have a dependency but the dependency has a bug and you’re relying on that bug so when the dependency fixes the bug it actually breaks something for you."
    },
    {
      "timestamp": "0:44:14.1",
      "speaker": "Jason Staten",
      "text": "Yes."
    },
    {
      "timestamp": "0:44:14.6",
      "speaker": "Megan Duclos",
      "text": "Yeah…"
    },
    {
      "timestamp": "0:44:15.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh! I forgot! One company, the way they dealt with Y2K is they reset their internal clocks to 1972-"
    },
    {
      "timestamp": "0:44:23.3",
      "speaker": "Megan Duclos",
      "text": "Oh, yeah, I remember that."
    },
    {
      "timestamp": "0:44:24.0",
      "speaker": "Adam Garrett-Harris",
      "text": "And the reason they set it to 1972 is the days of the week were all the same as the year 2000."
    },
    {
      "timestamp": "0:44:29.8",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:44:29.8",
      "speaker": "Adam Garrett-Harris",
      "text": "So it bought them, it bought them like 28 more years to figure out the problem."
    },
    {
      "timestamp": "0:44:33.8",
      "speaker": "Megan Duclos",
      "text": "Well, they’re coming up on those 28 years soon! (laughs)"
    },
    {
      "timestamp": "0:44:37.6",
      "speaker": "Jason Staten",
      "text": "Uh-huh."
    },
    {
      "timestamp": "0:44:38.6",
      "speaker": "Adam Garrett-Harris",
      "text": "They’ve got eight more! (laughs)"
    },
    {
      "timestamp": "0:44:40.6",
      "speaker": "Jason Staten",
      "text": "Yeah, I mean, I guess then, post-that, here’s the evercoming 2038 that we’re hitting. Or… something."
    },
    {
      "timestamp": "0:44:52.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Wait, what is that?"
    },
    {
      "timestamp": "0:44:54.0",
      "speaker": "Jason Staten",
      "text": "So in the 2038, if you’ve ever looked at a, like, timestamp that comes back, like the numeric ones, like the Unix time- [inaudible overlapping]"
    },
    {
      "timestamp": "0:45:06.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! Like the number of seconds..."
    },
    {
      "timestamp": "0:45:10.6",
      "speaker": "Jason Staten",
      "text": "Since, like, January 1, 1970, like-"
    },
    {
      "timestamp": "0:45:13.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:45:14.3",
      "speaker": "Jason Staten",
      "text": "You know, the dawn of computer time."
    },
    {
      "timestamp": "0:45:16.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. (laughs)"
    },
    {
      "timestamp": "0:45:16.8",
      "speaker": "Jason Staten",
      "text": "And so those, in many, many cases, are represented as a 32 bit number."
    },
    {
      "timestamp": "0:45:25.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:45:26.2",
      "speaker": "Jason Staten",
      "text": "And that number, in 2038, will hit its maximum and then ultimately will have to roll over."
    },
    {
      "timestamp": "0:45:35.5",
      "speaker": "Megan Duclos",
      "text": "Oh my god."
    },
    {
      "timestamp": "0:45:36.5",
      "speaker": "Jason Staten",
      "text": "And-"
    },
    {
      "timestamp": "0:45:37.7",
      "speaker": "Adam Garrett-Harris",
      "text": "She talks about this in the book! She’s like, “What's the upper limit?” You know? You have to specify an upper limit for the year. Like, should we worry about the year 9,000? 10,001? Like, what is it?"
    },
    {
      "timestamp": "0:45:49.2",
      "speaker": "Jason Staten",
      "text": "Yeah. So that’s something that only, like, recently have we gotten some fixes, I mean, it’s good we’re getting on top of some of it now but in the Linux Kernel, I believe that they have moved sed all of the date times to be 64 bit which buys us a whole lot more time."
    },
    {
      "timestamp": "0:46:12.0",
      "speaker": "Adam Garrett-Harris",
      "text": "A whole lot, yeah."
    },
    {
      "timestamp": "0:46:13.4",
      "speaker": "Jason Staten",
      "text": "Like-"
    },
    {
      "timestamp": "0:46:13.9",
      "speaker": "Adam Garrett-Harris",
      "text": "It’s exponential."
    },
    {
      "timestamp": "0:46:14.8",
      "speaker": "Jason Staten",
      "text": "Yeah. So, like, significantly more time out of it, but like, it’s been, like, years and years of effort to get that moved."
    },
    {
      "timestamp": "0:46:24.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh, wow."
    },
    {
      "timestamp": "0:46:25.1",
      "speaker": "Jason Staten",
      "text": "And even that is just like in modern Linux Kernels. And you’d think, like, even now with the number of, I don’t know, smart home devices, like, internet of things, like, that’s never going to get updated past that."
    },
    {
      "timestamp": "0:46:40.9",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Right."
    },
    {
      "timestamp": "0:46:41.4",
      "speaker": "Jason Staten",
      "text": "And so, like, I mean, there are so many things that are doomed to fail due to memory constraints on that front, that, like, whether processors can’t handle beyond 32 bits or, like, doing it I suppose, your code would use it and you would have to the processor in a non native way and so it would be a pretty big overhaul."
    },
    {
      "timestamp": "0:47:06.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:47:07.3",
      "speaker": "Jason Staten",
      "text": "And I mean, places already bump into it, though; in that some places start scheduling things out into the future and making distant predictions on what’s going to happen."
    },
    {
      "timestamp": "0:47:19.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh, yeah."
    },
    {
      "timestamp": "0:47:20.3",
      "speaker": "Jason Staten",
      "text": "And so, like, for some places, like, 2038 is real, because, I mean, it’s less than 20 years away."
    },
    {
      "timestamp": "0:47:27.9",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:47:28.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Wow. We only have a few minutes left. Does anyone else have, like, a favorite thing that we just haven’t covered yet?"
    },
    {
      "timestamp": "0:47:33.4",
      "speaker": "Megan Duclos",
      "text": "I’m trying to think."
    },
    {
      "timestamp": "0:47:34.3",
      "speaker": "Jason Staten",
      "text": "I don’t know how deep we can get into it due to time, but the bits about artificial life and, like-"
    },
    {
      "timestamp": "0:47:40.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah!"
    },
    {
      "timestamp": "0:47:42.7",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:47:41.8",
      "speaker": "Jason Staten",
      "text": "What is intelligence was totally unexpected for me, like, when just reading this book and hitting that section. And-"
    },
    {
      "timestamp": "0:47:52.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:47:53.2",
      "speaker": "Jason Staten",
      "text": "Like, I don’t want to spend way too much time due to time, but I did like her kind of explanation or her perspective that, like, intelligence being our ability to identify between other humans as well as amongst ourselves. Like, I can identify myself amongst the two of you and that identity shifts when I am in the room with somebody else, as well."
    },
    {
      "timestamp": "0:48:21.0",
      "speaker": "Megan Duclos",
      "text": "Yeah. I found that really interesting, too."
    },
    {
      "timestamp": "0:48:23.9",
      "speaker": "Adam Garrett-Harris",
      "text": "She also talks about the idea, she gets into philosophy a bit with this and mentions that, you know, maybe, maybe there really is something with biology that makes this possible that you just can’t replicate with a machine and that’s probably not a very popular idea right now when we’re trying to… I mean, not just right now, but over the last several decades we’ve been trying to make AI and we’ve always been thinking we’re really close to it."
    },
    {
      "timestamp": "0:48:52.5",
      "speaker": "Jason Staten",
      "text": "I think a factor is that we model our brains in terms of a computer. Or, I mean, how often do we say, like, “My brain is my computer.” But rather, like, the computer is a known model that we have and we apply it to our lesser understood brain."
    },
    {
      "timestamp": "0:49:08.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah!"
    },
    {
      "timestamp": "0:49:08.9",
      "speaker": "Jason Staten",
      "text": "Thus, like-"
    },
    {
      "timestamp": "0:49:09.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, she said it’s like circular logic, that you’re studying the brain by studying computers but you don’t know if the brain is even like a computer."
    },
    {
      "timestamp": "0:49:19.2",
      "speaker": "Jason Staten",
      "text": "Yeah. Hmm. It was definitely like a good thinking section and I-"
    },
    {
      "timestamp": "0:49:25.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:49:25.8",
      "speaker": "Jason Staten",
      "text": "I think that may actually be one that I go and relisten to if only to have the conversation with somebody else."
    },
    {
      "timestamp": "0:49:33.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:49:34.2",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:49:34.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and another thing about it is she says, “Okay, there’s Moore’s law, but there is no Moore’s law for software.” So in fact there may be like a reverse correlation, like, on the contrary. As the hardware, as systems increase in complexity, it becomes harder, a lot harder, to write reliable code. So even though computers are getting more and more powerful, the software isn’t keeping up with that."
    },
    {
      "timestamp": "0:49:58.2",
      "speaker": "Megan Duclos",
      "text": "Yeah. This one’s ,like, we don’t have to go into it because it’s just small, but I really liked the chapter on her cat! (laughs)"
    },
    {
      "timestamp": "0:50:05.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:50:06.7",
      "speaker": "Megan Duclos",
      "text": "I thought it was, I don’t know the word to use here, but I just, it kind of broke up some of the more technical things and showed her humanity in a different way; and the grief of losing her cat, and her relationship with the cat and did the cat love her?"
    },
    {
      "timestamp": "0:50:30.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. She compared it to a robot cat. A very basic robot cat."
    },
    {
      "timestamp": "0:50:35.4",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:50:35.9",
      "speaker": "Adam Garrett-Harris",
      "text": "But, you know, she wants to believe that the cat loves her, and-"
    },
    {
      "timestamp": "0:50:41.1",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:50:42.0",
      "speaker": "Adam Garrett-Harris",
      "text": "And so, that relates a lot to the artificial intelligence, like, how to… just something about artificial intelligence just doesn’t sit right with her and she just wants to believe that there’s something more to it."
    },
    {
      "timestamp": "0:50:54.9",
      "speaker": "Megan Duclos",
      "text": "Yeah. Yeah, I think that was a big part of why I liked it so much. She talked about artificial intelligence and she’d be talking about it with other people and she’d be bringing up these questions of, like, how… What is intelligence and how do you tell the difference between, you know, a human and a machine if we’re… you know, if we do reach this point where artificial intelligence is as intelligent as a human? You know, how do we tell the difference and what defines life?"
    },
    {
      "timestamp": "0:51:28.8",
      "text": "And most people would just… didn’t really care to have the conversation, at all. And even when they would listen to what she had to say they were just, like, “Why… like, that...” They seemed to really dismiss her there. "
    },
    {
      "timestamp": "0:51:43.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:51:44.0",
      "speaker": "Megan Duclos",
      "text": "But I think that what she had to say about it was really interesting because it’s important. Like, I don’t know… I don’t know how to… I haven’t fully formed my thought. (laughs)"
    },
    {
      "timestamp": "0:51:56.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. I’m right there with you, it was very interesting and I like the different perspective on it."
    },
    {
      "timestamp": "0:52:02.4",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:52:03.1",
      "speaker": "Adam Garrett-Harris",
      "text": "That, you know, maybe there’s something else here with artificial intelligence we’re not understanding or not thinking about and we should have a larger conversation about it and like, “What does it really mean…” Yeah, it was good."
    },
    {
      "timestamp": "0:52:09.6",
      "speaker": "Megan Duclos",
      "text": "Yeah. What does it really mean to be alive. Yeah."
    },
    {
      "timestamp": "0:52:15.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:52:15.4",
      "speaker": "Megan Duclos",
      "text": "Yeah. I really liked it."
    },
    {
      "timestamp": "0:52:16.1",
      "speaker": "Adam Garrett-Harris",
      "text": "And sentience! Like, how do you even define sentience?"
    },
    {
      "timestamp": "0:52:18.7",
      "speaker": "Megan Duclos",
      "text": "Yeah. It’s just a good book!"
    },
    {
      "timestamp": "0:52:21.5",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Yeah!"
    },
    {
      "timestamp": "0:52:22.7",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:52:23.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. I think it’s worth a reread and I would recommend it to anybody."
    },
    {
      "timestamp": "0:52:26.8",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:52:27.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Not even to just programmers because she explains things so well."
    },
    {
      "timestamp": "0:52:33.2",
      "speaker": "Megan Duclos",
      "text": "I agree. Yeah, it’s very accessible to someone who doesn’t know much about programming and I think it’s a really good look into, well, like, life as a technologist or life in code. Ha ha ha."
    },
    {
      "timestamp": "0:52:49.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. And then we didn’t talk about it, she talks about the first rise and fall of the internet and then now in 2017 she was predicting a second boom."
    },
    {
      "timestamp": "0:52:57.1",
      "speaker": "Megan Duclos",
      "text": "Oh, yeah! And she talked about… she talked about, like, the election in 2016 and-"
    },
    {
      "timestamp": "0:53:03.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:53:03.6",
      "speaker": "Megan Duclos",
      "text": "Yeah, that was good, too."
    },
    {
      "timestamp": "0:53:05.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh, yeah. She talked about how… that we’ve come to dismiss anybody who’s an intermediary."
    },
    {
      "timestamp": "0:53:14.1",
      "speaker": "Jason Staten",
      "text": "Yeah."
    },
    {
      "timestamp": "0:53:14.8",
      "speaker": "Adam Garrett-Harris",
      "text": "And so all of that tendency to dismiss an intermediaries has come to ground at the feet of Donald J. Trump where he can just say anything he wants to and dismiss mainstream media and people believe him."
    },
    {
      "timestamp": "0:53:31.9",
      "speaker": "Jason Staten",
      "text": "Yeah. I thought that the disintermediation was one of those things that, I mean, it was like the full circle type theme that came through, and-"
    },
    {
      "timestamp": "0:53:40.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:53:41.8",
      "speaker": "Jason Staten",
      "text": "I mean, I thought about it myself. Like, how many times do you think about the idea of, like, buying a car for example."
    },
    {
      "timestamp": "0:53:50.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:53:51.4",
      "speaker": "Jason Staten",
      "text": "And how dealers are scummy and only trying to get money out of you, like, and yet at the same time, how many, like, you know, interpersonal relationships are you losing from that? Whether it’s your mail carrier or, like, or food delivery person now. It’s just some fungible car that drops off food on your doorstep, you don’t really know who it is and like, that doesn’t matter."
    },
    {
      "timestamp": "0:54:20.2",
      "speaker": "Megan Duclos",
      "text": "Yeah."
    },
    {
      "timestamp": "0:54:20.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:54:20.9",
      "speaker": "Jason Staten",
      "text": "As long as it’s there, you know, you give them the thumbs up or thumbs down in the app. (laughs)"
    },
    {
      "timestamp": "0:54:25.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Speaking of fungible, there were 45 words in this book that I had to look up that I had no idea what they meant."
    },
    {
      "timestamp": "0:54:32.7",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:54:33.4",
      "speaker": "Adam Garrett-Harris",
      "text": "She uses some big words but I like it."
    },
    {
      "timestamp": "0:54:36.0",
      "speaker": "Megan Duclos",
      "text": "She does, yeah."
    },
    {
      "timestamp": "0:54:37.2",
      "speaker": "Adam Garrett-Harris",
      "text": "All right. That’s it. That’s the book. That was fun."
    },
    {
      "timestamp": "0:54:40.7",
      "speaker": "Jason Staten",
      "text": "Yeah."
    },
    {
      "timestamp": "0:54:40.7",
      "speaker": "Megan Duclos",
      "text": "It was fun."
    },
    {
      "timestamp": "0:54:41.8",
      "speaker": "Adam Garrett-Harris",
      "text": "All right. So that is “Life in Code”. Next time Jason and I will be going through “Seven Languages in Seven Weeks” and that’s going to be a lot of fun and a lot of hard work."
    },
    {
      "timestamp": "0:54:53.1",
      "speaker": "Megan Duclos",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:54:54.9",
      "speaker": "Adam Garrett-Harris",
      "text": "You can find the transcript and show notes at Orbit.fm/BookBytes, you can follow the podcast @BookBytesFM, and I’m on Twitter @AGarrHarr. Jason, where can people find you?"
    },
    {
      "timestamp": "0:55:09.6",
      "speaker": "Jason Staten",
      "text": "I’m on Twitter @StatenJason."
    },
    {
      "timestamp": "0:55:11.8",
      "speaker": "Adam Garrett-Harris",
      "text": "And Megan, where can people find you on the internet?"
    },
    {
      "timestamp": "0:55:14.8",
      "speaker": "Megan Duclos",
      "text": "Uh, I’m on all the things. I don’t post often, though, but I’m on Twitter, it’s Megan_Duclos."
    },
    {
      "timestamp": "0:55:26.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Cool. Okay, see you all next time."
    },
    {
      "timestamp": "0:55:28.4",
      "speaker": "Jason Staten",
      "text": "See ya!"
    },
    {
      "timestamp": "0:55:29.2",
      "speaker": "Megan Duclos",
      "text": "See ya!"
    },
    {
      "text": "(Exit music: Electro swing)"
    }
  ]
}