{
  "note": "Do not edit this file directly. Edit the txt file and then run the convertTranscript script to generate this file.",
  "podcast": "BookBytes",
  "episode": "25",
  "transcript": [
    {
      "text": "(Intro music: Electro swing)"
    },
    {
      "timestamp": "0:00:12.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Welcome to BookBytes, a book club podcast for developers. We are reading “Code Girls: The Untold Story of the American Women Code Breakers of World War II” by Liza Mundy, and today we’re going over Part III which is titled “The Tide Turns.” I’m Adam Garrett-Harris."
    },
    {
      "timestamp": "0:00:30.8",
      "speaker": "Jen Luker",
      "text": "I’m Jen Luker."
    },
    {
      "timestamp": "0:00:32.7",
      "speaker": "Safia Abdalla",
      "text": "I’m Safia Abdalla."
    },
    {
      "text": "(Typewriter Dings)"
    },
    {
      "timestamp": "0:00:36.7",
      "speaker": "Adam Garrett-Harris",
      "text": "All right, so I really liked this part. I think this was probably my favorite part of the whole book besides the introduction where they’re getting the secret letters, that was really cool, too. But… Like, some really cool stuff happened in this chapter where they actually start winning the war."
    },
    {
      "timestamp": "0:00:53.0",
      "speaker": "Safia Abdalla",
      "text": "Yeah. One of the new things that I learned in this chapter that I didn't know before was that there was an American Version of the Bombe, which I didn’t know."
    },
    {
      "timestamp": "0:01:04.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, how do you pronounce that? ‘Cause it’s like “bomb” with an “e” on the end."
    },
    {
      "timestamp": "0:01:09.4",
      "speaker": "Safia Abdalla",
      "text": "I call bombe [pronounced b-oh-m], but I don’t know if that’s just a little bit too pretentious? (laughs)"
    },
    {
      "timestamp": "0:01:14.3",
      "speaker": "Adam Garrett-Harris",
      "text": "No, I like it ‘cause I say “bomb” in my head but it sounds weird to say bomb because it’s not a bomb, it’s a computer."
    },
    {
      "timestamp": "0:01:20.5",
      "speaker": "Safia Abdalla",
      "text": "Yeah. I feel like we should go to Google for the official downlow on this."
    },
    {
      "timestamp": "0:01:26.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:01:26.1",
      "speaker": "Safia Abdalla",
      "text": "But yeah, that was one of the things I didn’t know, and I think I’m so used to hearing the storing of Turing and the Bombe that again, all of this stuff about the American side of the cryptographic effort is new to me."
    },
    {
      "timestamp": "0:01:39.5",
      "speaker": "Jen Luker",
      "text": "Isn’t it fascinating how much of that story we get from the European side and not from the American side?"
    },
    {
      "timestamp": "0:01:44.8",
      "speaker": "Safia Abdalla",
      "text": "Yeah, it is quite a bit fascinating. I wonder why. I wonder if it just has to do with, kind of, American intelligence’s security culture and their own, like, OpSec around stuff? Or… I don’t know. I can’t speak to that."
    },
    {
      "timestamp": "0:02:01.9",
      "speaker": "Jen Luker",
      "text": "Maybe it has something to do with the release of 007 and popularizing British spy campaigns."
    },
    {
      "timestamp": "0:02:09.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm. Yeah, so I’m just reading here in Wikipedia, finally looking this up right now, that it was designed in Poland. It started in Poland and it was the Bomba, which was Polish, so that’s probably where it gets its name."
    },
    {
      "timestamp": "0:02:27.4",
      "speaker": "Safia Abdalla",
      "text": "So we should be calling it the bomba. (laughs)"
    },
    {
      "timestamp": "0:02:31.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. Or however you say that, I don’t know."
    },
    {
      "timestamp": "0:02:34.8",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:02:35.3",
      "speaker": "Adam Garrett-Harris",
      "text": "I thought it was fascinating, this set of women who were creating they electronics for it and they didn’t really know what they were making but if they paid attention there were like, 24 things on it. It was like this circular thing they were making with 24 things on it. Which is how many letters are in the alphabet."
    },
    {
      "timestamp": "0:02:56.6",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:02:57.5",
      "speaker": "Adam Garrett-Harris",
      "text": "And so it wasn’t hard to figure out that they were-"
    },
    {
      "timestamp": "0:02:59.6",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:02:59.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Making something to crack codes."
    },
    {
      "timestamp": "0:03:01.7",
      "speaker": "Safia Abdalla",
      "text": "I thought that was kind of an interesting part of this, was the… like, separation of concerns between the people working on, I guess you could call it an assembly line, for the actual, like, bombe machines and then the people who were working on, like, the cryptographic and mathematical effort, and there were all of these, kind of, like, silos and there were only a few people who kind of had the big-picture understanding of what was going on. Kind of, to draw analogies between today, I do know of some, like, software teams that do function like that where they’re very siloed by, like, product offering or like what service they are responsible for and there's very few people who have an understanding of the, like, full scope of the work. So I thought that was, kind of, like, an interesting team/engineering setup."
    },
    {
      "timestamp": "0:03:55.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. No, that’s reminds me of something I learned recently called Conway’s Law and it’s this idea that-"
    },
    {
      "timestamp": "0:04:01.9",
      "speaker": "Safia Abdalla",
      "text": "Yes."
    },
    {
      "timestamp": "0:04:02.8",
      "speaker": "Adam Garrett-Harris",
      "text": "The way you write software is going to be based on how your organization is structured at your company."
    },
    {
      "timestamp": "0:04:10.1",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:04:10.2",
      "speaker": "Adam Garrett-Harris",
      "text": "And so if your company has these different departments then your software will be, or tend to, or should be organized based on how the company is split up."
    },
    {
      "timestamp": "0:04:19.4",
      "speaker": "Safia Abdalla",
      "text": "Yeah, Conway’s Law is probably one of my favorite, like, I guess engineering or software philosophy-type things. I find it really interesting because it kind of underscores the relevance of the people and culture over the actual, like, lines of code."
    },
    {
      "timestamp": "0:04:37.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. What else?"
    },
    {
      "timestamp": "0:04:39.9",
      "speaker": "Safia Abdalla",
      "text": "There are some interesting anecdotes about some of the kind of sexism that the women experienced just moving forward into the later years of the war. Like, one of the stories that was highlighted was a situation where basically there were women who were based in, like, a manufacturing/assembly facility in Dayton, Ohio and there was another group of women who were working in Washington, DC and there was a situation where they were transferred from Dayton to Washington to do some work and stuff there and as they were kind of, like, processing the transfer, the individuals, the men who were processing them, sort of automatically assumed that the women were there in DC from Dayton because they had, like, done something wrong or what was considered immoral at the time or unbecoming of a female officer."
    },
    {
      "timestamp": "0:05:40.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:05:41.2",
      "speaker": "Safia Abdalla",
      "text": "And were, like... made them, like, literally wash windows when they were supposed to be, like, these mathematicians and code breakers; and it wasn’t until another officer saw them and pointed out the fact that they were, like, the ones doing the code breaking that that was like, brought to an end. So… yes. Kind of, you know, highlights one of the things that I think has been a consistent theme throughout this book and then is also, I think, something that is a reality that a lot of women experience even today is that, like, going to work is going into battle with allies and enemies. Like, within the same team or even the same company you might have individuals who, like, support you and sponsor you and behave like some of the more, like, supportive characters that we’ve read about in this book, none of whose names are coming to mind at the moment; but then you might also have within those same institutions people who were like, holding you back or, you know, still judgemental in that way."
    },
    {
      "timestamp": "0:06:47.3",
      "text": "So it’s like you never know which side of the coin the person you’re interacting with is going to land on. Is it going to be someone who kind of respects you and understands and appreciates your achievements and your position and all of the challenges you had to overcome to get there? Or is it somebody who’s going to like-"
    },
    {
      "timestamp": "0:07:07.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:07:07.0",
      "speaker": "Safia Abdalla",
      "text": "Want to knock you down a peg? So…"
    },
    {
      "timestamp": "0:07:10.0",
      "speaker": "Jen Luker",
      "text": "And not only that but it seemed that those same people would respond in different ways based on what was going on either with them or with the war efforts or whatever. So it seemed that even if you could peg someone as being one way that, you know, they were accepting of you, maybe in three weeks they wouldn’t be."
    },
    {
      "timestamp": "0:07:30.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:07:31.4",
      "speaker": "Safia Abdalla",
      "text": "Yeah. It’s a… I don’t know what the word for it would be but it’s just, you’d kind of have to walk into a situation that you have no control over how you’ll be perceived."
    },
    {
      "timestamp": "0:07:42.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. That story was, I can’t find it at the moment, but that story was crazy to me. I don’t… I don’t know how… they got put in a position where they were just washing windows when they should be doing real work. Like, who made that assumption? And… I mean it was great that someone finally came and said, “No, they’re really important, we need them to work on important stuff.” But if that person hadn’t come they could have just been stuck there."
    },
    {
      "timestamp": "0:08:11.4",
      "speaker": "Safia Abdalla",
      "text": "Such is life. (laughs)"
    },
    {
      "timestamp": "0:08:14.1",
      "speaker": "Jen Luker",
      "text": "Ah, the joys of assumption. (laughs)"
    },
    {
      "timestamp": "0:08:17.1",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:08:18.4",
      "speaker": "Jen Luker",
      "text": "I can’t tell you how often I was seen as the secretary when people would walk in the door and my desk was one of the front ones."
    },
    {
      "timestamp": "0:08:24.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh my gosh!"
    },
    {
      "timestamp": "0:08:25.9",
      "speaker": "Safia Abdalla",
      "text": "Yeah, that stuff’s really... that’s the stuff that gets you."
    },
    {
      "timestamp": "0:08:29.2",
      "speaker": "Adam Garrett-Harris",
      "text": "I’m trying to get a lot better about this. Like, for instance, I was... I ran into a couple recently and the woman was wearing a ReactRally t-shirt and so I asked if she was a developer instead of, like, I don’t know, this is a silly example."
    },
    {
      "timestamp": "0:08:47.4",
      "speaker": "Safia Abdalla",
      "text": "Assuming it was her husband’s?"
    },
    {
      "timestamp": "0:08:49.4",
      "speaker": "Adam Garrett-Harris",
      "text": "It was her husband’s, but-"
    },
    {
      "timestamp": "0:08:50.6",
      "speaker": "Safia Abdalla",
      "text": "Yeah! No, it’s a real thing!"
    },
    {
      "timestamp": "0:08:51.2",
      "speaker": "Adam Garrett-Harris",
      "text": "I really thought she was the developer."
    },
    {
      "timestamp": "0:08:53.3",
      "speaker": "Safia Abdalla",
      "text": "Yeah, and I think that’s, like, a good skill to practice is like, being proactive about not defaulting to the assumption that might not necessarily, like, be true all of the time."
    },
    {
      "timestamp": "0:09:04.5",
      "speaker": "Adam Garrett-Harris",
      "text": "I’m noticing, like, little things like this. Another example is I was talking to a pharmacist about my son’s doctor and she said, “Well yeah, just call him and let him know.” And it’s a female doctor."
    },
    {
      "timestamp": "0:09:18.3",
      "speaker": "Safia Abdalla",
      "text": "Hmm."
    },
    {
      "timestamp": "0:09:19.2",
      "speaker": "Adam Garrett-Harris",
      "text": "And she just made the assumption that because it’s a doctor it’s a male. That one? That one’s really weird to me that that’s still an assumption we have."
    },
    {
      "timestamp": "0:09:27.8",
      "speaker": "Safia Abdalla",
      "text": "That all doctors are dudes?"
    },
    {
      "timestamp": "0:09:29.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:09:30.5",
      "speaker": "Jen Luker",
      "text": "Well, it wasn’t until, what? The 1930s that women were allowed into certain medical fields?"
    },
    {
      "timestamp": "0:09:39.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm, yeah. Yeah and it talks about at the end of this book after the war there was the GI Bill where they can use that to go to college but one of these women couldn’t get into the colleges they wanted to, to learn the things they wanted to."
    },
    {
      "timestamp": "0:09:55.7",
      "text": "They said, “Hey, we're holding those spots for soldiers!”"
    },
    {
      "timestamp": "0:09:59.2",
      "text": "And they were like, “I was a soldier. I was in the WAVES.”"
    },
    {
      "timestamp": "0:10:03.1",
      "text": "And they’re like, “Well, too bad.”"
    },
    {
      "timestamp": "0:10:05.9",
      "speaker": "Safia Abdalla",
      "text": "Yeah, and I think this is one of the things where it's like certain prejudices become, like, institutionalized because it, if there is one thing I know, especially from looking at it in the lens of like, black civil rights and the advancement of black people in America, there was nothing more significant to the development of the middle class and like economic prosperity in that era than the GI Bill and everything that it enabled people to do with a respect to getting, like, education and housing and all of that good stuff that people need. Then, you know, the fact that all of that wealth and resource was not accessible to this one group of people, it becomes generational, and it impacts, you know, women several decades later."
    },
    {
      "timestamp": "0:10:55.7",
      "text": "Onto cheerier topics, one of the things that kind of fascinated me, er, sorry! Not to just like, jump off this like, very serious topic that should be discussed, but one of the things that I thought was kind of interesting, also, was talking a little bit about the engineering effort involved in the building of the bombes because they were building many of them and I thought it was interesting that they had, you know, like standard parts that they would get from, like, you know, commercial providers, but then they also had custom made parts that needed to be made."
    },
    {
      "timestamp": "0:11:30.3",
      "text": "And I, you know, again it reminded me again of, like, modern software engineering where you have, like, standard packages or APIs that you interface with, you know, like, interfacing with, like, a file system that’s a standard API in many cases. Or like, interfacing through HTTP or REST, and then you’ve got, like, stuff that’s just, like, custom built for your use case. Like, they were talking about diodes that had to be custom made, certain kinds of vacuum tubes and how they had to integrate and assemble all of these parts, and the maintenance effort required to keep this, they almost seemed to describe it as, like, a very delicately put together system, like, running. And, like, there are engineering logs where, I think they called, like, the first prototypes Adam and Eve or something."
    },
    {
      "timestamp": "0:12:20.4",
      "text": "And another thing I noticed that was kind of interesting was that they had anthropomorphized the computers. So they would be, like, over there talking about Adam they would be like, “He had a bug today.-"
    },
    {
      "timestamp": "0:12:32.8",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:12:32.8",
      "speaker": "Safia Abdalla",
      "text": "“He was feeling a little cranky.” And the same goes for Eve, which is interesting because I also tend to anthropomorphize bugs or things I’m dealing with when I’m writing code."
    },
    {
      "timestamp": "0:12:43.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Right."
    },
    {
      "timestamp": "0:12:44.1",
      "speaker": "Safia Abdalla",
      "text": "So, yeah. It was kind of interesting to see, like, the engineering process involved in, like, physically assembling the hardware for the bombe."
    },
    {
      "timestamp": "0:12:52.1",
      "speaker": "Jen Luker",
      "text": "Having dived into IOT a lot lately, I can also relate to that from an actual hardware perspective and not just the software side. Having to try to combine various parts and pieces and make them work and then kind of, you know, rig them with bubble gum and you know, duct tape to try to make them work anyway and not just, you know, talking about having to custom make the hardware itself but sometimes it’s random things like, I’ve got this water float switch that I’m using to fill up my fish tank when the water level drops too low, and I’ve had to, like, custom make essentially a one eared clip to go onto the edge of my fish tank because I couldn’t find one commercially."
    },
    {
      "timestamp": "0:13:40.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Nice."
    },
    {
      "timestamp": "0:13:42.8",
      "speaker": "Jen Luker",
      "text": "So it kind of reminded me that 3D printing is very much the same way, it’s custom-making various pieces in order to make our things work together properly."
    },
    {
      "timestamp": "0:13:51.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and I didn’t totally understand what was going on but I think I remember some sort of job where you, like, put this wheel on and then you sit there on a stool and wait for it to, like, pop off and hit you and then you, like, get up and put it back on. And that was like, a job to sit there and constantly fix it. Do you all remember that?"
    },
    {
      "timestamp": "0:14:15.1",
      "speaker": "Jen Luker",
      "text": "I remember working in a button factory."
    },
    {
      "timestamp": "0:14:19.1",
      "speaker": "Safia Abdalla",
      "text": "You worked in a button factory? Like-"
    },
    {
      "timestamp": "0:14:21.1",
      "speaker": "Jen Luker",
      "text": "“Hi, my name is Joe. I worked in a button factory. One day my boss came to me and said, ‘Joe, are you busy?’ I said, ‘No-”"
    },
    {
      "timestamp": "0:14:28.2",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:14:28.2",
      "speaker": "Jen Luker",
      "text": "“ ‘Push this button with your left hand.’”"
    },
    {
      "timestamp": "0:14:29.7",
      "speaker": "Adam Garrett-Harris",
      "text": "I remember this."
    },
    {
      "timestamp": "0:14:30.8",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:14:32.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Not from this book."
    },
    {
      "timestamp": "0:14:33.8",
      "speaker": "Jen Luker",
      "text": "No, but yes. It was a thing back in the day."
    },
    {
      "timestamp": "0:14:39.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Maybe Safia’s too young."
    },
    {
      "timestamp": "0:14:43.2",
      "speaker": "Safia Abdalla",
      "text": "I think I might be."
    },
    {
      "timestamp": "0:14:43.2",
      "speaker": "Jen Luker",
      "text": "Probably."
    },
    {
      "timestamp": "0:14:45.6",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:14:44.8",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:14:47.0",
      "speaker": "Jen Luker",
      "text": "So anyway! Joe continues and Boss keeps coming and you know, left hand, right hand, left foot, right foot, head, whatever other body parts you can figure out how to push a button with and you just keep pushing the button and it’s a physical like song that you do in front of an audience and it gets really hilarious and then eventually you say, “Yes! I’m busy, Boss!”"
    },
    {
      "timestamp": "0:15:06.3",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:15:07.7",
      "speaker": "Safia Abdalla",
      "text": "(laughs) I’ll have to look this up."
    },
    {
      "timestamp": "0:15:13.2",
      "speaker": "Adam Garrett-Harris",
      "text": "I”m trying to find a link for the show notes."
    },
    {
      "timestamp": "0:15:15.9",
      "speaker": "Jen Luker",
      "text": "That’s going to be odd and awkward and we probably should just cut it all out. (laughs)"
    },
    {
      "timestamp": "0:15:22.5",
      "speaker": "Adam Garrett-Harris",
      "text": "I’m still looking to see if I can find that part where you would sit there and…"
    },
    {
      "timestamp": "0:15:27.0",
      "speaker": "Jen Luker",
      "text": "Yeah, it’s like, the point is that, you know, if we’ve come up with songs like “I work in a button factory”, like, I don’t see is as a real far-fetched thing, that we probably came up with it because of something as similar as wait for the wheel to pop off and then put it back on."
    },
    {
      "timestamp": "0:15:44.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yep. Okay, so one of my favorite chapters is the one called “Teddy.”"
    },
    {
      "text": "(Typewriter Dings)"
    },
    {
      "timestamp": "0:15:52.0",
      "speaker": "Adam Garrett-Harris",
      "text": "“Chapter 14: Teedy”, not Teddy!"
    },
    {
      "text": "(Typewriter Dings)"
    },
    {
      "timestamp": "0:15:55.6",
      "speaker": "Adam Garrett-Harris",
      "text": "And it’s a story about Dot’s brother. So Teedy went and like, some of the worst battle that happened during the war, let’s see, what battle was that? During Normandy! He was,like, storming the beaches of Normandy."
    },
    {
      "timestamp": "0:16:15.9",
      "speaker": "Safia Abdalla",
      "text": "What made that chapter your favorite?"
    },
    {
      "timestamp": "0:16:18.7",
      "speaker": "Adam Garrett-Harris",
      "text": "So, he was in this unit that almost like, almost everyone died and they, he was reported missing in action and everyone just assumed he was dead, and then it turned out he had survived and he had this kind of crazy story about how he survived. The vehicle he was in just got blown by this rocket launcher and he was just, kind of, knocked out. Then he just kind of woke up and followed some dudes and then he, like, passed out again, and then he woke up in a hospital. It’s just crazy the… I guess because I really liked Dot as a person in this story. Like, she’s really the most consistent storyline throughout this entire book. To see her brother out there and she’s working to try to save him, there was really nothing she could do to save him, but through a lot of luck he actually does make it."
    },
    {
      "timestamp": "0:17:23.5",
      "speaker": "Jen Luker",
      "text": "Not only does he make it but he kind of gets to skip one of the worst battles he was ever in!"
    },
    {
      "timestamp": "0:17:28.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! (laughs)"
    },
    {
      "timestamp": "0:17:29.0",
      "speaker": "Jen Luker",
      "text": "So from the very beginning, you know, he kinda gets knocked out and then he wakes up long enough to walk a few miles and then he gets knocked out again and wakes up in a hospital, like, sucks that he got knocked out and he had injuries but, like, he got to skip it. Maybe he skipped some of the emotional damage."
    },
    {
      "timestamp": "0:17:44.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Right! And then he gets to eat a nice meal in a Belgian restaurant."
    },
    {
      "timestamp": "0:17:48.4",
      "speaker": "Safia Abdalla",
      "text": "Yeah, although I don’t think that discounts like, the gruesome aspects of having to face war at such a young age, even if it was like… brief I think just, like, the very act of being in that kind of conflict is traumatizing enough. And I don’t know if it’s necessarily like, the more war you see the worse off you are or if it’s just like, encounters with that kind of like-"
    },
    {
      "timestamp": "0:18:14.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:18:14.5",
      "speaker": "Safia Abdalla",
      "text": "Violence and terror have an impact on your psyche-"
    },
    {
      "timestamp": "0:18:19.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:18:19.8",
      "speaker": "Safia Abdalla",
      "text": "Regardless of how much."
    },
    {
      "timestamp": "0:18:20.8",
      "speaker": "Adam Garrett-Harris",
      "text": "And it’s also sad how young these men were, and how untrained they were, and then going into the worst battle of the war."
    },
    {
      "timestamp": "0:18:31.0",
      "speaker": "Safia Abdalla",
      "text": "Yeah. ‘Cause I think I was going to add on, I was kind of getting into this notion about, like, the psychological trauma of war. You have psychological trauma that you experience in addition to, like, physical trauma like injury, death, when you’re in the battlefield; but I think there’s also, like, the aspects of the psychological trauma that were discussed when it came to, like, the, like, stress and mental wear of the people who were just, like, the women who were just, you know, stationed in the US and just responsible for deciphering codes and stuff like that. Like, it’s different ways that you are mentally harmed by war, weather you are directly in combat or just kind of having to process those aspects of war."
    },
    {
      "timestamp": "0:19:18.1",
      "text": "I’m not going to pretend to be an expert on it but I think there’s, like, an interesting thing there about the different ways it affects you depending on your engagement with, like, combat or just war stories, or all of that."
    },
    {
      "timestamp": "0:19:30.6",
      "speaker": "Jen Luker",
      "text": "You know, there’s always going to be varying degrees across not just people but also an experience I think that from, again, my limited experience, I mean people can get PTSD from just being in a car crash, let alone having to deal with the day-to-day on and on of dealing with those horrors. And some of it becomes… you become desensitized to a sense and it just becomes one long experience with staccato's of horror that then define the experience for you. But no matter how you cut it, the emotional and mental and physical damage of it all definitely adds up."
    },
    {
      "timestamp": "0:20:19.5",
      "speaker": "Safia Abdalla",
      "text": "Yeah. But yeah, so you feel like the kind of backstory for her brother added some, like, depth to the Dot character even though she’s like a real person who existed and is not just a character in some fictional book or something?"
    },
    {
      "timestamp": "0:20:33.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. And it’s not just that story. There’s a lot of different stories of code breakers whose husbands or brothers or fathers are out there fighting the war, and they actually, sometimes, help save them by cracking a message, and sometimes they don’t and just hear about their death."
    },
    {
      "timestamp": "0:20:52.3",
      "text": "So another thing I thought was really interesting is in the next chapter, chapter 15, talking about the surrender from the Japanese."
    },
    {
      "text": "(Typewriting Dings)"
    },
    {
      "text": "________________"
    },
    {
      "timestamp": "0:21:04.6",
      "speaker": "Adam Garrett-Harris",
      "text": "And it was talking about how Japanese translators were really rare in America at that time and so there were basically three types of translators that they had, and some were like, military people that they had sent to, like, learn Japanese in… I guess at, like, training places in California and Colorado, and then others were scholars, and some were missionaries who had actually lived in Japan. So that last two categories were really interesting because they learned the language because they loved the people, the culture, the place; and then here they are working to fight against the place that they love."
    },
    {
      "timestamp": "0:21:47.5",
      "speaker": "Jen Luker",
      "text": "And this is where I get a bit angry about the fact that they couldn’t find Japanese translators, however they were perfectly fine with locking up Japanese-Americans in our own version of-"
    },
    {
      "timestamp": "0:22:00.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Right."
    },
    {
      "timestamp": "0:22:01.0",
      "speaker": "Jen Luker",
      "text": "Camps."
    },
    {
      "timestamp": "0:22:01.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Internment camps."
    },
    {
      "timestamp": "0:22:03.2",
      "speaker": "Jen Luker",
      "text": "And that wasn’t just people that were born and raised in Japan and moved, it was people that were born and raised as Americans that just had Japanese heritage. Not that one of it makes it any better."
    },
    {
      "timestamp": "0:22:14.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Right. Yeah. And, you know, those people, even if they had asked them to come help translate they probably would have been in the same boat of, like, they might have some, at least, you know? If that’s their ancestry they’re probably going to have some… I don’t even know how to word it."
    },
    {
      "timestamp": "0:22:34.0",
      "speaker": "Jen Luker",
      "text": "It’s like, not even necessarily love as much as just the language comprehension."
    },
    {
      "timestamp": "0:22:38.2",
      "speaker": "Adam Garrett-Harris",
      "text": "What do you mean?"
    },
    {
      "timestamp": "0:22:39.9",
      "speaker": "Jen Luker",
      "text": "For those that actually traveled and studied in the country, yeah you’re going to have people that did so because of their appreciation of that culture; but the people that were already here, even if they were born as Americans, may or may not have already had the language comprehension skills based on whether their families continued speaking the language or not. However, I felt like they had this huge pool of people, maybe not huge, but they had this large pool of people that they wouldn’t even utilize or work with or talk to-"
    },
    {
      "timestamp": "0:23:13.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Or just let them live their lives?"
    },
    {
      "timestamp": "0:23:16.9",
      "speaker": "Jen Luker",
      "text": "(laughs) Right? Let them live in their own homes and experience life on their own! So they had to find other weird ways of getting Japanese translators besides our own-"
    },
    {
      "timestamp": "0:23:32.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:23:32.9",
      "speaker": "Jen Luker",
      "text": "People."
    },
    {
      "timestamp": "0:23:35.2",
      "speaker": "Adam Garrett-Harris",
      "text": "So, I like this one sentence. I’m not even sure how to parse it, but they get the message, the surrender message, early because, like, the Japanese don’t have a direct way to communicate with the US so they’re going to go through Sweden. So send the message to Sweden and then have Sweden send it to the US and so we intercept that from Japan to Sweden and go ahead and translate the message. So the translator’s, you know, working on it, and everyone’s crowding around her and so this woman says she saw what was going on and she went over there and she was like,”I just put on my Colonel’s bars, or whatever you wear when you’re a Colonel, and told them to get the hell out of there and leave her alone.” And I was like-"
    },
    {
      "timestamp": "0:24:26.3",
      "speaker": "Jen Luker",
      "text": "That’s nice!"
    },
    {
      "timestamp": "0:24:26.5",
      "speaker": "Adam Garrett-Harris",
      "text": "That’s so awesome that she’s a Colonel. She’s like, and I’m sure this is just years later that she’s telling this story, but she’s like, “You know? Colonel’s bars, or whatever you put on…”"
    },
    {
      "timestamp": "0:24:39.0",
      "text": "And also, this probably goes back to some of the stuff we were talking about before. It’s like, she probably had to put those on to get the respect to tell people to get out."
    },
    {
      "timestamp": "0:24:48.1",
      "speaker": "Safia Abdalla",
      "text": "Speaking of respect, this is kind of jumping back a little bit."
    },
    {
      "timestamp": "0:24:52.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, go for it!."
    },
    {
      "timestamp": "0:24:53.2",
      "speaker": "Safia Abdalla",
      "text": "There was some stuff that happened in the beginning around the, like, illustrious Agnes Driscoll character that kind of confused me. So they were talking about, like, needing to push her out or, like, get rid of her in the context of the new bombe effort that was going on."
    },
    {
      "timestamp": "0:25:09.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah!"
    },
    {
      "timestamp": "0:25:10.0",
      "speaker": "Safia Abdalla",
      "text": "Yeah, so what was that about? ‘Cause I was having trouble kind of tying that with other parts of the plot with a respect to, like, Agnes Driscoll."
    },
    {
      "timestamp": "0:25:18.3",
      "speaker": "Adam Garrett-Harris",
      "text": "That was in Part II, right?"
    },
    {
      "timestamp": "0:25:20.2",
      "speaker": "Safia Abdalla",
      "text": "Yeah, there was like, this was, like, in the first chapter within Part III. There was, like, a brief bit which kind of surprised me. They were like, “Oh, we need to get rid of Agnes Driscoll.” But I don’t know if that was this same kind of scenario that happened in Part II, but just retold it in a different context or there was, like, another situation or she was pushed out."
    },
    {
      "timestamp": "0:25:41.7",
      "text": "I had trouble kind of parsing that part of the plot."
    },
    {
      "timestamp": "0:25:45.2",
      "speaker": "Jen Luker",
      "text": "They were always pushing Agnes Driscoll out!"
    },
    {
      "timestamp": "0:25:47.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yea."
    },
    {
      "timestamp": "0:25:48.8",
      "speaker": "Safia Abdalla",
      "text": "(laughs) I know!"
    },
    {
      "timestamp": "0:25:49.0",
      "speaker": "Adam Garrett-Harris",
      "text": "I love the part, I think it’s in the last chapter where someone was walking past her and this woman walking past her was trained by someone Agnes Driscoll didn’t like, I don’t remember who."
    },
    {
      "timestamp": "0:26:03.9",
      "speaker": "Safia Abdalla",
      "text": "Hmm."
    },
    {
      "timestamp": "0:26:04.8",
      "speaker": "Adam Garrett-Harris",
      "text": "And she had good reason, and she just kind of hissed at her."
    },
    {
      "timestamp": "0:26:09.9",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:26:11.8",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:26:14.2",
      "speaker": "Jen Luker",
      "text": "(laughs) Oh gosh, as someone who had to deal with a bit of similar situations, but Junior High and bullying, yeah that doesn’t feel good to be on the other side, but…"
    },
    {
      "timestamp": "0:26:27.5",
      "speaker": "Adam Garrett-Harris",
      "text": "It’s just kind of…"
    },
    {
      "timestamp": "0:26:29.0",
      "speaker": "Jen Luker",
      "text": "Oh! Was his name Raven?"
    },
    {
      "timestamp": "0:26:32.2",
      "speaker": "Safia Abdalla",
      "text": "Oh, the Frank guy?"
    },
    {
      "timestamp": "0:26:32.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yes."
    },
    {
      "timestamp": "0:26:35.5",
      "speaker": "Jen Luker",
      "text": "Yeah! That dude was like, “Yeah, she was smart until-”"
    },
    {
      "timestamp": "0:26:38.7",
      "speaker": "Safia Abdalla",
      "text": "Gosh!"
    },
    {
      "timestamp": "0:26:38.7",
      "speaker": "Jen Luker",
      "text": "“... she had her car crash and now-”"
    },
    {
      "timestamp": "0:26:40.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:26:39.9",
      "speaker": "Jen Luker",
      "text": "“... she’s a hag.”"
    },
    {
      "timestamp": "0:26:40.5",
      "speaker": "Safia Abdalla",
      "text": "I feel like I need to Google him and see what happened to him."
    },
    {
      "timestamp": "0:26:43.4",
      "speaker": "Jen Luker",
      "text": "He probably went on to a very happy, illustrious career and, you know, retired comfortably and died in his sleep surrounded by his family!"
    },
    {
      "timestamp": "0:26:50.3",
      "speaker": "Safia Abdalla",
      "text": "(laughs) Yeah, probably."
    },
    {
      "timestamp": "0:26:51.7",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Yes."
    },
    {
      "timestamp": "0:26:54.9",
      "speaker": "Safia Abdalla",
      "text": "He’s got a Wikipedia page. This is strange, there’s a picture of him on his Wikipedia page and it’s one of those eerie feelings where you connect a story to, like, a face and then just the fact that there’s, you know, that kind of uneasy feeling you get when you’ve got like, a face to match a story to?"
    },
    {
      "timestamp": "0:27:15.6",
      "speaker": "Jen Luker",
      "text": "Particularly when you don’t like him?"
    },
    {
      "timestamp": "0:27:17.4",
      "speaker": "Safia Abdalla",
      "text": "Yeah, he definitely does look like the kind of guy who would, (laughs) say something like that. Anyway…"
    },
    {
      "timestamp": "0:27:25.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I don't understand it either. It just said she had to neutralized. So I don’t know if that’s talking about the same thing that was mentioned in Part II?"
    },
    {
      "timestamp": "0:27:33.1",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:27:33.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Or… Something else."
    },
    {
      "timestamp": "0:27:35.4",
      "speaker": "Safia Abdalla",
      "text": "And that’s such an incredibly awful language to use."
    },
    {
      "timestamp": "0:27:38.1",
      "speaker": "Jen Luker",
      "text": "Neutralized? Yeah! However, I mean if you think about the previous stories and that different things we discussed when it came to Agnes Driscoll, she started keeping things to herself and she started not sharing information because it was the only way to really secure her position, right? They needed her because she had that information. They needed her because all else fails, you know, you knew she was keeping something back. So maybe the concern with her in that point was that she was holding onto her cards so tightly to her chest that those were the cards that were needed in order to help program the bomba machines."
    },
    {
      "timestamp": "0:28:15.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Bomba!"
    },
    {
      "timestamp": "0:28:16.8",
      "speaker": "ALL",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:28:17.7",
      "speaker": "Safia Abdalla",
      "text": "That’s what went through my head, too."
    },
    {
      "timestamp": "0:28:21.1",
      "speaker": "Adam Garrett-Harris",
      "text": "It was a song, right? Like, La la bamba?"
    },
    {
      "timestamp": "0:28:24.9",
      "speaker": "Safia Abdalla",
      "text": "There’s… yeah."
    },
    {
      "timestamp": "0:28:27.4",
      "speaker": "Jen Luker",
      "text": "(Sings lyric in spanish)"
    },
    {
      "timestamp": "0:28:29.2",
      "speaker": "Safia Abdalla",
      "text": "It’s like a dance."
    },
    {
      "timestamp": "0:28:32.7",
      "speaker": "Jen Luker",
      "text": "Yeah. It’s essentially “dance with me.”"
    },
    {
      "timestamp": "0:28:36.6",
      "speaker": "Adam Garrett-Harris",
      "text": "So it mentions, in that first chapter as well, that the Enigma had a few weaknesses and so one of the weaknesses is that no letter can be enciphered to itself because essentially you’re pressing down on a typewriter keyboard and then another letter lights up."
    },
    {
      "timestamp": "0:28:56.0",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:28:56.9",
      "speaker": "Adam Garrett-Harris",
      "text": "And even if you press the same letter over and over a different letter’s going to light up, but it’s never going to be the same letter as you’re pressing down. Maybe one of the reasons for that is ‘cause your finger’s on it? But for whatever reason you know, like, if you’re seeing a “b” in a cipher, the actual letter is not a “b”."
    },
    {
      "timestamp": "0:29:15.5",
      "speaker": "Safia Abdalla",
      "text": "Yeah. Which is, I guess that’s an actually pretty useful piece of information if you’re trying to crack it. It does only, like, narrow your options down to, like, 25 other letters, but…"
    },
    {
      "timestamp": "0:29:26.5",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) How many letters are there? I said 24 letters earlier but now I’m questioning if it’s 24 or 26."
    },
    {
      "timestamp": "0:29:33.3",
      "speaker": "Safia Abdalla",
      "text": "It’s 26."
    },
    {
      "timestamp": "0:29:33.5",
      "speaker": "Jen Luker",
      "text": "There are 26 letters, however, remember that even on typewriters they didn’t have a “w” because you’d use two “v”s, and there was, oh there was another one…"
    },
    {
      "timestamp": "0:29:44.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:29:45.4",
      "speaker": "Jen Luker",
      "text": "So they actually did reduce it down to 24 at some point."
    },
    {
      "timestamp": "0:29:48.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Interesting. Well the typewriters I have had a “w” but they don’t have a one or an exclamation point."
    },
    {
      "timestamp": "0:29:56.3",
      "speaker": "Safia Abdalla",
      "text": "What year are they from?"
    },
    {
      "timestamp": "0:29:58.1",
      "speaker": "Adam Garrett-Harris",
      "text": "A lot of them didn’t have that… I think, the electric typewriters, a lot of them did, but it was so easy to do, like a lowercase “L” and a “1” looked exactly the same so you could just do an “L”, and the exclamation point a little bit harder because you had a do a comma, backspace, period."
    },
    {
      "timestamp": "0:30:16.3",
      "speaker": "Safia Abdalla",
      "text": "Yeah. I did see that they were talking about when the women were constructing this circular rotors for the bombe it was 26 slots labeled 0 to 25."
    },
    {
      "timestamp": "0:30:26.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Okay."
    },
    {
      "timestamp": "0:30:27.5",
      "speaker": "Jen Luker",
      "text": "Well there you go. Is that where the “zero point” comes from, too?"
    },
    {
      "timestamp": "0:30:31.9",
      "speaker": "Safia Abdalla",
      "text": "The zero point?"
    },
    {
      "timestamp": "0:30:33.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Zero point?"
    },
    {
      "timestamp": "0:30:33.9",
      "speaker": "Jen Luker",
      "text": "The Zero counting scale that we start at zero, not at one?"
    },
    {
      "timestamp": "0:30:38.1",
      "speaker": "Safia Abdalla",
      "text": "Oh! I’m not sure! Hmm."
    },
    {
      "timestamp": "0:30:41.0",
      "speaker": "Adam Garrett-Harris",
      "text": "That might have to do with using less memory."
    },
    {
      "timestamp": "0:30:43.6",
      "speaker": "Jen Luker",
      "text": "Going back to binary?"
    },
    {
      "timestamp": "0:30:45.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:30:46.1",
      "speaker": "Safia Abdalla",
      "text": "Yeah, I think the other kind of pattern that existed in the Enigma, or in the bombe, one of those, whichever one is the actual cipher, is there were these loops-"
    },
    {
      "timestamp": "0:30:58.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh yeah."
    },
    {
      "timestamp": "0:30:59.1",
      "speaker": "Safia Abdalla",
      "text": "That existed so you had, like, a closed loop that would exist in each cipher so if you, like, translated the like:"
    },
    {
      "text": "If “e” was mapped to “t”"
    },
    {
      "text": "and “t” was mapped to “w”"
    },
    {
      "text": "and “w” was mapped to “b”"
    },
    {
      "text": "and “b” was mapped to “e”"
    },
    {
      "text": "that was like a closed loop."
    },
    {
      "timestamp": "0:31:17.3",
      "text": "A big part of their effort was finding these closed loops of translation ‘cause they would show you how you could figure the rotors. So I guess, like, the circular nature of the rotating thingy within the bombe, mapped directly to the existence of these, like, closed loops."
    },
    {
      "timestamp": "0:31:36.9",
      "text": "I’m real curious now to, like, find an engineering diagram of the bombe and see, like, how the actual, like, rotors and stuff work."
    },
    {
      "timestamp": "0:31:46.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I think there’s a few good videos on Computerphile."
    },
    {
      "timestamp": "0:31:51.7",
      "speaker": "Safia Abdalla",
      "text": "Oh!"
    },
    {
      "timestamp": "0:31:51.7",
      "speaker": "Adam Garrett-Harris",
      "text": "It’s either Computerphile or Numberphile. And I’ve also seen some websites where you can set the rotors on the website and then you can start typing and then see how it works."
    },
    {
      "timestamp": "0:32:03.2",
      "speaker": "Safia Abdalla",
      "text": "Huh, I will have to try that."
    },
    {
      "timestamp": "0:32:05.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I’ll put links in the show notes for that."
    },
    {
      "timestamp": "0:32:07.8",
      "speaker": "Safia Abdalla",
      "text": "Yeah, that would be a fun things for folks to try at home, too. Isn’t that kind of amusing? That you can probably, like, model and crack an Enigma code on your, like, ipad or something and they needed a complete room of computers to do it like 100 years ago?"
    },
    {
      "timestamp": "0:32:24.5",
      "speaker": "ALL",
      "text": "(laughing)"
    },
    {
      "timestamp": "0:32:24.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I mean they didn’t really have the general purpose computer yet."
    },
    {
      "timestamp": "0:32:29.9",
      "speaker": "Safia Abdalla",
      "text": "That’s true. That’s a good point."
    },
    {
      "timestamp": "0:32:31.4",
      "speaker": "Adam Garrett-Harris",
      "text": "So, yeah. It’s… it is super interesting. They’re building these, like, partly mechanical, partly electrical, giant, single-purpose things that take a whole crew of people to operate and probably spend like, based on how much it mentioned their breaking down, spend, like, half the day fixing it every few days."
    },
    {
      "timestamp": "0:32:53.9",
      "speaker": "Safia Abdalla",
      "text": "Yeah, sounds like software. (laughs)"
    },
    {
      "timestamp": "0:32:56.3",
      "speaker": "Adam Garrett-Harris",
      "text": "It sounds like software development."
    },
    {
      "timestamp": "0:32:58.9",
      "speaker": "Safia Abdalla",
      "text": "Oh, yes. Yes."
    },
    {
      "timestamp": "0:33:00.0",
      "speaker": "Adam Garrett-Harris",
      "text": "This is like, them running the production code."
    },
    {
      "timestamp": "0:33:02.4",
      "speaker": "Safia Abdalla",
      "text": "Oh my gosh, can you imagine? They had no CI, no dev environment-"
    },
    {
      "timestamp": "0:33:07.4",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:33:07.8",
      "speaker": "Safia Abdalla",
      "text": "No… (laughs) We are so lucky to have all these things."
    },
    {
      "timestamp": "0:33:11.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:33:11.3",
      "speaker": "Jen Luker",
      "text": "I’m like, you mean like 10 years ago? ‘Cause that was life back then."
    },
    {
      "timestamp": "0:33:15.1",
      "speaker": "Safia Abdalla",
      "text": "Oh man, true. Yeah. Oh…"
    },
    {
      "timestamp": "0:33:19.6",
      "speaker": "Jen Luker",
      "text": "You spoiled kids, you."
    },
    {
      "timestamp": "0:33:21.6",
      "speaker": "Safia Abdalla",
      "text": "I am a spoiled child, I love it."
    },
    {
      "timestamp": "0:33:24.1",
      "speaker": "Jen Luker",
      "text": "In the channel I actually attached a rutherford journal for the Turing Bombe and the diagrams and descriptions and all sorts of lovely information so hopefully that will also be attached to the show notes."
    },
    {
      "timestamp": "0:33:40.2",
      "speaker": "Safia Abdalla",
      "text": "Oh cool!"
    },
    {
      "timestamp": "0:33:41.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, it basically looks like a typewriter or a cash register with, like, different things you can plugin in the front."
    },
    {
      "timestamp": "0:33:50.2",
      "speaker": "Jen Luker",
      "text": "Keep scrolling."
    },
    {
      "timestamp": "0:33:51.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Then like, some rotors on the top?"
    },
    {
      "timestamp": "0:33:53.8",
      "speaker": "Jen Luker",
      "text": "Definitely keep scrolling."
    },
    {
      "timestamp": "0:33:55.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Scrolling, scrolling, scrolling. And the bombe, bom-ba? Bombe. Yeah, that looks-"
    },
    {
      "timestamp": "0:34:02.6",
      "speaker": "Jen Luker",
      "text": "Bom-ba."
    },
    {
      "timestamp": "0:34:03.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Amazing."
    },
    {
      "timestamp": "0:34:05.0",
      "speaker": "Jen Luker",
      "text": "Right? The interior view?"
    },
    {
      "timestamp": "0:34:07.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Right, the interior view. It looks like a bomb."
    },
    {
      "timestamp": "0:34:08.8",
      "speaker": "Safia Abdalla",
      "text": "It looks like it’s the cloud."
    },
    {
      "timestamp": "0:34:10.5",
      "speaker": "Jen Luker",
      "text": "It looks like a lot of bombs."
    },
    {
      "timestamp": "0:34:13.6",
      "speaker": "Adam Garrett-Harris",
      "text": "You’re right."
    },
    {
      "timestamp": "0:34:13.3",
      "speaker": "Safia Abdalla",
      "text": "Yeah. I made a terrible joke but I’m glad no one responded to it, to be honest, because it was very bad."
    },
    {
      "timestamp": "0:34:20.5",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:34:20.5",
      "speaker": "Jen Luker",
      "text": "Actually, I totally chucked on the inside, it was perfect."
    },
    {
      "timestamp": "0:34:22.7",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:34:26.4",
      "speaker": "Adam Garrett-Harris",
      "text": "So in chapter 13 it talks about how they were planning the invasion of Normandy… and I thought that was pretty cool. They wanted to take the Germans by surprise and so they had to create these phantom armies. They were like, “We know they probably are breaking our codes so let’s make them think we’re attacking up north and then, like, somewhere down south. And then they’re going to know about the one at Normandy, but they’re going to think that it’s not the real attack.” When really it was the real attack."
    },
    {
      "timestamp": "0:35:04.4",
      "speaker": "Safia Abdalla",
      "text": "Yeah. It’s almost kind of like, hacking their communication systems and I think we’ve seen this, like, throughout the book; it’s where they would exploit people’s trust in the communication system to send incorrect messages or, like, send a message with the intent of figuring out their cipher, or send a message with the intent of directing them to an incorrect position or getting them to, like, a place where they were indefensible. So there’s this interesting, I think “psychological” might be the wrong word, but like, they’re kind of trying to hack each other’s systems and trusts in their communication protocols and use the actual like, frameworks and things that people have set up against them, which is, I think really interesting."
    },
    {
      "timestamp": "0:35:52.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I think it’s really like social engineering-"
    },
    {
      "timestamp": "0:35:55.9",
      "speaker": "Safia Abdalla",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:35:56.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Because it’s like you said, they trust it. If you intercept a message and then you crack it, like you trust it."
    },
    {
      "timestamp": "0:36:05.1",
      "speaker": "Safia Abdalla",
      "text": "It can’t be incorrect! Yeah. Why would anyone encode an incorrect message to us?"
    },
    {
      "timestamp": "0:36:12.3",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Right. And it was super interesting that to send these fake messages they had to, like, intimately know what a real message looked like, what a real pattern of communication looked like throughout the day. That was a lot of work. And so kind of the sense I got throughout this Part III was that the code breakers really won the war for us."
    },
    {
      "timestamp": "0:36:42.3",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:36:43.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Like, I feel like, there’s no way we could have won without code breakers and without them doing, like, such a good job."
    },
    {
      "timestamp": "0:36:51.6",
      "speaker": "Safia Abdalla",
      "text": "Yeah. I want to almost extend it a little bit and say that technology won the war for us. They were kind of talking about how in addition to this code breaking apparatus you had all of the technology that was there to support it. LIke, developments in sonar was one of the things that they highlighted. And a couple of other things that emerged with the intent of supporting, like, the intelligence apparatus."
    },
    {
      "timestamp": "0:37:17.0",
      "text": "So I thought that was cool, and obviously there’s like, tons of articles and books out there about how a lot of technological innovation comes out of war because when it comes to killing each toher we’ll dedicate all the resources necessarily."
    },
    {
      "timestamp": "0:37:32.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:37:32.6",
      "speaker": "Safia Abdalla",
      "text": "Unfortunately."
    },
    {
      "timestamp": "0:37:33.5",
      "speaker": "Adam Garrett-Harris",
      "text": "And desperate."
    },
    {
      "timestamp": "0:37:34.5",
      "speaker": "Safia Abdalla",
      "text": "Yeah, so I thought that was, you know, you had, like, this intelligence apparatus and code breaking was, like, the nexus but then this whole ecosystem of technology in like, communications and detection and, like, the actual way the ships were constructed came about to support that code breaking effort."
    },
    {
      "timestamp": "0:37:55.2",
      "speaker": "Jen Luker",
      "text": "The huge innovations we made on airplanes and air warfare has dramatically furthered our abilities to do things, like, you know, fly to the moon, or fly to Mars."
    },
    {
      "timestamp": "0:38:08.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I was going to say, like, fly to Europe, fly to China."
    },
    {
      "timestamp": "0:38:12.5",
      "speaker": "Safia Abdalla",
      "text": "Yeah. Much closer, but also just as cool, almost."
    },
    {
      "timestamp": "0:38:18.0",
      "speaker": "Jen Luker",
      "text": "But I mean, we would have eventually gotten there, I guess."
    },
    {
      "timestamp": "0:38:20.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:38:20.9",
      "speaker": "Jen Luker",
      "text": "We would have eventually gotten to space, but part of the fact that we went from war into a cold war is what pushed us into space, too."
    },
    {
      "timestamp": "0:38:30.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Nice."
    },
    {
      "timestamp": "0:38:31.7",
      "speaker": "Jen Luker",
      "text": "So it wasn’t just the ability to travel distances, it was literally the ability to leave our planet."
    },
    {
      "timestamp": "0:38:37.3",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:38:37.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! I never even thought of that. Space travel is really interesting ‘cause I feel like right after the war when we went to, you know, when we first started going to space and the moon, it’s like we were just barely able to do that and we thought, “Well, now we’re going to go to Mars. We’re going to go to all these crazy places within a few years.” But really, we were just barely able to do that and it was super expensive."
    },
    {
      "timestamp": "0:39:05.8",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:39:06.6",
      "speaker": "Jen Luker",
      "text": "Yeah, but The Great Space Race due to the cold war meant that we were, you know, like you said, willing to dedicate every resource possible."
    },
    {
      "timestamp": "0:39:15.2",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Yeah."
    },
    {
      "timestamp": "0:39:17.3",
      "speaker": "Safia Abdalla",
      "text": "Yeah, and I think that is, like, and maybe not a counterpoint but something that is an analogy to that is that when you invest in things, progress happens. Whoa! Wild! Crazy!"
    },
    {
      "timestamp": "0:39:29.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Wow!"
    },
    {
      "timestamp": "0:39:30.1",
      "speaker": "Safia Abdalla",
      "text": "What a strange concept!"
    },
    {
      "timestamp": "0:39:31.5",
      "speaker": "Jen Luker",
      "text": "Right? Why do we have to wait for war for this to happen?"
    },
    {
      "timestamp": "0:39:35.4",
      "speaker": "Adam Garrett-Harris",
      "text": "I think the other thing is that investing in things heavily may not be sustainable. So this can apply to working a lot of overtime, putting in more than 40, 50, 60 hours a week, you know, running yourself ragged. Personally, like, as a startup company it’s just, you can do it for a little while-"
    },
    {
      "timestamp": "0:39:59.3",
      "speaker": "Jen Luker",
      "text": "Then maybe you should allow women into the engineering fields that allow it to happen so you’ve got more people so you don’t have to work, 40, 50, 60-"
    },
    {
      "timestamp": "0:40:09.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:40:09.7",
      "speaker": "Jen Luker",
      "text": "70, 80 hours on it. Just hire more people that are qualified."
    },
    {
      "timestamp": "0:40:14.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. Although throwing more people at a late project makes it later."
    },
    {
      "timestamp": "0:40:20.0",
      "speaker": "Jen Luker",
      "text": "Yes, however, training people means you end up with senior devs."
    },
    {
      "timestamp": "0:40:27.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:40:27.9",
      "speaker": "Jen Luker",
      "text": "If you don’t ever train anyone, you’re going to run out of senior devs eventually."
    },
    {
      "timestamp": "0:40:30.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Right (laughs)."
    },
    {
      "timestamp": "0:40:32.5",
      "speaker": "Safia Abdalla",
      "text": "Do we want to do, like, concluding thoughts on the book? Or…"
    },
    {
      "timestamp": "0:40:36.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, let go for that. Overall thoughts on the book?"
    },
    {
      "timestamp": "0:40:39.2",
      "speaker": "Jen Luker",
      "text": "I enjoyed the history lesson. I felt that maybe there wasn’t enough focus specifically on the code breakers themselves. It was much more of a generic effort across them all but I certainly learned a lot, and got salty for all new reasons."
    },
    {
      "timestamp": "0:40:58.3",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:40:59.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Got salty?"
    },
    {
      "timestamp": "0:41:00.8",
      "speaker": "Safia Abdalla",
      "text": "Oh!"
    },
    {
      "timestamp": "0:41:01.7",
      "speaker": "Jen Luker",
      "text": "Oh… (laughs)"
    },
    {
      "timestamp": "0:41:02.3",
      "speaker": "Safia Abdalla",
      "text": "Are we going to have Modern Lingo 101? (laughs)"
    },
    {
      "timestamp": "0:41:06.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Got salty?"
    },
    {
      "timestamp": "0:41:08.9",
      "speaker": "Safia Abdalla",
      "text": "(laughs) Oh!"
    },
    {
      "timestamp": "0:41:11.1",
      "speaker": "Jen Luker",
      "text": "Fine! So-"
    },
    {
      "timestamp": "0:41:12.6",
      "speaker": "Safia Abdalla",
      "text": "So-"
    },
    {
      "timestamp": "0:41:13.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Should I get on Urban Dictionary?"
    },
    {
      "timestamp": "0:41:15.8",
      "speaker": "Safia Abdalla",
      "text": "Yes. So being salty is kind of like, being bitter towards something or someone. Say nobody invited you to a party and you were, like, salty about it. You were just like, bitter about not being invited to the party."
    },
    {
      "timestamp": "0:41:29.0",
      "speaker": "Jen Luker",
      "text": "It’s like, sassy-angry."
    },
    {
      "timestamp": "0:41:30.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Okay. No, I get it. Yeah."
    },
    {
      "timestamp": "0:41:33.1",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:41:33.7",
      "speaker": "Jen Luker",
      "text": "Snarky-angry, maybe?"
    },
    {
      "timestamp": "0:41:35.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Cool."
    },
    {
      "timestamp": "0:41:38.1",
      "speaker": "Safia Abdalla",
      "text": "It’s what the kids are saying these days, Adam."
    },
    {
      "timestamp": "0:41:40.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Okay."
    },
    {
      "timestamp": "0:41:41.3",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:41:42.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Good to know."
    },
    {
      "timestamp": "0:41:42.1",
      "speaker": "Jen Luker",
      "text": "It has been for a little while. For real."
    },
    {
      "timestamp": "0:41:44.7",
      "speaker": "Safia Abdalla",
      "text": "True. I will admit being “salty” is kind of a little… a little outdated at this point. But… (laughs)"
    },
    {
      "timestamp": "0:41:51.0",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:41:53.1",
      "speaker": "Jen Luker",
      "text": "Yeah, which is why I thought, you know, hello fellow kids, I could get away with it."
    },
    {
      "timestamp": "0:41:57.4",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:41:58.6",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:42:01.0",
      "speaker": "Safia Abdalla",
      "text": "Oh my goodness."
    },
    {
      "timestamp": "0:42:02.3",
      "speaker": "Jen Luker",
      "text": "Apparently not!"
    },
    {
      "timestamp": "0:42:05.5",
      "speaker": "Safia Abdalla",
      "text": "You’ve got a young one on the panel, so…"
    },
    {
      "timestamp": "0:42:10.7",
      "speaker": "Jen Luker",
      "text": "And apparently I’m not the oldest one, anymore!"
    },
    {
      "timestamp": "0:42:14.0",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:42:15.7",
      "speaker": "Jen Luker",
      "text": "That now goes to Adam."
    },
    {
      "timestamp": "0:42:17.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yes."
    },
    {
      "timestamp": "0:42:18.6",
      "speaker": "Safia Abdalla",
      "text": "All right."
    },
    {
      "timestamp": "0:42:19.2",
      "speaker": "Adam Garrett-Harris",
      "text": "So, I really enjoyed the book. And it really makes me want to dig into some of these topics. Even just into cryptography in general."
    },
    {
      "timestamp": "0:42:30.2",
      "text": "And I really loved how Dot Braden’s story is threaded throughout. I feel like that’s kind of the unifying story whereas other people will come in and out of the story a lot."
    },
    {
      "timestamp": "0:42:42.0",
      "text": "It was also ending on a really happy note, that the war was won, but then it kind of shows the other side of it how they got older and they couldn’t tell anybody. And also how when they were helping kill the enemy, basically, by cracking these codes they felt no remorse, right? ‘Cause they were helping to win the war. And then the sentiment changed after the war, just a few years later, and maybe like, their own daughter would say, “How could you do that? How could you help kill all of those people?”"
    },
    {
      "timestamp": "0:43:14.0",
      "text": "And they started thinking about it like, “Okay, those Japanese people, they had wives, they had mothers.”"
    },
    {
      "timestamp": "0:43:20.6",
      "speaker": "Safia Abdalla",
      "text": "Yeah. The PTSD/Psychological Trauma aspect to it. I can share my thoughts."
    },
    {
      "timestamp": "0:43:31.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, go for it."
    },
    {
      "timestamp": "0:43:32.5",
      "speaker": "Safia Abdalla",
      "text": "I really struggled with this book, y’all. (laughs) Maybe it’s just because I’ve been, like, you know, busy in my personal life with on-boarding to a new job and just like, hectic situations that put me in a situation where I wasn’t really able to like, sit down and focus intently on a book, but I found this really hard to read."
    },
    {
      "timestamp": "0:43:55.1",
      "text": "Even with that in mind, for me it was just like, too many characters to keep track of. I tend to be, like, very person-focused. When I read books I’m really interested in, like, the people and tracking down their experiences and, like, with the book there were just, like, so many characters that it overwhelmed me a little bit. They’re not characters, they’re real human beings who’ve lived and existed."
    },
    {
      "timestamp": "0:44:17.6",
      "speaker": "Adam Garrett-Harris",
      "text": "I know! I keep saying that, characters."
    },
    {
      "timestamp": "0:44:19.2",
      "speaker": "Safia Abdalla",
      "text": "Yeah! (laughs) Yeah. I would not like to be referred to as a character once I’m dead."
    },
    {
      "timestamp": "0:44:25.1",
      "speaker": "ALL",
      "text": "(laughing)"
    },
    {
      "timestamp": "0:44:26.8",
      "speaker": "Safia Abdalla",
      "text": "I found that aspect of it really hard just for  me personally with the way that I like to read books and process them mentally, and I wish there was… maybe it’s not, you know, the focus of a book like this, but just like a little bit more about the actual, like, code breaking and less about like, their day-to-day lives. And I understand that was part of the book was they wanted to paint a realistic picture of what it was like to be one of these women and part of history is understanding the boring part of people’s lives and what it was like to be them, but it was also just like, so boring. I was like, “Okay, yeah. They marched a lot for people, and dated, and ate in different places.” And that was like-"
    },
    {
      "timestamp": "0:45:10.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. I really enjoyed those parts but-"
    },
    {
      "timestamp": "0:45:13.6",
      "speaker": "Safia Abdalla",
      "text": "Really?"
    },
    {
      "timestamp": "0:45:14.3",
      "speaker": "Adam Garrett-Harris",
      "text": "I’m with you, it was long and so I struggled to find time to sit down and read it. Yeah, I liked it! Like, the story where they were going to go and buy a mattress and then they realized they don’t deliver so they had to, like, have the guy come home with the mattress on top of his car and then feed him dinner as payment for bringing it home."
    },
    {
      "timestamp": "0:45:34.3",
      "speaker": "Safia Abdalla",
      "text": "(laughs) Yeah, I mean, I don’t know what it was, it was just that it didn’t quite appeal to me with this particular book."
    },
    {
      "timestamp": "0:45:42.5",
      "speaker": "Adam Garrett-Harris",
      "text": "But I do want to get into the encryption stuff at some point, with some books."
    },
    {
      "timestamp": "0:45:46.5",
      "speaker": "Safia Abdalla",
      "text": "Yeah, like-"
    },
    {
      "timestamp": "0:45:48.3",
      "speaker": "Jen Luker",
      "text": "I just kind of felt like this book tried to cram too much in. Like, this was the untold story of the women code breakers so I expected it to be much more focused on women and their lives and their stories and the things they experienced, and you know, to understand some of that you had to understand some of the code breaking side of it and I just feel like maybe it should have been split into two different books. Like, tell us about the women and then tell us about, like, the code breaking efforts of the American side of the war."
    },
    {
      "timestamp": "0:46:17.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:46:17.8",
      "speaker": "Safia Abdalla",
      "text": "Yeah. That’s a good perspective on it, too. I do think it would have been much better as like, a multiple-part series."
    },
    {
      "timestamp": "0:46:25.8",
      "speaker": "Adam Garrett-Harris",
      "text": "And I feel like I would have enjoyed it a lot more if I knew more about the war in general, before reading it."
    },
    {
      "timestamp": "0:46:30.2",
      "speaker": "Safia Abdalla",
      "text": "Yeah. So overall my rating for it would be like a 3 out of 5, maybe like a 2.75 out of 5 if we’re being extremely pedantic. I did like the fact that it exposed me to tons of new stories that I didn’t know about. I did learn lots of new things about the war effort in and of itself that I didn’t know about, but the density of all of the characters and all of the information made it really hard to read. It was a mental task to, like, figure out the themes of the book to be able to share them. So-"
    },
    {
      "timestamp": "0:47:06.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:47:06.5",
      "speaker": "Jen Luker",
      "text": "Right? There was just so much it was hard to say, “Okay, this is what I want to talk about in this next episode.” Or, “This is the piece I want to talk about.” It was just like, so much information and at the same time I have to admit I’ve read like two and a half thousand pages of books in the last two weeks and not very many of them were this book because you kind of had to be in the mood to pick it up and read about a whole bunch of war and ‘40s and you know, like, dealing with the fact that there was just so much sexism and so there was that anger, you know, quality about it. It wasn’t exactly the, “Let’s read a relaxing book before I go to bed” kind of story."
    },
    {
      "timestamp": "0:47:42.6",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) No, it wasn’t. And I tried reading this both on paper and ebook version and it was almost impossible to read it on an ebook because I just couldn't tell when I was getting to the end of anything on the ebook. At least with a physical book I could hold it and kind of flip forward and see where I was at."
    },
    {
      "timestamp": "0:48:00.2",
      "speaker": "Safia Abdalla",
      "text": "Yeah. I read it on my kindle. The one thing I do have on my kindle is the little indicator that says, you know, “You’ve got 26 minutes in the book” or however many in the chapter. So that was, like, one good measurement. I was like, “All right-”"
    },
    {
      "timestamp": "0:48:13.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:48:13.5",
      "speaker": "Safia Abdalla",
      "text": "“If I just keep reading I’ll get to the end of this.” Which…"
    },
    {
      "timestamp": "0:48:16.3",
      "speaker": "Adam Garrett-Harris",
      "text": "But when it said you have 8 hours left in the book, that was not helpful. (laughs)"
    },
    {
      "timestamp": "0:48:20.7",
      "speaker": "Safia Abdalla",
      "text": "(laughs) Yeah, I do it by chapter instead of by the book because-"
    },
    {
      "timestamp": "0:48:24.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah!"
    },
    {
      "timestamp": "0:48:26.5",
      "speaker": "Jen Luker",
      "text": "Yeah…"
    },
    {
      "timestamp": "0:48:27.1",
      "speaker": "Safia Abdalla",
      "text": "Hours you have left in the book is… (laughs)"
    },
    {
      "timestamp": "0:48:31.7",
      "speaker": "Adam Garrett-Harris",
      "text": "All right. Well thanks for sticking with it and reading it with me. I really enjoyed talking about it."
    },
    {
      "timestamp": "0:48:37.3",
      "speaker": "Safia Abdalla",
      "text": "No, I’m glad you did and it goes to show, like, we talk about all of these different books. Some might not resonate with us, others might. It’s like, kind of subjective so it’s cool to hear your perspective on it, too."
    },
    {
      "timestamp": "0:48:49.7",
      "speaker": "Adam Garrett-Harris",
      "text": "All right. Well I’ll talk to y’all next time. We’ll, I think, we decided the next book we’re talking about is “Ready Player One.”"
    },
    {
      "timestamp": "0:48:58.0",
      "speaker": "Safia Abdalla",
      "text": "Hurrah! I’ve seen the movie but I have not read the book, so…"
    },
    {
      "timestamp": "0:49:01.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Hurrah!"
    },
    {
      "timestamp": "0:49:01.6",
      "speaker": "Safia Abdalla",
      "text": "That should be fun."
    },
    {
      "timestamp": "0:49:02.5",
      "speaker": "Jen Luker",
      "text": "I’ve done both! So this will be a nice review."
    },
    {
      "timestamp": "0:49:06.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Nice! Okay. See you all next time!"
    },
    {
      "timestamp": "0:49:08.9",
      "speaker": "Safia Abdalla",
      "text": "All right. See ya folks!"
    },
    {
      "timestamp": "0:49:10.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Bye."
    },
    {
      "timestamp": "0:49:11.3",
      "speaker": "Jen Luker",
      "text": "Bye."
    },
    {
      "timestamp": "0:49:12.2",
      "speaker": "Safia Abdalla",
      "text": "Bye."
    },
    {
      "text": "(Exit music: Electro swing)"
    }
  ]
}