{
  "note": "Do not edit this file directly. Edit the txt file and then run the convertTranscript script to generate this file.",
  "podcast": "BookBytes",
  "episode": "32",
  "transcript": [
    {
      "timestamp": "0:00:16.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Hello, and welcome to BookBytes, a book club podcast for developers. Today we’re talking about “Remote” by Jason Fried and David Heinemeier Hansson. I’m Adam Garrett-Harris."
    },
    {
      "timestamp": "0:00:28.9",
      "speaker": "Jason Staten",
      "text": "I’m Jason Staten."
    },
    {
      "timestamp": "0:00:29.9",
      "speaker": "Adam Garrett-Harris",
      "text": "I hope I said the name right, Jason Fried {pronounced freed} and not Fried. I think I’m right."
    },
    {
      "timestamp": "0:00:34.0",
      "speaker": "Jason Staten",
      "text": "Yeah, I’ll take you on that. (laughs)"
    },
    {
      "timestamp": "0:00:36.5",
      "speaker": "Adam Garrett-Harris",
      "text": "So, you suggested this as a book we should read right now because of everything that’s going on with Coronavirus and I was like, “Yeah! I’m actually really interested in reading this book now.”"
    },
    {
      "timestamp": "0:00:46.0",
      "text": "Because I’ve heard of it before and, I don’t know, I wasn’t super interested in it because it wasn’t really… I’ve never really done remote work before… but now we all are! If you’re lucky enough to still be working because I do know some people that have been laid off and that’s really sad. "
    },
    {
      "timestamp": "0:01:05.9",
      "speaker": "Jason Staten",
      "text": "Yeah. I thought it was pretty relevant as well, at the moment. I actually had purchased this book a while back, and I think I suggested it, and we just never got around to it between a few of the others. So I’ve been kind of itching to read it, and now I have, and I’m glad that I did. I guess, going through it, firstly, it is a pretty light read. I felt like I really blasted through it."
    },
    {
      "timestamp": "0:01:40.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, it seems small at first glance. It’s like 240 pages but then when you take into account that every second or third page is a full screen illustration, or full page illustration, it’s really like a 100 page book."
    },
    {
      "timestamp": "0:01:51.8",
      "speaker": "Jason Staten",
      "text": "Yeah. Yeah, and I think that that is really all that it needs to be. I felt like they definitely proved their point a couple of times. Also having the artwork there, though, was definitely entertaining."
    },
    {
      "timestamp": "0:02:06.6",
      "speaker": "Adam Garrett-Harris",
      "text": "It was! I liked it!"
    },
    {
      "timestamp": "0:02:08.8",
      "speaker": "Jason Staten",
      "text": "I could see the design company influence in it and I-"
    },
    {
      "timestamp": "0:02:11.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! Yeah, so it’s basically written by this company... The two authors are the founders of a company called 37signals that make Basecamp and Basecamp is a tool you can use for remote workers. I feel like they did a good job of balancing, “Hey, Basecamp is a thing you could use”, but not pushing it so much."
    },
    {
      "timestamp": "0:02:34.2",
      "speaker": "Jason Staten",
      "text": "Mm-hmm (affirmative).  Yeah, 37signals is actually a company that I’m more familiar with having worked in the Ruby space previously. Had you heard of them prior to reading the book?"
    },
    {
      "timestamp": "0:02:45.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, definitely because I know DHH had made Ruby on Rails and I knew about Basecamp. I didn’t really know about Campfire."
    },
    {
      "timestamp": "0:02:53.4",
      "speaker": "Jason Staten",
      "text": "Yeah, I think I am less familiar with that but it sounds more of like a chat system, but now we are in an environment where we are actually flooded with chat systems. (laughs)"
    },
    {
      "timestamp": "0:03:04.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah and so this book was written in 2013, so 7 years ago, and I thought it might be a little outdated, and it shows that in a few regards, but mostly the principles in it are timeless. So it’ll mention some tools, it’ll mention they use Webex or you can use GoToMeeting, so there’s no mention of Zoom, but that’s fine, it doesn’t really matter. The point is you can see another person’s face, and hear them, and you can share your screen."
    },
    {
      "timestamp": "0:03:29.5",
      "speaker": "Jason Staten",
      "text": "Mm-hmm (affirmative).  Yeah, I definitely still think that the talking points are relevant and I think, yeah, you can just go and mentally substitute one name for another in a lot of cases and it still applies."
    },
    {
      "timestamp": "0:03:45.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. So in the first chapter it’s kind of making the case for remote work and why now is a good time for it. It has a really good question there at the beginning which I want to ask you which is: Where do you go when you really have to get work done?"
    },
    {
      "timestamp": "0:04:02.2",
      "speaker": "Jason Staten",
      "text": "Yeah, that struck a chord with me right off the bat and that was one of my thoughts that they mention which was going to the office really early. Like, if you've ever shown up at the office and the lights are off because nobody’s there yet, that is kind of my time that I’ve been most productive in some cases, or, I mean, many times it’s also not at the office."
    },
    {
      "timestamp": "0:04:28.3",
      "text": "One of the things that I had done before “work from home always”, I would actually take Thursdays and work remote from a couple of local coffee shops or work at home, but not in a place where somebody could tap me on the shoulder, and that is where I would go if I needed to really put my head down and get something done. "
    },
    {
      "timestamp": "0:04:51.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm, yeah."
    },
    {
      "timestamp": "0:04:53.1",
      "speaker": "Jason Staten",
      "text": "What about you? What’s your go to?"
    },
    {
      "timestamp": "0:04:55.0",
      "speaker": "Adam Garrett-Harris",
      "text": "I used to really love going into the office early, get there at 7 am when most people show up at 9 am, and I would come into the office and the lights were off and I would just leave them off. There would be a couple of other people in there, too that also have the lights off. Then, eventually, you know most people are showing up when someone comes in and flips the lights on."
    },
    {
      "timestamp": "0:05:14.4",
      "text": "I’ve done work from home a little bit, we used to take one day a week to do remote work, but I never liked it because I didn’t have a good setup because we had to do video calls all day because we mob program, or pair program, and I was living in the middle of a construction zone or my son was home part of the day and it just wasn’t a good environment. And I didn’t have a good desk set up and I didn’t have an extra monitor and so on and so forth. "
    },
    {
      "timestamp": "0:05:43.0",
      "text": "Having to work from home now, it forced me to get a really good home setup so the very first day of mandatory work from home, I went to Ikea and got a really cheap standing desk with a crank and we took our monitors home from work and since everyone is working from home it makes it so much easier. I feel like if you’re the only one working from home it can be kind of terrible. "
    },
    {
      "timestamp": "0:06:04.8",
      "speaker": "Jason Staten",
      "text": "I would agree with that. I think that’s one of the things that they call out in the book, is to not have the token remote person, or the one person who’s trying it out because then other people aren’t thinking from that standpoint and you wind up being on a conference call in a… oftentimes it’s on a Webex even, that I’ve experienced, where I’m on somebody’s laptop-"
    },
    {
      "timestamp": "0:06:30.7",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:06:30.7",
      "speaker": "Jason Staten",
      "text": "In a corner of the room where they’re sitting at long conference table and everybody laughs about some joke and I have no idea what’s going on."
    },
    {
      "timestamp": "0:06:37.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:06:38.7",
      "speaker": "Jason Staten",
      "text": "And so it’s really hard to give and receive input because you don’t really have a lot of involvement in it. And when everybody is remote then everybody’s dialing in and everybody is getting the same audio level and it levels the playing field and I think, also, yeah, it just dramatically improves the experience. So I do like that the book in particular calls out, firstly, that when you do it, you should have, like, a whole team do it. Like, a group of people that are working together on that front so then they can try it out rather than just saying this one person is doing this because that has some big trade offs when not everybody thinks about the position that they’re in."
    },
    {
      "timestamp": "0:07:28.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! And it’s good, too, to have… it mentions maybe having every employee work from home a couple of days a week because then when they’re in the office they know what it’s like to be that person who’s remote and they can empathize with them and make accommodations. And make sure you have good audio quality in those meeting rooms. Make sure you’re including your remote people."
    },
    {
      "timestamp": "0:07:52.4",
      "speaker": "Jason Staten",
      "text": "I would also agree with you about having a good setup. There is a pretty big difference between just having your laptop at home and sitting at... whatever, kind of, works?"
    },
    {
      "timestamp": "0:08:04.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Sitting on the couch or the kitchen table."
    },
    {
      "timestamp": "0:08:06.2",
      "speaker": "Jason Staten",
      "text": "Right. And I think there are a number of advantages of having a well-defined setup."
    },
    {
      "timestamp": "0:08:12.4",
      "text": "Firstly, I have a spare bedroom that has a desk in it that I’ve converted to my office. Converting was more of a mental change than anything because I didn’t have to add a whole lot, but at the same time it is the line that I cross to say, “I am working now and this is the zone that I do my work.” And I leave my work laptop in there and then when I leave it, I have left it behind and so there’s no fuzzy gray area for me when it comes to working and I think that helps. "
    },
    {
      "timestamp": "0:08:46.4",
      "text": "And then I think the second thing, too, is just having the time to do it. For me, I almost feel like, I mean doing it once a week was nice for me to go heads down on it and get some work done, but now I’m actually feeling like, having been at home for 2 months, I’m getting more up to speed where it’s just the norm and everything’s functioning instead of everybody figuring out, “Okay, how do I make sure that I dial in to the right zoom? Oh, I need to be sure to use one with a password so that way (laughs) we don’t have random people show up in there.” "
    },
    {
      "timestamp": "0:09:27.8",
      "text": "And just kind of figuring out how, like, how to work remotely. It takes time, you have to figure it out. It doesn’t just fall into place in the same way that being in an office does. "
    },
    {
      "timestamp": "0:09:42.0",
      "speaker": "Adam Garrett-Harris",
      "text": "I mean, even that doesn’t just fall into place but we’ve been practicing it for a long time and when you’re a new employee to a company it takes you some time to ramp up so it’s the same thing when you start working remotely."
    },
    {
      "timestamp": "0:09:53.8",
      "speaker": "Jason Staten",
      "text": "Yeah, that’s one thing that’s had to happen at Domo is that we've hired people since going full-time remote. I think some of them came on like a week after and them having to figure out, like, what our processes are and our answer is basically, “We don’t know yet!” (laughs)"
    },
    {
      "timestamp": "0:10:12.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:10:13.3",
      "speaker": "Jason Staten",
      "text": "So, it’s been a learning experience."
    },
    {
      "timestamp": "0:10:15.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Another thing that I thought was interesting about why it’s a good time for remote work, not only do we have the technology now that allows us to do it and we’re just kind of stuck in the past thinking we have to come into the office, but you don’t have to have all of the talent in one city to be able to hire somebody. The cities don’t have to have monopolies on the talent anymore, you can live anywhere. And you can also hang onto your employees longer because they can move to another city and they don’t have to leave your company."
    },
    {
      "timestamp": "0:10:46.3",
      "speaker": "Jason Staten",
      "text": "Yeah, that’s definitely a huge thing, you’re not chained in one location just because you’re getting paid there and then the flip of it, yeah, the companies can benefit by having people in the places that are best for them because, like, some people just thrive in a super urban, downtown, city location, and other people want to live far away from other people because that’s their ideal, and then there are even the others that want to be traveling all the time. I think they talk about the person that has been in 8 cities at the time of reading the book and they said, “We don’t ever know where this person’s at, but they’re always on the call.”"
    },
    {
      "timestamp": "0:11:29.7",
      "speaker": "Adam Garrett-Harris",
      "text": "It doesn’t really matter."
    },
    {
      "timestamp": "0:11:30.8",
      "speaker": "Jason Staten",
      "text": "Yeah. And I think that’s another really critical thing that is touched on as well. It doesn’t matter if they’re in the office but rather, it matters what the work is that they get done. You can definitely strip back the layers of, like, this person schmoozing person, and more like, this person gets stuff done. It doesn’t matter what time of day."
    },
    {
      "timestamp": "0:11:57.8",
      "speaker": "Adam Garrett-Harris",
      "text": "It’s not about, it’s no longer about, well are they there from 9-5 or are they there early, are they there late? It’s not about if they are sitting in a chair, it’s the work that speaks for itself."
    },
    {
      "timestamp": "0:12:11.4",
      "text": "Another thing, another theme in this book is: it’s not all or nothing. So it’s not all or nothing for all of your employees to have to work remote. It’s not all or nothing for where you work. You can work at home sometimes, or at coffee shops, and it’s not all or nothing for having an office or not. You can have an office, I think maybe they even built an office after they were mostly remote because it’s just nice to have a place where people can… maybe they work remote in the morning and then they come into the office in the afternoon sometimes. Or it’s nice to have a place for your big, couple of times a year, meetups. Your all hands in meetings where you fly everyone in. You don’t have to, but just because you have a building doesn’t mean that you have to enforce that everyone comes into that building. "
    },
    {
      "timestamp": "0:12:54.7",
      "speaker": "Jason Staten",
      "text": "Yeah, I liked their analogy of saying in person meetings can be like dining out where if you dine out occasionally it’s really nice; but if you are eating out all the time then it can become more of a drag of, “Well where are we going to go this time? I don’t really love that place…”"
    },
    {
      "timestamp": "0:13:17.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:13:18.2",
      "speaker": "Jason Staten",
      "text": "But doing it sparingly makes it a special occasion and makes it highly valued and so that time that you have together can be productively used."
    },
    {
      "timestamp": "0:13:29.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and the other thing about meeting in person occasionally is so that you can put a real life face to a name that you see in slack or maybe see them in a meeting but it's not the same as seeing them in person. So you want to be able to see people often enough that you associate them with their “who you know them to be in real life.” And I also like-"
    },
    {
      "timestamp": "0:13:52.1",
      "speaker": "Jason Staten",
      "text": "Definitely."
    },
    {
      "timestamp": "0:13:53.2",
      "speaker": "Adam Garrett-Harris",
      "text": "One of the excuses in the book is, “Magic only happens when we’re all in a room.” But how many breakthrough ideas can a company actually digest? You don’t need to be coming up with the next big idea every week. It’s… It’s- (laughs)"
    },
    {
      "timestamp": "0:14:08.9",
      "speaker": "Jason Staten",
      "text": "Right."
    },
    {
      "timestamp": "0:14:09.8",
      "speaker": "Adam Garrett-Harris",
      "text": "There’s a quote that says, “It’s making better the thing you already thought of 6 months ago, or 6 years ago, that’s the work of work.” That’s what you’re doing most of the time, working on the ideas you had 6 months ago."
    },
    {
      "timestamp": "0:14:21.8",
      "speaker": "Jason Staten",
      "text": "And then with those brilliant moments, there is a snippet in the book or a quote in the book that I really loved where it talked about: You have these bright ideas, you should work through them before you need more. You should clean your plate before getting up for seconds. I really liked that, that reference on it because it’s-"
    },
    {
      "timestamp": "0:14:38.7",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) You like the food analogies."
    },
    {
      "timestamp": "0:14:41.0",
      "speaker": "Jason Staten",
      "text": "It’s true! Yeah. I’m all about food this time."
    },
    {
      "timestamp": "0:14:45.2",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Oh, and there’s tons of other excuses which, most of them I don’t really relate to because they’re kind of from the business’ point of view. “Who will answer the phone?” Or, “Only the office will be secure!”"
    },
    {
      "timestamp": "0:14:56.3",
      "speaker": "Jason Staten",
      "text": "I have heard the one about “everyone equally miserable.” So while that’s never been explicitly stated, I have heard before from a company that, “Some people might be jealous that other people are working remote and, all of a sudden, everybody might want to be remote, all of the time. And what would that do to us as a company?“"
    },
    {
      "timestamp": "0:15:18.3",
      "text": "When I think that is … It’s a nice way of putting it. (laughs) Or like, a really bold way of putting it when that’s really what’s being stated is, “Just because this one person gets this thing…” Like, “This person shouldn’t get nice things because not everybody can.”"
    },
    {
      "timestamp": "0:15:39.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Right."
    },
    {
      "timestamp": "0:15:39.7",
      "speaker": "Jason Staten",
      "text": "Is what’s being stated and, yeah, that’s a pretty poor excuse because in every company and every place of work people all have different situations. Not everybody gets the same compensation."
    },
    {
      "timestamp": "0:15:54.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Right."
    },
    {
      "timestamp": "0:15:56.0",
      "speaker": "Jason Staten",
      "text": "Not everybody gets, like, I mean, there are accommodations made for everybody."
    },
    {
      "timestamp": "0:15:59.9",
      "speaker": "Adam Garrett-Harris",
      "text": "And there’s certain positions that wouldn’t work remotely, so they're not going to be jealous of people who are able to do remote work."
    },
    {
      "timestamp": "0:16:07.4",
      "speaker": "Jason Staten",
      "text": "Yeah, definitely."
    },
    {
      "timestamp": "0:16:07.8",
      "speaker": "Adam Garrett-Harris",
      "text": "If your job is to move packages from one location to another then you understand you can’t work remotely."
    },
    {
      "timestamp": "0:16:13.8",
      "speaker": "Jason Staten",
      "text": "Right, yeah. Physical presence is absolutely necessary for some roles; and some people don’t even like the idea of it! Some people love having the idea of working within an office."
    },
    {
      "timestamp": "0:16:29.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Right."
    },
    {
      "timestamp": "0:16:29.6",
      "speaker": "Jason Staten",
      "text": "Like, that is their place to get things done. I mean, I have talked to people that, I mean, you can’t necessarily equate, like, mandatory work from home being the same as remote, but I know for some people, it is driving them nuts."
    },
    {
      "timestamp": "0:16:46.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative). Yeah."
    },
    {
      "timestamp": "0:16:46.2",
      "speaker": "Jason Staten",
      "text": "And other people are just thriving. And this is definitely picking those two camps apart a bit."
    },
    {
      "timestamp": "0:16:53.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. So there are some kind of rules to working remotely and this one I thought was kind of a bummer because it’s talking about all of these positives, knocking down all of these excuses, but then it has this rule of “Thou shalt overlap.”  So it means you should, wherever you’re working in the world, you should be overlapping some of your hours with the people on your team. So if your team is in Chicago, you might not be able to work on the other side of the world if none of your hours overlap. That would be really, really difficult. You couldn’t have any real time collaboration. It’s like such a challenge and it’s more of a challenge than it’s worth. And I actually had an experience with this."
    },
    {
      "timestamp": "0:17:35.3",
      "text": "I was trying to onboard at a new company and the only other developer on my team was, and I don’t even remember exactly which country, I feel bad. I should remember. Anyway, so he was in a country where if I needed him to overlap with me, he could stay late, he could stay an hour late and I could come in an hour early. So that’s not ideal. I had to, like, I had to coordinate it with him the day before. Before I leave I would say, “Hey, can you come in early tomorrow?” And then I would come in early and then we could talk for an hour, but it was really difficult to learn the codebase, ask questions-"
    },
    {
      "timestamp": "0:18:16.2",
      "speaker": "Jason Staten",
      "text": "Yeah. I could see that being really difficult to coordinate, especially if you’re just ramping up."
    },
    {
      "timestamp": "0:18:22.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:18:22.5",
      "speaker": "Jason Staten",
      "text": "I do think that it is a strong recommendation by them because it is something that has worked for them, but I do think, given the right company and circumstances, it can work. I do think they mention that but it is a big hurdle because you have to be able to work asynchronously on the extreme. You have to be able to coordinate, like, a really solid handoff. Otherwise-"
    },
    {
      "timestamp": "0:18:55.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Like, it works for a lot of open source projects, so it can work."
    },
    {
      "timestamp": "0:18:59.4",
      "speaker": "Jason Staten",
      "text": "Yeah! Yeah, definitely. People who submit pull requests on my projects definitely work asynchronously-"
    },
    {
      "timestamp": "0:19:05.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! (laughs)"
    },
    {
      "timestamp": "0:19:06.4",
      "speaker": "Jason Staten",
      "text": "Because I take (laughs) I take some time to get back sometimes. Speaking of, that is a good reminder, thanks. (laughs)"
    },
    {
      "timestamp": "0:19:12.0",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Another thing that was really interesting is that, I didn’t think it was going to happen, but it did mention pandemics in this book. Did you notice that?"
    },
    {
      "timestamp": "0:19:19.9",
      "speaker": "Jason Staten",
      "text": "Yeah! Yeah, did see that mentioned. I don’t remember the name of the specific company but I believe it was an insurance company that went through a natural disaster at their headquarters or something, but because they were primarily remote, or a majority faction of them were remote, they were able to continue on and provide service, even though something so big had happened. Whereas, if you’re all located in one single place, you are literally a single point of failure."
    },
    {
      "timestamp": "0:19:53.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. So a remote company is disaster-ready. If you lose the internet, or air conditioning, or electricity, or there’s a flood, or fire, whatever, pandemic, you can just keep on going like nothing happened. And it’s not even just those kinds of big disasters, there's also “personal” disasters. Like, you need to be home for a repair, or delivery, or a kid is sick. That’s fine. Even if your company just allows you to work some days at home per week. “Okay! You can work at home on that day that you need a delivery.” And if your kid is sick, maybe you don’t get as much work done from home as you would in the office, but it’s more than if you couldn’t work from home at all."
    },
    {
      "timestamp": "0:20:37.7",
      "speaker": "Jason Staten",
      "text": "Right. And if you have structures in place to accommodate that, too, then, once again, it’ll be an easy transition over to it whereas if it’s going to be impossible for you to attend the meetings that you need to for that day, or do the kind of collaboration points that you need for that day, then taking that time off because your child is sick, it becomes a lot more difficult versus, “Oh yeah, I’ll be in the Zoom.”"
    },
    {
      "timestamp": "0:21:10.6",
      "text": "(Typewriter Dings)"
    },
    {
      "timestamp": "0:21:12.0",
      "speaker": "Adam Garrett-Harris",
      "text": "This episode of BookBytes is sponsored by Pluralsight."
    },
    {
      "timestamp": "0:21:15.1",
      "text": "Pluralsight is a technology skills platform. You can see where your skills stand, master the latest technologies, and show off your expertise. And they’re currently hiring positions where you’ll be remote, for now at least. "
    },
    {
      "timestamp": "0:21:29.6",
      "text": "They have a really amazing culture in the company as a whole, and in the engineering organization as well. They work in small, cross functional, autonomous teams and each team owns the discovery, design, development, delivery and production support of their part of the overall system. They encourage test-driven development, pair programming, continuous delivery, refactoring, and clean code. "
    },
    {
      "timestamp": "0:21:54.7",
      "text": "Pluralsight was named the #9 Best Workplace and One of the Best Workplaces for Women by Great Place to Work. "
    },
    {
      "timestamp": "0:22:00.3",
      "text": "If you want to work there, visit pluralsight.com/careers/engineering to learn more. That’s pluralsight.com/careers/engineering. "
    },
    {
      "timestamp": "0:22:11.4",
      "text": "And if you’d be interested in checking out the product for yourself, you can send a direct message to @Pluralsight on Twitter and they’ll send you a free trial code so you can check it out for yourself. "
    },
    {
      "timestamp": "0:22:21.5",
      "text": "And thanks to Pluralsight for sponsoring the show!"
    },
    {
      "timestamp": "0:22:24.6",
      "speaker": "Jason Staten",
      "text": "It does talk about: the flip side of the work is what matters. So I mean, we mentioned it briefly that what gets done is what kind of shines when it comes to working remotely-"
    },
    {
      "timestamp": "0:22:38.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:22:39.0",
      "speaker": "Jason Staten",
      "text": "Because that is what’s visible. You can see the product of what people are doing less than the side chatter that occurs, but it does say that the flip of it is that you kind of need to have a virtual water cooler type of approach. You need to still have that human element to exist and it needs to be more intentional in some ways."
    },
    {
      "timestamp": "0:23:05.4",
      "text": "It’s easy to not necessarily reach out to others when you’re working remote because you don’t want to interrupt them or you don’t know what their schedule is, versus if you see somebody right next to you and they are looking at Slashdot it’s a pretty good “go ahead” of, “Hey, you know, tap me on the shoulder because I’m not necessarily doing something that’s vital right now.” You can’t see that when somebody is working remote because-"
    },
    {
      "timestamp": "0:23:35.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:23:36.1",
      "speaker": "Jason Staten",
      "text": "You don’t have that point of contact."
    },
    {
      "timestamp": "0:23:38.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. Someone today at work mentioned they miss hearing the random conversations across the room, or hearing the laugh of somebody, you know? While they're at their desk trying to get things done, you can just hear what’s going on around you and if you need a mindless break you can go join. Yeah, it said we need mindless breaks and we have to schedule those in now. Or we also have a channel we’re in all day and we say anybody can join it, but it feels like that doesn’t really happen."
    },
    {
      "timestamp": "0:24:09.7",
      "speaker": "Jason Staten",
      "text": "Yeah. I see that existing as well and I don’t feel like that has necessarily, for me, caught on quite as well. I have had a couple of days where I’ve worked with people on a project where we left a call going the whole day long and I mean, we would often turn off video or turn off the mic if, you know, we got up or something like that, but we would do that for the whole day and that actually made it all right to do some more side chatter type stuff."
    },
    {
      "timestamp": "0:24:47.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:24:48.3",
      "speaker": "Jason Staten",
      "text": "It hasn’t happened everyday and I don’t think it’s something I would want everyday, but it has been nice to kind of replicate that feeling of having somebody really close, and a lot of times it was for working on something where we needed to be very in sync with what we were doing because we didn’t want to step on each others toes, but we needed… like, it was work that could get divided, but if the wrong thing, like, if we ventured off too long on our own we would definitely wind up with big merge conflicts or overlapping in what we were doing. So, that’s worked."
    },
    {
      "timestamp": "0:25:24.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. I feel like I’m not missing that social interaction as much as people who do solo work. So I’m on a call all day with two people and whenever we are waiting on something or there's a lull and we’re not deep into a problem then we’ll just have small talk and that’s been great. It’s really not much different for me from being in the office."
    },
    {
      "timestamp": "0:25:46.4",
      "speaker": "Jason Staten",
      "text": "Yeah. I generally have, I mean, between meetings that are prearranged, I have, sometimes at lunch, I will do exercises from “Cracking the Coding Interview” with a few coworkers. We have a meeting set up and we will just do that."
    },
    {
      "timestamp": "0:26:09.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Nice."
    },
    {
      "timestamp": "0:26:10.4",
      "speaker": "Jason Staten",
      "text": "Actually, a lot of times at lunch, though, one nice thing for me that I am honestly loving, is doing it’s like 11:30 lunches and doing it from 11:30 until 12:30ish so that way I can have a little bit of overlap with my family before putting my kid down for a nap, and that’s something that I didn’t get to have previously and it is nice. It’s just like, this little bit of time to overlap to talk about what happened in the morning. What sort of thing did you learn while you were doing your schooling? And just like, a break away from work that is definitely met with a strong expectation that I’m going to be there."
    },
    {
      "timestamp": "0:26:59.2",
      "text": "So it’s also, don’t let work bleed into lunch because there are people waiting that are really important to me. So that has been really a nice thing for helping out with the social gap that exists. But yeah, that is cool that you’re on a call all day so it’s kind of that same vibe that I’ve gotten a couple of times. "
    },
    {
      "timestamp": "0:27:23.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. I’m glad you said that about family because I’ve really been enjoying having breakfast and lunch with my family. And it does mention that. You don’t have to get your social interaction from coworkers, it could be that you’re alone in a crowd in a coffee shop; or you’re in a coworking space where you get to know people a little bit more; or just your family, or your friends, or your neighbors; or you can get involved in the community! Just something that gets you talking to people on a regular basis."
    },
    {
      "timestamp": "0:27:51.0",
      "speaker": "Jason Staten",
      "text": "Right, and that definitely as social distancing-"
    },
    {
      "timestamp": "0:27:56.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Like, in real life."
    },
    {
      "timestamp": "0:27:57.6",
      "speaker": "Jason Staten",
      "text": "Right. As social distancing ventures offer, it decreases a bit more. Those things become more possible. I think that’s probably the biggest challenge is, like, you can’t necessarily go and go to your kickboxing club right now, in all places. So that adds a little bit of a challenge. But it is true, though. People at work, while they share some common tasks with you and you can really build a strong bond with them, you can also bond over many, many other things with many, many other people, and a lot of people do! And I think remote kind of forces that in some way, or at least it seems like it would in that you don’t necessarily have that physical presence and so maybe with other people, that’s the way you find it or get it."
    },
    {
      "timestamp": "0:28:50.3",
      "speaker": "Adam Garrett-Harris",
      "text": "So, one thing I found super fascinating in the last chapter, “Life as a Remote Worker”, it talks about things we’ve all heard; building a routine, and different hacks like using a different device for work and personal to kind of just separate work from home."
    },
    {
      "timestamp": "0:29:07.8",
      "text": "But it talks about staying motivated and I found that really interesting. It references a book called “Punished by Rewards” which I’ve heard of before and it sounds like a really fascinating book, but the only way, “The only reliable way-” This is a quote, “...to muster motivation is by encouraging people to work on the stuff they like and care about, with people they like and care about. And-"
    },
    {
      "timestamp": "0:29:31.1",
      "speaker": "Jason Staten",
      "text": "I like that."
    },
    {
      "timestamp": "0:29:32.0",
      "speaker": "Adam Garrett-Harris",
      "text": "The idea is, like, you can have pleasure in the work itself, that some people think there’s something wrong with that, and if you’re finding that you’re not motivated, don’t blame yourself. There’s things you can do. It says speak up and change your environment. And maybe you just need a vacation, that can do wonders. At 37signals, they say they let employees take a month-long sabbatical if they’ve been there 3 years."
    },
    {
      "timestamp": "0:29:57.8",
      "speaker": "Jason Staten",
      "text": "I do like that perspective, or I think that it is a bit of a different one from a common perspective about procrastination. A lot of times procrastination is a very self thing. “Why am I procrastinating? Why am I not getting things done?”"
    },
    {
      "timestamp": "0:30:14.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Or, “Why am I a procrastinator?” You start labeling yourself that."
    },
    {
      "timestamp": "0:30:17.4",
      "speaker": "Jason Staten",
      "text": "Yeah, labeling yourself. And I would give some, I don’t know, strong agreement with some of the things the book calls out. If you’re not getting the things done that you expect to do, there's also the assessment of: Do you even have clear direction on what it is you’re trying to do?"
    },
    {
      "timestamp": "0:30:36.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:30:36.8",
      "speaker": "Jason Staten",
      "text": "Or is the task given to you really vague of, “Make this work.”"
    },
    {
      "timestamp": "0:30:43.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Maybe you’re working on the wrong thing and everybody on your team knows you’re working on the wrong thing but no one’s spoken up about it."
    },
    {
      "timestamp": "0:30:49.1",
      "speaker": "Jason Staten",
      "text": "Yeah, I think it still does come with a responsibility on you as a worker, or you as a coworker, or you as a manager; in any of those cases, speaking up about it. So it’s not necessarily just to blame it on the thing you’re working on, saying, “This is not interesting, or not motivating to me.” But also saying, “Now, what am I going to do about it? Am I going to bring it up to my manager or team?” If it’s my team saying, “Hey, can somebody either jump on this with me?” Or, “Hey, can I swap you for something?” Or maybe, like you said, “I need to take some time off or work on something else.” There are a lot of possibilities because, I mean, companies are definitely not a one-track thing and they’re not a single person, generally. (laughs)"
    },
    {
      "timestamp": "0:31:43.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Right."
    },
    {
      "timestamp": "0:31:45.0",
      "speaker": "Jason Staten",
      "text": "Yeah, I think that’s a good call out. The separation of devices is something that I’ve done, pretty recently, that I took a stronger opting in to and bought myself my own laptop. Mine got taken over by somebody else in the family and so, like, I didn’t have one of my own for a little while and I went out and bought myself my own and got myself a X1 Yoga Lenovo laptop and threw LINUX on it and I’ve been using that. And that is now my personal device and I can’t get to work things on it. Like, I can’t go and VPN and I don’t have my code sitting on it or anything. So that temptation is gone and rather knowing, like, “When I am on this thing I am getting things done for me.” And that has been a good help, too."
    },
    {
      "timestamp": "0:32:47.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I like that. I don’t have my own computer, well I do have one that I use as the server, but I don’t have my own computer and I’m really trying to get that separation. Right now, I try to do a lot of my iPad Pro when I’m not doing work stuff and I can do most stuff on there, except for coding."
    },
    {
      "timestamp": "0:33:08.8",
      "speaker": "Jason Staten",
      "text": "Yeah, I think they even call that out, that using an iPad or a touch device, I mean, because it’s such a different medium, like you said, you can’t code on it so when you’re on that your mind is not in that mode."
    },
    {
      "timestamp": "0:33:21.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Right, yep. And unfortunately I don’t have a separate room to set up an office in, but I have a separate space in my bedroom. So I have a desk here and I don’t use it for anything else except for work."
    },
    {
      "timestamp": "0:33:33.7",
      "speaker": "Jason Staten",
      "text": "I think even that, you just have your line that’s been drawn and your well-defined place."
    },
    {
      "timestamp": "0:33:40.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:33:41.6",
      "speaker": "Jason Staten",
      "text": "And I think, for me, also, working from the office is better for me. On the flip of it, when I’m in the office/spare bedroom of mine, I am working on work stuff; and what I’ve found is that before, like when I would take my laptop and sit on the couch to try to work on something late at night because I was trying to get something done, the couch is a terrible place for me to get work done because it’s too relaxed and it says, “Hey, go check out what’s happening on Twitch because something pretty cool is happening, I’m sure.” And then all of the sudden it gets really late and I haven’t gotten near the amount of stuff done for work that I wanted to."
    },
    {
      "timestamp": "0:34:27.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:34:28.4",
      "speaker": "Jason Staten",
      "text": "So having that office is, like, “This is what I’m here for, and I’m here to work.”"
    },
    {
      "timestamp": "0:34:34.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:34:34.8",
      "speaker": "Jason Staten",
      "text": "Not that I don’t shoot the breeze every now and then, but like, it’s just that place of being and place of mind by putting myself physically there."
    },
    {
      "timestamp": "0:34:44.8",
      "speaker": "Adam Garrett-Harris",
      "text": "The other thing I do since I don’t have a separate space to cross that line and say, “I’m in work mode now.” What I do is after breakfast I go and walk around the block and that’s my “commute.” And then as soon as I walk back in the door at my house, I’m at work and I go straight to my room and that’s been really useful."
    },
    {
      "timestamp": "0:35:03.0",
      "speaker": "Jason Staten",
      "text": "Yeah. What did you think of the bit at the end about making sure you’re not ignored?"
    },
    {
      "timestamp": "0:35:09.7",
      "speaker": "Adam Garrett-Harris",
      "text": "The part was, basically it just said do good work. Yeah, I don’t know."
    },
    {
      "timestamp": "0:35:14.3",
      "speaker": "Jason Staten",
      "text": "Yeah, and I think, yeah. That is definitely a critical thing when you’re remote. Like, because work is such a defining thing when remote, but also I think some of the other things mentioned through the book kind of came back to me at that point, too."
    },
    {
      "timestamp": "0:35:35.0",
      "text": "You have to kind of put yourself out there and be intentional on fronts of reaching out to other people, or sending really well-formed emails or messages so that people can have a clearer understanding of what it is you’re working on. Or, if you’re working on something that is going to take a long time, giving that feedback early.  "
    },
    {
      "timestamp": "0:36:01.9",
      "text": "One of the things that I’ve taken to a bit, is going and making a quick screen capture of what I’m doing, whether it’s a screenshot, or if it’s kind of a longer thing, actually going and recording my screen and sending a little clip over to somebody just to give them an idea of, “Okay, here’s where I’m at, but it’s still failing here.” And I can do that without even setting up a Zoom chat, or Zoom call, in order to do it because all it’s doing is-"
    },
    {
      "timestamp": "0:36:32.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Right, it can be an asynchronous video communication."
    },
    {
      "timestamp": "0:36:37.9",
      "speaker": "Jason Staten",
      "text": "Yeah!"
    },
    {
      "timestamp": "0:36:38.7",
      "speaker": "Adam Garrett-Harris",
      "text": "It doesn’t have to- Just because it’s video, it doesn’t have to be synchronous."
    },
    {
      "timestamp": "0:36:39.6",
      "speaker": "Jason Staten",
      "text": "Right. Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:36:41.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and you also mentioned in there, writing; and the book has a whole section on writing well and if you’re going to be remote, writing is really important with a few exceptions because a lot of the way you’ll communicate is through writing."
    },
    {
      "timestamp": "0:36:54.9",
      "speaker": "Jason Staten",
      "text": "Yeah. That is so important and, in particular with things like emails, recognizing your tone and knowing that on... what is it? Like, on the sentiment scale or something? Like, sending a message as text often comes out with a lower level of sentiment because, like, people interpret things as like, maybe it’s a snarky response or it’s a really blunt response."
    },
    {
      "timestamp": "0:37:24.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Right."
    },
    {
      "timestamp": "0:37:25.0",
      "speaker": "Jason Staten",
      "text": "And that’s actually a case where, sometimes, things like emoji can be really nice. While I’m not a huge emoji user, myself, I also recognize its purpose as a way of denoting, “No, this is actually just a joke.” Or, “This is not me being snarky, I’m actually giving you a thumbs up.”"
    },
    {
      "timestamp": "0:37:45.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and all of the slack emoji reactions and custom emojis you could put in there, that’s another virtual watercooler. You don’t have to join a Zoom call to a virtual watercooler, just having a chat available with all of those emojis and gifs is a form of that."
    },
    {
      "timestamp": "0:38:03.1",
      "speaker": "Jason Staten",
      "text": "Yeah, and you mentioning not reaching for a Zoom call is one thing that I have had to keep in mind in some cases. You don’t always have to do that even though I’ve had a few times where I feel like I’ve reached for it when, in fact, I should have just taken the time to go and write the thing out for a number of cases. Firstly, that all of my thought is captured and recorded-"
    },
    {
      "timestamp": "0:38:30.8",
      "speaker": "Adam Garrett-Harris",
      "text": "There’s a paper trail."
    },
    {
      "timestamp": "0:38:31.6",
      "speaker": "Jason Staten",
      "text": "Somewhere. Whereas… yeah. Exactly. And so when that conversation we have is done, or when that person gets to the time to actually work on the thing they, like you said, have a paper trail, they can review and say, “Oh, what did we talk about? Here it is.”"
    },
    {
      "timestamp": "0:38:49.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and it’s searchable in the future."
    },
    {
      "timestamp": "0:38:52.5",
      "speaker": "Jason Staten",
      "text": "Yeah, right. You can record a video call but it would be miserable to actually go back and watch one because…"
    },
    {
      "timestamp": "0:38:59.5",
      "speaker": "Adam Garrett-Harris",
      "text": "I find that after a live event has occurred, I never want to go back and watch the recording of it."
    },
    {
      "timestamp": "0:39:05.6",
      "speaker": "Jason Staten",
      "text": "No, I’m right there with you. I was watching a thing from a Twitch streamer. I think it was earlier today, they were talking about how they go back and make YouTube clips from their stream-"
    },
    {
      "timestamp": "0:39:22.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:39:24.1",
      "speaker": "Jason Staten",
      "text": "When they do something like, even like, a 10-hour stream. Like, how do you go and clip that? And one of the things they do is they actually have a keynote tracker, or, sorry, a keyframe tracker where when some major event happens, while they’re in the middle of it they’ll go and mark it so then when they are actually going through and editing they can say, “Okay this was a highlight here, this was a highlight here.” They don’t necessarily take notes on which thing is which but there, at least, is a place to say, this was the point where that hilarious thing happened or whatever and I do wish that that were something that maybe it, I don’t know, video meetings could have."
    },
    {
      "timestamp": "0:40:09.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I mean Zoom will transcribe it and so you can read ahead through the transcript and click on the section and jump to that part of the video, so that is nice."
    },
    {
      "timestamp": "0:40:18.3",
      "speaker": "Jason Staten",
      "text": "Hmm. I have not actually seen that feature. I’ll have to dig into that. So… I learned something! But until that point, like, transcribing your thought simply by writing it up in the form of text."
    },
    {
      "timestamp": "0:40:32.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. I thought the other thing that you were going to say is that it solidifies your thoughts and makes you be concrete and like rubber ducking, you may find the solution without even having to ask it."
    },
    {
      "timestamp": "0:40:43.3",
      "speaker": "Jason Staten",
      "text": "Right, and it gives you and them opportunities to work asynchronously, as well."
    },
    {
      "timestamp": "0:40:49.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Right."
    },
    {
      "timestamp": "0:40:51.3",
      "speaker": "Jason Staten",
      "text": "Where you get something done and then they can go and take their time to consume it before coming back to you with more questions. Therefore, you don’t have to have that time alignment that exists."
    },
    {
      "timestamp": "0:41:03.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:41:04.6",
      "speaker": "Jason Staten",
      "text": "And it’s something I’m still working on. I think everybody is, but I am more and more trying to remind myself of do I need to start this as a call? Or actually, could I just take the time to write it up? I think in some ways it’s kind of, almost, lazy on my part to go and opt for doing a call because I can just blab or whatever until they eventually figure it out; whereas, like you said, solidifying my thoughts is probably a better use of both my time and theirs."
    },
    {
      "timestamp": "0:41:39.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Do you have any final thoughts? The conclusion of the book’s very short and my summary of it is basically that remote work is inevitable, that more and more companies are going to go to it. And I would have disagreed with this 7 years ago."
    },
    {
      "timestamp": "0:41:53.6",
      "speaker": "Jason Staten",
      "text": "Yeah."
    },
    {
      "timestamp": "0:41:57.1",
      "speaker": "Adam Garrett-Harris",
      "text": "But after this Coronavirus Pandemic, I have to agree. I don’t see a reason for a lot of people to go back to the office."
    },
    {
      "timestamp": "0:42:04.8",
      "speaker": "Jason Staten",
      "text": "I am right there with you, it was some serious foreshadowing that, I don’t even know if they necessarily predicted this quite as extreme as it is, but yeah, it definitely proves the point that we can do a whole lot in a remote fashion and I do think that this is going to have a strong, lasting impact on the way that work is done remotely from here on out. So, definitely was a good, short read to take in and I’m going to be passing along recommendation of the book to coworkers, as well."
    },
    {
      "timestamp": "0:42:44.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! I am, too. We’re actually going to do a book club of this book at work."
    },
    {
      "timestamp": "0:42:48.2",
      "speaker": "Jason Staten",
      "text": "Nice! You’ll have to let me know any insights that you get out of that from others."
    },
    {
      "timestamp": "0:42:52.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah!"
    },
    {
      "timestamp": "0:42:53.4",
      "speaker": "Jason Staten",
      "text": "Because I’d be curious to hear."
    },
    {
      "timestamp": "0:42:54.3",
      "speaker": "Adam Garrett-Harris",
      "text": "So next time we’re reading “You Look Like a Thing and I Love You: How Artificial Intelligence Works and Why It's Making the World a Weirder Place” by Janelle Shane."
    },
    {
      "timestamp": "0:43:02.3",
      "speaker": "Jason Staten",
      "text": "I’m looking forward to it. I’ve read a bit of the AIweirdness blog and if the book is anything like it, it’s going to be great."
    },
    {
      "timestamp": "0:43:11.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, It’s going to be a fun book."
    },
    {
      "timestamp": "0:43:13.3",
      "text": "All right, you can find the show on Orbit.fm/BookBytes, there’s a transcript there and links to the things we mentioned. You can follow the show on Twitter @BookBytes and I’m on Twitter @AGarrHarr and Jason, you’re at…"
    },
    {
      "timestamp": "0:43:30.1",
      "speaker": "Jason Staten",
      "text": "@StatenJason."
    },
    {
      "timestamp": "0:43:31.7",
      "speaker": "Adam Garrett-Harris",
      "text": "And until next time, see ya!"
    },
    {
      "timestamp": "0:43:33.0",
      "speaker": "Jason Staten",
      "text": "See ya!"
    },
    {
      "text": "(Exit music: Electro swing)"
    }
  ]
}