{
  "note": "Do not edit this file directly. Edit the txt file and then run the convertTranscript script to generate this file.",
  "podcast": "BookBytes",
  "episode": "24",
  "transcript": [
    {
      "text": "(Intro music: Electro swing)"
    },
    {
      "timestamp": "0:00:11.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Welcome to BookBytes, a book club podcast for developers. We’re reading “Code Girls: The Untold Story of the American Women Code Breakers of World War II” by Liza Mundy and today we’re talking about Part II which is titled: “Over All This Vast Expanse Of Waters Japan Was Supreme.” I’m Adam Garrett-Harris."
    },
    {
      "timestamp": "0:00:31.8",
      "speaker": "Safia Abdalla",
      "text": "I’m Safia Abdalla."
    },
    {
      "timestamp": "0:00:33.6",
      "speaker": "Jen Luker",
      "text": "I’m Jen Luker."
    },
    {
      "timestamp": "0:00:35.0",
      "speaker": "Jason Staten",
      "text": "I’m Jason Staten."
    },
    {
      "timestamp": "0:00:36.3",
      "speaker": "Adam Garrett-Harris",
      "text": "And before we get started I forgot about this last time, Safia has a new job and I know it’s all over Twitter-"
    },
    {
      "timestamp": "0:00:44.0",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:00:44.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Especially by the time this episode comes out, but we usually talk about this at the beginning of the podcast when someone gets a new job. So, would you like to tell us where you’re working?"
    },
    {
      "timestamp": "0:00:52.9",
      "speaker": "Safia Abdalla",
      "text": "Yes, I do have a new job! I am working at Microsoft, that little company that nobody’s heard of. (laughs)"
    },
    {
      "timestamp": "0:00:59.1",
      "speaker": "ALL",
      "text": "(laughing)"
    },
    {
      "timestamp": "0:01:00.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Awesome! Congrat-ch!"
    },
    {
      "timestamp": "0:01:02.4",
      "speaker": "Safia Abdalla",
      "text": "Thanks!"
    },
    {
      "timestamp": "0:01:02.6",
      "speaker": "Adam Garrett-Harris",
      "text": "“Congrat-ch”?"
    },
    {
      "timestamp": "0:01:03.2",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:01:03.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Congrats."
    },
    {
      "timestamp": "0:01:04.1",
      "speaker": "Safia Abdalla",
      "text": "Thanks."
    },
    {
      "timestamp": "0:01:04.9",
      "speaker": "Jason Staten",
      "text": "Congrats."
    },
    {
      "timestamp": "0:01:06.7",
      "speaker": "Adam Garrett-Harris",
      "text": "And what are you doing?"
    },
    {
      "timestamp": "0:01:07.6",
      "speaker": "Safia Abdalla",
      "text": "I’m working there as a software engineer on the Azure Notebooks team which is Microsoft’s Jupyter Notebooks offering."
    },
    {
      "timestamp": "0:01:15.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Very cool."
    },
    {
      "timestamp": "0:01:16.6",
      "speaker": "Safia Abdalla",
      "text": "Yeah, fun stuff."
    },
    {
      "timestamp": "0:01:18.2",
      "speaker": "Jason Staten",
      "text": "That would explain all the stuff that you’re starring on GitHub recently."
    },
    {
      "timestamp": "0:01:22.2",
      "speaker": "Safia Abdalla",
      "text": "(laughs) Are you-? I didn’t realize… Oh my goodness, that shows up on people’s feeds."
    },
    {
      "timestamp": "0:01:26.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:01:28.4",
      "speaker": "Jason Staten",
      "text": "Yeah."
    },
    {
      "timestamp": "0:01:28.4",
      "speaker": "Safia Abdalla",
      "text": "Ooh. I didn’t realize that."
    },
    {
      "timestamp": "0:01:29.0",
      "speaker": "Jason Staten",
      "text": "Only if you’re watched. So… Be aware that, like, what you star is tracked, but…"
    },
    {
      "timestamp": "0:01:36.5",
      "speaker": "Safia Abdalla",
      "text": "Okay, I don’t star anything outrageous but it’s just one of those things I’m not used to realizing that there is a social aspect to GitHub."
    },
    {
      "timestamp": "0:01:45.5",
      "speaker": "Jason Staten & Adam Garrett-Harris",
      "text": "(laughing)"
    },
    {
      "timestamp": "0:01:47.7",
      "speaker": "Safia Abdalla",
      "text": "Like the starring, and liking, and watching part. (laughs)"
    },
    {
      "timestamp": "0:01:51.2",
      "speaker": "Jason Staten",
      "text": "I think that’s why Microsoft bought them, right? ‘Cause they wanted that."
    },
    {
      "timestamp": "0:01:55.8",
      "speaker": "Safia Abdalla",
      "text": "I guess so."
    },
    {
      "timestamp": "0:01:57.0",
      "speaker": "Adam Garrett-Harris",
      "text": "All right. So let’s get into the book. What did y’all think about this part? Part II."
    },
    {
      "text": "(Typewriter Dings)"
    },
    {
      "timestamp": "0:02:03.1",
      "speaker": "Safia Abdalla",
      "text": "I think we were talking about this before, it had a lot of things going on with a respect to, just like, the different aspects of the war that were covered. So, yeah. There were, like, quite a few quotations that I marked down as ones that were really interesting. It’s just when we look back at them from, like, a modern software engineering or tech industry perspective and then just, kind of, some of the anecdotes that were shared from each woman’s particular experiences that were, like, “Oh! I feel for you so much across these pages and these decades-"
    },
    {
      "timestamp": "0:02:39.7",
      "speaker": "Adam Garrett-Harris",
      "text": "(chuckles)"
    },
    {
      "timestamp": "0:02:40.1",
      "speaker": "Safia Abdalla",
      "text": "And these vast miles of land that separate us. Like, I know what that feeling is!” So yeah, there were quite a few somber moments for me."
    },
    {
      "timestamp": "0:02:50.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, there were quite a few places where I compared it to modern-day software engineering..."
    },
    {
      "timestamp": "0:02:55.1",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:02:56.2",
      "speaker": "Adam Garrett-Harris",
      "text": "… as well. You know, I wanted to ask, like, how much each of you know about World War II going into this book?"
    },
    {
      "timestamp": "0:03:04.0",
      "speaker": "Safia Abdalla",
      "text": "I took AP U.S. History in high school and I’ve watched a few movies and documentaries about, like, Alan Turing and, like, just, you know, a couple of movies and stuff; but I never, you know, really studied the battles and military strategies. Admittedly, like, the whole... after Pearl Harbor I wasn’t aware of all of the kind of military activity that was going on. So, that was new for me, too."
    },
    {
      "timestamp": "0:03:35.6",
      "text": "Like, I knew the Battle of Midway was a big deal because, well, we have an airport here in Chicago that’s called Midway Airport named after the battle. So I knew it was a big deal battle but I didn’t know why or what happened or what went down."
    },
    {
      "timestamp": "0:03:50.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, that one sounded familiar to me as well but I didn’t know anything about it."
    },
    {
      "timestamp": "0:03:54.6",
      "speaker": "Safia Abdalla",
      "text": "Yeah. So that was also another thing that was kind of interesting to keep track of is it wasn’t just a book about female code breakers in World War II, it was also just how fighting war was changing during that time period. There was this whole other aspect to it."
    },
    {
      "timestamp": "0:04:13.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:04:14.7",
      "speaker": "Jason Staten",
      "text": "I also come from a history of only having… I mean, for me it was mostly in high school learning about it and for being very much consolidated it wasn’t like, a lengthy amount of time was spent on World War II, especially on the Pacific front, as well."
    },
    {
      "timestamp": "0:04:35.0",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:04:35.7",
      "speaker": "Jason Staten",
      "text": "I feel like there is a lot of emphasis that’s placed on Pearl Harbor and then it seems like shortly after, like, the atomic bomb was dropped and then it was all over. But there was a ton of stuff that happened in between that time and I definitely feel like that’s something that’s called out within Part II. A lot of the efforts that were spent towards deciphering the messages that were sent there and how critical that really was to trying to keep that war as short as it could be."
    },
    {
      "timestamp": "0:05:11.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I definitely had no idea that there was a period of time where it looked like we were not going to win the war. Because, like, as the title of this part goes, Japan was… their Navy was really good."
    },
    {
      "timestamp": "0:05:24.4",
      "speaker": "Safia Abdalla",
      "text": "Yeah, I wonder how much of this is due to the fact that history is written by the victors so in the process of teaching about World War II and talking about it people have just, kind of, glossed over the parts of it that were difficult, where it felt like the allies were going to lose, and just, kind of, you know, just focused on the victories over the losses and the failures. I wonder if that has anything to do with it, or if it’s just-"
    },
    {
      "timestamp": "0:05:56.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:05:57.3",
      "speaker": "Safia Abdalla",
      "text": "We’re generally… we’re software engineers and we’re not that knowledgeable of world history! (laughs)"
    },
    {
      "timestamp": "0:06:02.6",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Yeah, I don’t know very much about history just from school, not very many movies at all other then… what was that Alan Turing movie called?"
    },
    {
      "timestamp": "0:06:14.1",
      "speaker": "Safia Abdalla",
      "text": "Oh, oh my goodness. You know, it was…"
    },
    {
      "timestamp": "0:06:16.9",
      "speaker": "Adam Garrett-Harris",
      "text": "It was… not The Enigma, but… it has a weird name. Anyway, Jen, what’s your knowledge of history and World War II?"
    },
    {
      "timestamp": "0:06:27.2",
      "speaker": "Jen Luker",
      "text": "I’m a history nerd and my father-in-law was also a World War II specific nerd. So I watched lots, and lots, and lots of documentaries and had access to a great majority of nonfiction and fiction versions of World War II. So, specifically for World War II, on both sides of the front, I’m relatively knowledgeable regarding how the battles went, which ones there were, why they were kind of important to the war effort, itself; however, I’m a little bit rusty when it comes to recognizing machinery."
    },
    {
      "timestamp": "0:07:07.0",
      "speaker": "Safia Abdalla",
      "text": "I’m curious to know, I might have asked this earlier, do any of you have family who fought in World War II? Or worked in the factories that were building military equipment or kind of were involved in the process in any way?"
    },
    {
      "timestamp": "0:07:22.0",
      "speaker": "Adam Garrett-Harris",
      "text": "As far as I know none of my family served."
    },
    {
      "timestamp": "0:07:25.7",
      "speaker": "Jason Staten",
      "text": "My grandpa did but it is something that he never really talked about. Like, he kept it pretty locked up and likewise it’s something that my grandma never spoke about. And I’m not quite sure why exactly that was, but it’s also just something that I never picked up on as a kid and so it’s kind of unfortunate. Like, it was mostly all about, like, life post-that era."
    },
    {
      "timestamp": "0:07:56.4",
      "speaker": "Jen Luker",
      "text": "I have great grandparents that come from an Air Force family."
    },
    {
      "timestamp": "0:08:02.2",
      "speaker": "Adam Garrett-Harris",
      "text": "All right, so yeah. This part’s talking a lot about the Navy at the beginning, instead of the Army. And so I thought some of the contrasts between the Navy and the Army were interesting. So, for instance, in the Navy they actually let the women become military personnel and officers."
    },
    {
      "timestamp": "0:08:23.4",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:08:24.1",
      "speaker": "Jen Luker",
      "text": "For a while, and then they stopped, and then they reinstated."
    },
    {
      "timestamp": "0:08:27.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh, really?"
    },
    {
      "timestamp": "0:08:28.0",
      "speaker": "Jen Luker",
      "text": "It’s like, there was a period between World War I and World War II where they’re like, “Ah, we don’t need women anymore.” So they stopped allowing women to be actual officers. And then they-"
    },
    {
      "timestamp": "0:08:38.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh, okay."
    },
    {
      "timestamp": "0:08:39.0",
      "speaker": "Jen Luker",
      "text": "… restarted again, later."
    },
    {
      "timestamp": "0:08:40.3",
      "speaker": "Adam Garrett-Harris",
      "text": "But then if you got pregnant you were just kicked out."
    },
    {
      "timestamp": "0:08:43.4",
      "speaker": "Jason Staten",
      "text": "Yeah, that was the one thing that I had read about is they had gone and established the WAVEs and the WACs, WAVEs being the Navy and the WACs being the Army, and particularly because they were part of the military within the WAVEs, hearing about their pregnancy discharge. And it talked about one woman in particular telling a commanding officer of hers and finding out that she had three days to get out of uniform in order to get an honorable discharge. Like, that’s just… it’s pretty awful that, like, that was the approach to it. It’s just like, “Well-”"
    },
    {
      "timestamp": "0:09:31.7",
      "speaker": "Jen Luker",
      "text": "It wasn’t a surprise though. I mean, if you look at history in general, even around that time, like, you couldn’t continue to be a schoolteacher after you’d gotten married or gotten pregnant, you know? You couldn’t continue to hold just about any job as soon as you became pregnant or got married. So, I mean, why should the Navy be any different?"
    },
    {
      "timestamp": "0:09:51.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:09:52.0",
      "speaker": "Jason Staten",
      "text": "And certainly they didn't have those policies in place when they started allowing women in. I mean, they were figuring out things even down to the uniform as it discusses and trying to figure out what was actually appropriate."
    },
    {
      "timestamp": "0:10:06.8",
      "speaker": "Safia Abdalla",
      "text": "Yeah, I think one of the things that’s, sort of, for me it’s sort of an undercurrent throughout this book, is the disposability of women when it came to the war effort. Whether it was, you know, serving as code breakers or serving in different roles as officers within the Navy, there was this sense that they were only wanted because it was necessary to win the war and it was like they were treated as, sort of, like these, like, commodities."
    },
    {
      "timestamp": "0:10:41.2",
      "text": "I’m not having a very easy time phrasing this correctly because I recognize that, you know, this was a great point of change for many women because it exposed them to experiences that they otherwise would not have had the opportunity to be exposed to."
    },
    {
      "timestamp": "0:10:58.0",
      "text": "And then there’s also this uncomfortable aspect of it for me where so much of it is around using women as utilities. There's, like, a few places in the book where it references, “Oh, women would be great codebreakers because they’re good at doing meticulous and boring work!” And there’s these, like, really reductive reasons for putting women in the positions that they were in."
    },
    {
      "timestamp": "0:11:20.0",
      "text": "And so it’s kind of this hard balance of, like, I don’t want to discount the fact that this war and the fact that women were able to participate in it was a breakthrough for feminism in a lot of ways, because it allowed women to enter spaces that they previously would not have access to, but I also can’t help having this uneasy feeling about the context in which they entered these spaces and how disposable they were whether it was, you know: they got pregnant and women who were mothers were just discarded in society at that time; or they were let go because they were not smart, or didn’t know know how to swim, or didn’t know how to do this, or didn’t know how to do that, and they didn’t fit this, like, perfect mold of a woman."
    },
    {
      "timestamp": "0:11:58.5",
      "text": "And also, like, the very brazen references in the book to women not being given opportunities because men didn’t think they were attractive enough. So yeah, this is just something I’m trying to, kind of, grapple with is that as I read the book, it's like, “Yes, these were, like, such amazing opportunities for all of these women, but it pains me that so much of it was so, like, constrained and existed within this, like, very patriarchal structure."
    },
    {
      "timestamp": "0:12:25.6",
      "text": "End Rant. (laughs)"
    },
    {
      "timestamp": "0:12:27.6",
      "speaker": "Jason Staten",
      "text": "That goes back to the example of Agnes Driscoll’s fall where she happened to get into a car accident and the intelligent person, Frank Raven, was… chose to make the nickname for her to be a witch, or, I don’t know if it said that there were documents related to that, or that it stated that, specifically, but the fact that someone who is so brilliant and influential, because she had an accident that happened to her, that because, like you said, she didn’t look as pretty as whatever standard they had set anymore, that changed people’s perspective on her. It’s definitely an unsettling feeling. Like, I know what you’re saying there, Safia."
    },
    {
      "timestamp": "0:13:18.6",
      "speaker": "Safia Abdalla",
      "text": "Yeah. I’m glad you brought up that Agnes Driscoll story ‘cause I, that was one of the moments that was really somber for me while I was reading that book because I think there was, like, three words that stuck with me in that section and it was something to the effect of, like, “...the people treated her with deference, but also dismissal.”"
    },
    {
      "timestamp": "0:13:38.2",
      "text": "And I just related so deeply to that, that you can both be a woman who’s very accomplished and successful and kind of be regarded, but at the same time there’s this, like, juxtaposition of also just, kind of, being ignored and discarded and not being brought into meetings and not given opportunities to do code breaking on missions that were important, and things like that. So that phrase, “ ...deference, but dismissal” really stuck with me."
    },
    {
      "timestamp": "0:14:07.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, so it said that she had to, kind of, resort to methods to try to hold her position, right?"
    },
    {
      "timestamp": "0:14:16.5",
      "speaker": "Safia Abdalla",
      "text": "Yeah, that was also, kind of, interesting to observe because they, kind of, discussed how she kind of locked herself away so she would, like, keep certain messages that were transmitted and not necessarily share them with people, they’re mentioning how she, kind of, became very… what’s the word for it?"
    },
    {
      "timestamp": "0:14:37.2",
      "speaker": "Adam Garrett-Harris",
      "text": "It said she became fearful that she wouldn’t be able to do things."
    },
    {
      "timestamp": "0:14:40.8",
      "speaker": "Safia Abdalla",
      "text": "Yeah. It was just really hard to read her story of how this, like, one thing that was completely out of control, this accident, just completely derailed her career and the promise it had. It was just, ugh, it’s so upsetting."
    },
    {
      "timestamp": "0:14:57.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:15:00.5",
      "speaker": "Safia Abdalla",
      "text": "Also, I know we’re not allowed to say bad words on this podcast, but a personal “screw you” to Frank Raven for just… just being a dastard. I know it’s like 70 years later, he’s probably long gone, but screw you for being a dastard and just, kind of, engaging in a lot of the, like, mockery and backstabbing and degradation that contributed to her isolation."
    },
    {
      "timestamp": "0:15:33.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative).  Yeah, like, saying she looks like a witch and then, like, that doesn’t affect how she can do her job. And, like, we’re past the point of having witch hunts, you know?"
    },
    {
      "timestamp": "0:15:45.2",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:15:46.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Should be."
    },
    {
      "timestamp": "0:15:47.2",
      "speaker": "Jen Luker",
      "text": "Just remember that Mccarthyism came after that, so apparently we weren’t."
    },
    {
      "timestamp": "0:15:52.0",
      "speaker": "Safia Abdalla",
      "text": "Yeah, I was going to bring that up, that I think another challenge to reading this book is, like, you do kind of have to recognize the fact that this was 1940 and that a lot of the social, and social progress, and progress in terms of civil rights within the United States had not been initiated at all."
    },
    {
      "timestamp": "0:16:14.9",
      "text": "So, it’s like you have to, kind of, I don’t want to say “excuse people” for the things they say and the way they treated people, but there definitely is, as Jen mentioned, that historical context that sexism and racism were just very normalized in society. So maybe it was normal to, like, call the women you worked with that you didn’t think were attractive, which is, like... that very well might have been a thing. I wouldn’t be surprised if it was, but it’s also hard to stomach when you’re-"
    },
    {
      "timestamp": "0:16:44.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:16:44.8",
      "speaker": "Safia Abdalla",
      "text": "Looking back at it in the year 2019."
    },
    {
      "timestamp": "0:16:48.5",
      "speaker": "Jen Luker",
      "text": "I mean, you know, it’s one of those situations where you look back and you’re like, “Oh yeah, totally different time and different era, different, you know, different world.” And that was just shy of 80 years ago. There’s people that are alive right now that remember those times that I could go talk to, you know? And it wasn’t all that long ago. So much has happened and at the same time, so little has changed, even though so much has also changed."
    },
    {
      "timestamp": "0:17:19.4",
      "text": "But I remember a conversation with… oh, it was a woman, I think it was Jen Schiffer on Twitter who, essentially, explained that the women that stayed in the programming field were all, basically, the same. The same person."
    },
    {
      "timestamp": "0:17:40.8",
      "text": "The reason was because we were the only ones that could survive the environment and because of that, even the women in tech up, until this recent surge of new women that are staying in tech, you know, it’s even amongst the women, it’s been a very, kind of, monogamous-thought, sort of, environment just because we’re all basically the same. We’ve all done the same things, we’ve all experienced the same things, we all have very similar personality traits. And again, it’s disappointing that the reason for that is because no one else would survive."
    },
    {
      "timestamp": "0:18:14.7",
      "text": "And I kinda feel like it’s very similar with the women and the code breakers in the fact that the reason why they were able to do what it was they did was because they had that level of, “I’m going to do this in spite of the fact that society tells me I can’t or shouldn’t, or should have a different life.” And they just, they ended up being very, very passionate and, in many senses, very similar. I mean, yes, some came from more artistic backgrounds, some came from engineering backgrounds, some came from linguistics backgrounds, but all in all it seems like the personality traits were still very similar."
    },
    {
      "timestamp": "0:18:57.1",
      "speaker": "Safia Abdalla",
      "text": "Your mention, Jen, of the kind of, like, the personalities of the women who survived in the tech industry and were the ones who kind of, stuck around as code breakers and officers in World War II remind me of a point that was made in the book about when, I don’t know if it was the WACs or the WAVEs or which group it was, but it was a group of female Navy officers who would, kind of routinely, march around New York City whenever the Mayor at the time was bringing in a dignitary or an ambassador."
    },
    {
      "timestamp": "0:19:29.8",
      "text": "And one of the statements that was really interesting that kind of struck me was some person had made the point that the women who were marching in front of these, like, dignitaries and out in New York City, they, like, explicitly called out that they were not blondes and that they were not tall and they were sort of these, like, representations of women that did not align with the representation of a woman that was consumed by society through media at the time. It wasn’t a tall, blonde, moviestar. They were just kind of regular women from all across the country who were marching."
    },
    {
      "timestamp": "0:20:05.9",
      "text": "And I thought it was interesting that, you know, they might have had, kind of, like, the same tenacity, the same intelligence, the same rigor. There was the sense that they just, kind of like, visually represented ideals of women that were-"
    },
    {
      "timestamp": "0:20:21.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:20:21.3",
      "speaker": "Safia Abdalla",
      "text": "...not the standard the society had at the time. They were not tall blondes, it was a very bold statement that was saying, “That is not what real women look like. We have all of these different shapes, and sizes, and heights, and hair colors, and looks that you can’t fit into this model that’s been produced on movie screens and TV.” So I thought that was, kind of, really cool."
    },
    {
      "timestamp": "0:20:42.9",
      "speaker": "Jason Staten",
      "text": "The struggle that carries throughout the ages that I know, even still now, is the exclusion of pockets within the uniform that they opted for women in WAVEs, and I have seen that on countless occasions where women’s attire does not have a pocket, or a fake pocket, or it has a pocket that is ridiculously small."
    },
    {
      "timestamp": "0:21:12.0",
      "text": "And there’s actually a website somewhere, I need to go digging up for the URL of this thing, but they go and take the measurements of modern phones and attempt to put them in a woman’s pocket and, like, they model it out to see, like, this is (laughs) like, this is the Samsung Galaxy Note, or whatever and like-"
    },
    {
      "timestamp": "0:21:35.8",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:21:36.4",
      "speaker": "Jason Staten",
      "text": "Not even a chance. I mean, it fits like a quarter of it in. And I still think that it is one of those things where it’s like, the whole notion that women don’t need to be carrying things, or don’t want to carry things, in their pocket seems outright absurd. Like, we all have things to carry."
    },
    {
      "timestamp": "0:21:57.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:21:58.1",
      "speaker": "Jen Luker",
      "text": "We have purses and, besides, it would ruin the lining of our hips and our curves. So, I mean, clearly we don’t want to put things in our pockets because then we’ll have a bulge in a weird place!"
    },
    {
      "timestamp": "0:22:07.6",
      "speaker": "ALL",
      "text": "(laughing)"
    },
    {
      "timestamp": "0:22:08.1",
      "speaker": "Jen Luker",
      "text": "And that would just not be attractive."
    },
    {
      "timestamp": "0:22:10.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, it said that in the book, right? It would ruin the lines of the uniform. Yeah, no one says that about a man’s uniform."
    },
    {
      "timestamp": "0:22:18.0",
      "speaker": "Jen Luker",
      "text": "No, but I mean, even today they say that about women and women’s pants and women’s dressed. Women get super excited-"
    },
    {
      "timestamp": "0:22:25.2",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:22:25.0",
      "speaker": "Jen Luker",
      "text": "Over a dress that has pockets. We don’t give a flying rat’s patootie about our line, we want to be able to put stuff in our pockets. Like, it’s, like, it’s a touchy thing for me, okay? (laughs)"
    },
    {
      "timestamp": "0:22:35.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. If you care about that you can just not use the pocket. The pocket could still be there if you want to use it."
    },
    {
      "timestamp": "0:22:41.6",
      "speaker": "Jen Luker",
      "text": "Not necessarily. The thing is though, is because of the amount of fabric that’s created, or required, in order to create a pocket that size for use, it ends up creating its own line. You end up, like, -"
    },
    {
      "timestamp": "0:22:52.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:22:53.2",
      "speaker": "Jen Luker",
      "text": "You end up with a pocket line which, again, is unattractive. So it changes how women have to wear clothes in order to accommodate a larger pocket. So, skinny jeans for instance, more and more of them are having decent pockets but the reason why is because they’re lower, lower on the leg. So otherwise you end up with a large amount of pocket fabric that pushes right through the lining of the skinny jeans, for instance. So, we have to wear clothes differently in order to accommodate larger pockets."
    },
    {
      "timestamp": "0:23:25.1",
      "speaker": "Safia Abdalla",
      "text": "And I know one of the big fashion, I guess not fashion, reasons that a lot of women’s jeans don’t have back pockets, or have really small back pockets, is because that’s supposed to accentuate the curves of your backside. So it’s very explicitly a clothing design decision that was made because the intent was to, like, sexualize women’s bodies. I don’t know, it’s fair if you, like-"
    },
    {
      "timestamp": "0:23:53.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:23:54.7",
      "speaker": "Safia Abdalla",
      "text": "Want to buy a pair of jeans with no back pockets, or small back pockets, because you want to accentuate your backside. But then when it’s just the monolith of every jean that exists has no back pocket because somebody decided that, like, all women wanted to accentuate their backsides and that was the rule of the land is so frustrating. (laughs)"
    },
    {
      "timestamp": "0:24:15.3",
      "speaker": "Jen Luker",
      "text": "Like, give me options!"
    },
    {
      "timestamp": "0:24:17.9",
      "speaker": "Safia Abdalla",
      "text": "(laughs) Yeah."
    },
    {
      "timestamp": "0:24:17.9",
      "speaker": "Jen Luker",
      "text": "Sometimes I want a pretty booty! Other times I want, you know, to put something there, like a phone."
    },
    {
      "timestamp": "0:24:23.9",
      "speaker": "Safia Abdalla",
      "text": "(laughs) Yes!"
    },
    {
      "timestamp": "0:24:24.6",
      "speaker": "ALL",
      "text": "(laughing)"
    },
    {
      "timestamp": "0:24:25.2",
      "speaker": "Safia Abdalla",
      "text": "Yeah, and you have a point you brought, Jason, is so interesting because I remember I was at a conference, most of them were like 5 years ago and someone brought up that point to me that, you know, tech companies keep making phones larger and larger and I’d love to see how many women are in the hardware design meetings for all of these phones who are actually voicing concerns about the size of devices that won’t fit in certain pockets or bags."
    },
    {
      "timestamp": "0:24:49.1",
      "speaker": "Jason Staten",
      "text": "Hmm."
    },
    {
      "timestamp": "0:24:49.9",
      "speaker": "Safia Abdalla",
      "text": "Another point that was made: if you have slightly longer nails, which women tend to do sometimes as a personal style choice, it’s, like, harder to use touch screens and that’s a problem that nobody has solved. It’s also harder to use keyboards and probably nobody has thought of it in those design meetings."
    },
    {
      "timestamp": "0:25:08.2",
      "text": "So I was just having this conversation with somebody and it really struck me, not only because I hadn’t considered those myself, those questions, but just because I've, kind of, been observing how technology has changed over the past 6 years since I had that conversation to see if those design meetings had gotten any women who would inform them about the needs of women with longer nails or smaller pockets and all that. Anyway…"
    },
    {
      "timestamp": "0:25:35.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:25:36.7",
      "speaker": "Jen Luker",
      "text": "Yes, but even if you got women into those meetings you’d actually have to have someone willing to listen to them and that’s not always the case."
    },
    {
      "timestamp": "0:25:43.9",
      "speaker": "Safia Abdalla",
      "text": "Oh, yes. (laughs) That’s true."
    },
    {
      "timestamp": "0:25:45.5",
      "speaker": "Jason Staten",
      "text": "That’s like the direct line back to that meeting that’s discussed in “Technically Wrong”."
    },
    {
      "timestamp": "0:25:52.1",
      "speaker": "Safia Abdalla",
      "text": "You’re going to have to remind me."
    },
    {
      "timestamp": "0:25:54.2",
      "speaker": "Jason Staten",
      "text": "There was a meeting of, like, what should we make this product for? And they wanted to make a… what was it? Was it watch?"
    },
    {
      "timestamp": "0:26:04.4",
      "speaker": "Safia Abdalla",
      "text": "Oh, is this the watches?"
    },
    {
      "timestamp": "0:26:05.5",
      "speaker": "Jason Staten",
      "text": "Yeah."
    },
    {
      "timestamp": "0:26:05.8",
      "speaker": "Safia Abdalla",
      "text": "Yeah, the watches, I think that’s-"
    },
    {
      "timestamp": "0:26:06.6",
      "speaker": "Jason Staten",
      "text": "And like, as long as it looks good and, like, does, like, these stereotypical things women want, great. Then we’re good."
    },
    {
      "timestamp": "0:26:17.6",
      "speaker": "Safia Abdalla",
      "text": "Oh, yes."
    },
    {
      "timestamp": "0:26:18.4",
      "speaker": "Jason Staten",
      "text": "Then ignoring a, you know, any evidence that was brought forward to them by the woman that was in the room. So, yeah, exactly what you were saying, Jen."
    },
    {
      "timestamp": "0:26:29.4",
      "speaker": "Jen Luker",
      "text": "Yup."
    },
    {
      "timestamp": "0:26:29.8",
      "speaker": "Jason Staten",
      "text": "And on the note of watches, smart watches today, even, have that same problem where it’s often that women’s wrists are smaller but smart watches are not very accommodating to that, like they would swallow up the whole thing. And so-"
    },
    {
      "timestamp": "0:26:44.2",
      "speaker": "Safia Abdalla",
      "text": "Yes! Oh my goodness."
    },
    {
      "timestamp": "0:26:45.6",
      "speaker": "Jen Luker",
      "text": "Such a problem."
    },
    {
      "timestamp": "0:26:47.0",
      "speaker": "Safia Abdalla",
      "text": "I’ve been dealing with this problem so much!"
    },
    {
      "timestamp": "0:26:49.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Like, helps you shop?"
    },
    {
      "timestamp": "0:26:50.9",
      "speaker": "Safia Abdalla",
      "text": "Ugh."
    },
    {
      "timestamp": "0:26:51.5",
      "speaker": "Jen Luker",
      "text": "It’s like, being my size, as I am, we’ll go with that, “my size as I am”, people don’t actually realize that I have very small wrists so I tend to have to buy size smalls. It also means that any shirts that I buy have, like, really baggy wrist sizes and stuff like that. So it’s definitely something that I can also relate to."
    },
    {
      "timestamp": "0:27:12.2",
      "speaker": "Adam Garrett-Harris",
      "text": "So, on another note, the stuff in here that reminded me of computer science, one of them is this course that the Navy recruits went through on cryptanalysis. It said, “It was a good course, and they had worked hard at mastering it, but the problems often didn’t dovetail with the actual work-"
    },
    {
      "timestamp": "0:27:33.1",
      "speaker": "Safia Abdalla & Jason Staten",
      "text": "(laughing)"
    },
    {
      "timestamp": "0:27:33.2",
      "speaker": "Adam Garrett-Harris",
      "text": "...they found themselves doing; lots of the tasks they were facing had not been covered.” And so I thought that reminded me of my computer science degree."
    },
    {
      "timestamp": "0:27:34.0",
      "speaker": "Safia Abdalla",
      "text": "Yeah! (laughs) That’s uh, really funny to me. I think that might be just a fact of any course at this point is it’s probably not going to be super useful to your career, but maybe I shouldn’t generalize."
    },
    {
      "timestamp": "0:27:52.9",
      "text": "One of the comments that struck me that was kind of CS/Software development related was there was a quote that said the best way to get to a solution for a cipher was, like, to use an eraser. Basically the quote was trying to elude to the fact that if you wanted to get to the right answer to break a cipher you would have to be comfortable with erasing a lot of your work and starting over, or just like, deleting things that were wrong."
    },
    {
      "timestamp": "0:28:20.6",
      "text": "So I thought that was kind of an interesting idea relating to the fact that sometimes, you know, don’t be too attached to your code, be comfortable with deleting it. Similarly, don’t be too attached with the line of thinking you had for a solution to a cipher, be ready to erase it."
    },
    {
      "timestamp": "0:28:35.4",
      "speaker": "Jen Luker",
      "text": "That reminds me of a couple different things. One of them is Brian Holt’s quote of, you know, “Write code to throw it away”?"
    },
    {
      "timestamp": "0:28:43.1",
      "speaker": "Safia Abdalla",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:28:43.8",
      "speaker": "Jen Luker",
      "text": "And the other one being, you know:  first make it work, then make it right, then make it fast."
    },
    {
      "timestamp": "0:28:52.9",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:28:53.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:28:54.7",
      "speaker": "Jen Luker",
      "text": "The ability to not just evolve, but sometimes full-on scrap it and start over with new knowledge understanding what it is you know now."
    },
    {
      "timestamp": "0:29:03.3",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:29:04.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. One of the things I like to do sometimes, it’s called a spike solution. So you just, maybe in a completely different directory or in a repo, maybe not even a repo, just go and get something kind of working, and then you’ll, like you said, Jen, using what you know now you can actually build something."
    },
    {
      "timestamp": "0:29:24.5",
      "speaker": "Jason Staten",
      "text": "That definitely is applicable for the situation the code breakers had where the ciphers that they had to work against would wind up getting changed from underneath them so all of the work that they had put in, all of the sudden, becomes obsolete or no longer effective and they do have to scrap, not everything they’ve learned, but I mean, if they’ve reverse engineered a whole code book then they likely have to go back and redo that again; and sometimes even in modern day with when you write code your business requirements can often change (laughs) and you have to scrap a lot of your codebase and even if you retain, I guess, some of the knowledge, at least you learned from it, from spiking it out."
    },
    {
      "timestamp": "0:30:12.6",
      "speaker": "Safia Abdalla",
      "text": "I’m curious to know now as we’re kind of relating all of these tidbits from the book to, like, modern software development and I’m thinking not just about code breakers in World War II but also some of the early female programmers in, like, the 50s and 60s, if there was any sort of, like, software process or engineering management type books that were written by these women or, like, workflows they had developed that we could, like, directly map to some of the things that we’re doing in software now."
    },
    {
      "timestamp": "0:30:44.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:30:44.8",
      "speaker": "Safia Abdalla",
      "text": "I think that would kind of be cool to see if they had invented processes for managing “software projects” that are still in use today."
    },
    {
      "timestamp": "0:30:56.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, that would be cool. I mean the bibliography for this book is huge so you could look through there."
    },
    {
      "timestamp": "0:31:03.2",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:31:05.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Another thing that kind of reminded me of CS is a section in chapter 8 where in the Army at Arlington Hall they had a Coke machine and you had to put a coin in there to get a little bit of Coke. And I don’t know, it, like, it seemed like it spewed it out directly, like a fountain machine, I guess, and so they figured out-"
    },
    {
      "timestamp": "0:31:30.5",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:31:31.0",
      "speaker": "Adam Garrett-Harris",
      "text": "How to rig it up where it could continuously spew free liquid and they did it by inserting the coin and then unplugging it from the wall. And-"
    },
    {
      "timestamp": "0:31:42.4",
      "speaker": "Safia Abdalla",
      "text": "Ooh."
    },
    {
      "timestamp": "0:31:41.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Basically they just hacked it which is amazing."
    },
    {
      "timestamp": "0:31:45.0",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:31:45.9",
      "speaker": "Adam Garrett-Harris",
      "text": "‘Cause that’s what they reading with the codes, they’re hackers."
    },
    {
      "timestamp": "0:31:50.4",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:31:49.1",
      "speaker": "Adam Garrett-Harris",
      "text": "And they sent around an email- I mean, not an email, it would be an email today, they sent around a memo."
    },
    {
      "timestamp": "0:31:55.3",
      "speaker": "Safia Abdalla",
      "text": "(laughs) Yeah."
    },
    {
      "timestamp": "0:31:56.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Congratulating them for having solved the machine."
    },
    {
      "timestamp": "0:31:59.3",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:31:59.8",
      "speaker": "Adam Garrett-Harris",
      "text": "And suggesting that they should pay a nickel per cup."
    },
    {
      "timestamp": "0:32:03.2",
      "speaker": "ALL",
      "text": "(laughing)"
    },
    {
      "timestamp": "0:32:07.7",
      "speaker": "Jen Luker",
      "text": "So do you know the actual origin of the word “hackers”?"
    },
    {
      "timestamp": "0:32:10.9",
      "speaker": "Adam Garrett-Harris",
      "text": "No."
    },
    {
      "timestamp": "0:32:11.5",
      "speaker": "Safia Abdalla",
      "text": "Uh, no. Do tell."
    },
    {
      "timestamp": "0:32:14.3",
      "speaker": "Jen Luker",
      "text": "So back in the day before, like, computers were really, really, really popular you had trains and when it came to trains you ended up with train clubs in colleges and a lot of the train club members were also Computer Science majors."
    },
    {
      "timestamp": "0:32:32.7",
      "text": "What essentially happened with various computers that were punch card computers at the time, they would attempt to make programs that were as small and as simple as possible. So you’d write one and then someone else in the club would essentially try to make it smaller and faster and more efficient, and the next would try to make it even more small and faster and more efficient."
    },
    {
      "timestamp": "0:32:57.0",
      "text": "So they either did that or they ended up using punch cards to make music. So each type of connection or each kind of character essentially made an odd mechanical sound within the machine itself and because of that mechanical sound being different than other mechanical sounds they would write programs that would essentially make the computers play music. So some of the early minigames."
    },
    {
      "timestamp": "0:33:23.3",
      "text": "But going back to the trains. With the trains, in order to make them run well, run better-"
    },
    {
      "timestamp": "0:33:29.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:33:29.7",
      "speaker": "Jen Luker",
      "text": "They would hack up other programs to make them smaller and more efficient. So that was the original definition of hacking and hackers was not someone that would, you know, break into a system as much as it was someone trying to make the most beautiful, and elegant, and smallest, and fastest version of a program."
    },
    {
      "timestamp": "0:33:50.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Nice. So what do y’all think about this idea that at Arlington Hall it was, like, a flat organizational structure? And like, how did that, like, benefit them working together and trying to solve these codes?"
    },
    {
      "timestamp": "0:34:03.6",
      "speaker": "Jen Luker",
      "text": "Well, when no ones the boss no one can tell you, “I have ruling rights over whether I think your solution is right or not.”"
    },
    {
      "timestamp": "0:34:10.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah! Yeah, they said it was an egalitarian work culture and good ideas could emerge from anywhere from anybody. They said it was partly due to open mindedness but also due to desperation."
    },
    {
      "timestamp": "0:34:24.9",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:34:26.5",
      "speaker": "Adam Garrett-Harris",
      "text": "That it, like, this is a war. And I don’t know if we have that kind of desperation today in companies, you might in a startup company, perhaps? Where you’re trying to get funding? But I don’t know."
    },
    {
      "timestamp": "0:34:37.5",
      "speaker": "Jason Staten",
      "text": "Yeah, I mean, even with that though it’s definitely a different level of desperation they’re dealing with, given-"
    },
    {
      "timestamp": "0:34:44.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Right."
    },
    {
      "timestamp": "0:34:43.9",
      "speaker": "Jason Staten",
      "text": "It talks about knowing that their deciphering of a message can determine the lives of a significant number of people. I mean, that definitely… while VC Money is a priority for a startup, like, yeah, lives are another order or magnitude, I would say."
    },
    {
      "timestamp": "0:35:07.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:35:09.5",
      "speaker": "Jen Luker",
      "text": "I think there’s pros and cons to flat organizations. I think that you can have a flat organization intellectually and then have a not flat organization like hierarchically. I don’t think that those two things have to be mutually exclusive. I think that being willing and accepting of any ideas that come from any direction is something that more companies need to adopt regardless of their hierarchy structure."
    },
    {
      "timestamp": "0:35:39.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh, okay. Yeah."
    },
    {
      "timestamp": "0:35:40.4",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:35:41.1",
      "speaker": "Jason Staten",
      "text": "I was reading something recently about companies that claim to execute under a flat hierarchy and having limited organizational structure and one of the cons that can come from that is that there is, rather than a formal hierarchy, you end up with an implied hierarchy where people just bubble up, like, organically in some ways. And it can be, like, whether they strive to make it a meritocracy level of things or somebody plays better office politics. Either way, like, people do move up, and because it’s not well defined, oftentimes people can either overstep their bounds or underdeliver for somebody else’s expectations because they don’t know that those exist."
    },
    {
      "timestamp": "0:36:37.3",
      "text": "So there actually can be some value in having a hierarchy."
    },
    {
      "timestamp": "0:36:43.4",
      "speaker": "Jen Luker",
      "text": "I think it’s a little bit different in that it’s more like the criminal underworld in that if someone leaves a void because of any one reason, they left the company or whatnot, then there’s a, you know, a fight to who’s going to take it over again. And at the same time you can have people that rise up organically that end up ruling, with a much heavier fist, the company without ever having the title in order to do so or having the official reason."
    },
    {
      "timestamp": "0:37:11.8",
      "text": "So it ends up just being clout-based which, sometimes, is good if it’s a small company, but once it gets bigger it starts getting to the point where the people don’t have the support that they need in order to succeed, or to continue to progress. So you end up in, I don’t know, a very Darwinian type of situation where, you know, survival of the strongest versus, I guess, survival of the best manager."
    },
    {
      "timestamp": "0:37:44.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. You may be too good at actually doing your job instead of office politics to actually get promoted in that kind of environment."
    },
    {
      "timestamp": "0:37:51.7",
      "speaker": "Safia Abdalla",
      "text": "Yeah. This brings up something I read a while back while I was, kind of, thinking about hierarchies and structure with respect to open source projects and, you know, the pros and cons of enforcing, like, a government structure in your open source project or not. And I recall reading an interesting article that said, you know, in the absence of a defined power structure what generally tends to happen in an organization is they end up mirroring the power structures that already prevail in society."
    },
    {
      "timestamp": "0:38:23.2",
      "text": "So if you exist in a society where a certain group of people have the emotional and psychological safety and the resources to pursue things more fully than another group of people then those conditions are mirrored in your organization whether you like it or not because it just, kind of, passively adapts to power structures that exist in the outside world that you’re not going to get rid of anytime soon."
    },
    {
      "timestamp": "0:38:49.2",
      "text": "You kind of, like, saw a little bit of that in this Arlington Hall chapter. It emphasized the fact that people of all ages and experience levels were allowed to rise into leadership roles, but then there’s also, like, the notion of, you know, African-Americans being segregated and being confined to roles as, like, janitors even though they had, you know, college degrees."
    },
    {
      "timestamp": "0:39:14.0",
      "text": "So you start to see how even in this, like, structure that was apparently, like, very, like, liberal, and open minded, and flat, and didn’t have a power structure, it was actually mimicking a lot of the existing power structures in society."
    },
    {
      "timestamp": "0:39:29.2",
      "text": "So yeah, that tends to be my queasiness towards, like, flat organizations or no hierarchy is, like, it actually does have a hierarchy it’s just, like, the hierarchy of power that exists in the world that is the default power structure in any kind of relationship or organization or anything like that."
    },
    {
      "timestamp": "0:39:48.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. So I liked one of these stories in here in Chapter 8 where they’ve broken a code of the Japanese. So they knew where one of the Japanese ships was and in order to go and destroy that ship, but not let the Japanese know that they’d broken their code, they sent an airplane over so it looked like they spotted the boat and then they went and, you know, destroyed the boat with a submarine."
    },
    {
      "timestamp": "0:40:14.9",
      "text": "I thought that was super cool and it said that they employed different ruses so that they wouldn’t know, that’s just one example."
    },
    {
      "timestamp": "0:40:22.4",
      "speaker": "Jason Staten",
      "text": "That was a recurring theme that they had to deal with, it seemed like, where the potential for leaks was pretty broad. And that with Midway, it talked about there was a news article talking about the importance of decoding messages that were passed there, and then wanting to actually go and cover up those things so that, that way it wouldn't wind up leaking to the Japanese that that was one of the key points of what happened."
    },
    {
      "timestamp": "0:40:56.6",
      "speaker": "Jason Staten",
      "text": "And then also, later on within this part of the book, it talked about an infiltration when they were trying to recruit a lot of women in all at once that a couple of women actually came into a facility as civilian dressed and managed to get a tour around the facility and ultimately manage to collect badges and pull out secret information."
    },
    {
      "timestamp": "0:41:23.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and none of the badges or papers were reported as missing."
    },
    {
      "timestamp": "0:41:27.9",
      "speaker": "Jason Staten",
      "text": "Yeah!"
    },
    {
      "timestamp": "0:41:28.0",
      "speaker": "Adam Garrett-Harris",
      "text": "And then maybe they, like, you don’t want to admit that that was missing.There’s, it talked about Japan’s policy about losing a code book was so strict that no one would admit it and this one guy, he lost the book and he sent a message saying how thoroughly he had destroyed it and the American actually intercepted that message and were able to decode that message using the books that he was saying he’d thoroughly destroyed."
    },
    {
      "timestamp": "0:41:52.0",
      "speaker": "ALL",
      "text": "(laughing)"
    },
    {
      "timestamp": "0:41:55.2",
      "speaker": "Adam Garrett-Harris",
      "text": "So it’s just interesting how that was one of their downfalls. Like, they thought they were being really smart by being super strict about that, but if they’d been more lax about it and said, “Hey, it’s okay. Everyone makes mistakes, just let us know and then we can change the codebooks.”"
    },
    {
      "timestamp": "0:42:10.1",
      "speaker": "Jason Staten",
      "text": "Culture-"
    },
    {
      "timestamp": "0:42:11.1",
      "speaker": "Adam Garrett-Harris",
      "text": "So I feel like that’s really applicable with programming culture. Like, you’re working on important stuff and it’s hard and you’re going to mess up sometimes, and that’s okay. Like, it’s better to admit it than to try to cover it up."
    },
    {
      "timestamp": "0:42:25.3",
      "speaker": "Jason Staten",
      "text": "Speaking of admitting and covering it up, another section that exists within there is the group that was dedicated towards breaking the Japanese Imperial messages, so not the JN-25 which I, kind of, dug into and it was kind of interesting as a side tangent thing, but particularly with the Imperial messages they struggled to find a way to break that for a long time and there were a group of people who were placed into a room and in about three months time one of the people actually opted to just straight give up and say, like, “I’m done with this.”"
    },
    {
      "timestamp": "0:43:06.0",
      "text": "And my question for all of you is: Have you ever worked on something for an extended period of time, not necessarily just like a day and backing out, but like, a serious amount of time and then had to back out of it, and why did you do it rather than pushing forward?"
    },
    {
      "timestamp": "0:43:24.9",
      "speaker": "Jen Luker",
      "text": "I’ve done it. I’ll give the story. So I was trying to work on this portion of a code base that was way more complicated than it initially ended up seeming to be and we got, and by “we” I mean I got all the way down, about three or four months in and I had one last task to handle and I kept spinning my wheels, and spinning my wheels, and spinning my wheels, and fighting, and retrying, and deleting it, and retrying, and fighting, and retrying, and deleting. And after several weeks I finally just went to a codeworker and said, “Look, I will do whatever task it is that you’re doing, I don’t care what it is, if you’ll just take this one from me.”"
    },
    {
      "timestamp": "0:44:07.4",
      "text": "And we eventually traded and I solved his in a couple of days and he solved mine in a couple of days and it worked out quite well. Just, he’d also been spinning on his task for ages and I’d been spinning on mine. And it literally came down to the fact that we’d been looking at it for so long that we could no longer come up with new solutions. We could no longer see it clearly."
    },
    {
      "timestamp": "0:44:30.6",
      "text": "It’s like reading your own document over and over and there’s a glaring typo but you never see it because your brain autocorrects. And at some point you’ve run through what you think is all of the solutions but the truth is you’ve run through everything in your box and you can’t see that you’re inside a box."
    },
    {
      "timestamp": "0:44:48.6",
      "text": "So sometimes it’s good to just step away from something, and I’m not talking, like, for an hour or a day, I’m saying just step away. (laughs) Leave it. Give it to someone else, trade for anything else you can get because it doesn’t matter anymore. No matter what you do with that task you’re never going to… you’re never going to solve it. You’re never going to fix it. You’ve backed yourself into a corner and there’s nothing you can do about it."
    },
    {
      "timestamp": "0:45:14.0",
      "text": "So (sighs) I’ve only ever done that once, but that was the time that I needed it. And I luckily had the support that I had in order to be able to just trade with someone else and get it done."
    },
    {
      "timestamp": "0:45:27.9",
      "speaker": "Safia Abdalla",
      "text": "I can relate to a story about working on something for a really long time and then, you know, setting it aside. I was working on something for… oh, like, a year and change? And it was kind of a side project type thing and it got a point where it wasn’t necessarily that it was, like, a difficult programming challenge it was just I didn’t have the mental capacity to work on it alongside my full time job as a software engineer."
    },
    {
      "timestamp": "0:46:00.3",
      "text": "And at that point in time I had to, kind of, look out for my psychological and mental wellbeing and just be, like, “Okay, Safia, you cannot code for 15 hours a day because… no. We will not do that.” So for me it was setting something aside to take care of my mental wellbeing and my emotional wellbeing."
    },
    {
      "timestamp": "0:46:24.0",
      "text": "I don’t know if that relates to this, but that’s usually the experience I have with setting things aside is because I don’t have the time to do it and I have to let it go and choose my own health and wellbeing over a project."
    },
    {
      "timestamp": "0:46:39.8",
      "speaker": "Jason Staten",
      "text": "I definitely think it’s related. Both yours and Jen’s."
    },
    {
      "timestamp": "0:46:44.1",
      "speaker": "Safia Abdalla",
      "text": "One of things that I’ve kind of been interested in is the mental toll that software engineering as, like, a very mentally taxing career, takes on people and just observing the relationships that a lot of software engineers have with mental health and mental wellbeing and the, like, very rigorous demands of the job on, like, our minds and our emotions."
    },
    {
      "timestamp": "0:47:12.6",
      "text": "Yeah I think there’s, like, a whole discussion to have about that that would be interesting but that’s always something that I’ve been interested in observing, at least."
    },
    {
      "timestamp": "0:47:22.7",
      "speaker": "Jen Luker",
      "text": "I wonder how much of that has to do with expectation, not only of ourselves, but of what others or what we think others expect of us, as well, in the sense that it does take a lot of mental, you know, brain power to come up with solutions to complex problems and a lot of that just takes thinking and mulling and, you know, rolling it around in our heads and trying to figure out, and maybe spending some time on a whiteboard or a notebook, and then starting all over and mulling about it, and thinking about it, and seeing the problems."
    },
    {
      "timestamp": "0:47:54.2",
      "text": "But we’re so expected to have fingers on keyboards for 8 hours a day, or more, that, you know, anytime that we spend just sitting and thinking is almost guilt-ridden even though that’s what’s literally required to solve the problem."
    },
    {
      "timestamp": "0:48:10.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, our jobs are more thinking than typing."
    },
    {
      "timestamp": "0:48:12.0",
      "speaker": "Jen Luker",
      "text": "But the expectation is that we’re typing."
    },
    {
      "timestamp": "0:48:15.0",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. (laughs)"
    },
    {
      "timestamp": "0:48:16.6",
      "text": "So I have one more section of the book that relates to software engineering and it’s at the beginning of Chapter 9. They had just broken 2468 which was one of the Japanese codes and they suddenly need to scale up with all these workers, kind of like a startup,and  so they had these recruiters go out but because of the top secret nature they didn’t really know what they were recruiting for but they had these huge quotas."
    },
    {
      "timestamp": "0:48:39.2",
      "text": "And so they would go out and offer these tempting promises and so, in other words, they lied. And I don’t know how often this happens with recruiters lying, but there’s definitely a lot of recruiters looking for a lot of software engineers because there’s a lot of demand. So I don’t know if y’all have any experience with that."
    },
    {
      "timestamp": "0:49:01.1",
      "speaker": "Safia Abdalla",
      "text": "Not really. I would say that the one thing that, in my experience, either when I was interviewing at a company and already knew somebody who worked there and so I could, kind of, like, go talk to them about what it was really like and not just what the recruiter was telling me."
    },
    {
      "timestamp": "0:49:17.0",
      "text": "And in the past I’ve always, like, either interned or worked at startups. One of the biggest things that startup recruiters always lie about is, like, the hours that people work."
    },
    {
      "timestamp": "0:49:26.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:49:26.6",
      "speaker": "Safia Abdalla",
      "text": "At least in my experience and this might just be, like, a very Chicago/Midwest-type thing. They try very hard in startups to emphasize that you’re not going to be working excessive hours and almost every startup that I’ve, like, interned or worked at people have worked excessive hours even though the recruiter said you wouldn’t. So, yeah."
    },
    {
      "timestamp": "0:49:45.8",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, every company I've interviewed at, that’s what they say."
    },
    {
      "timestamp": "0:49:49.1",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:49:50.1",
      "speaker": "Safia Abdalla",
      "text": "Yeah."
    },
    {
      "timestamp": "0:49:50.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Whether it’s true or not…"
    },
    {
      "timestamp": "0:49:51.8",
      "speaker": "Safia Abdalla",
      "text": "Yeah, it's always like, “Oh, we keep pretty reasonable hours.”"
    },
    {
      "timestamp": "0:49:55.0",
      "text": "And it’s just like, “Not really.” Not from what I’ve heard and from some of what I’ve experienced. But…"
    },
    {
      "timestamp": "0:50:01.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:50:02.4",
      "speaker": "Safia Abdalla",
      "text": "Yeah, I would say that’s like the only bit of, like, exaggeration or deception I’ve encountered."
    },
    {
      "timestamp": "0:50:06.6",
      "speaker": "Adam Garrett-Harris",
      "text": "They also always talk up the culture and the added perks like the free food-"
    },
    {
      "timestamp": "0:50:12.9",
      "speaker": "Safia Abdalla",
      "text": "Hmm."
    },
    {
      "timestamp": "0:50:12.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Or the ping-pong table or whatever. I’d rather have the extra money than those kinds of things."
    },
    {
      "timestamp": "0:50:19.8",
      "speaker": "Safia Abdalla",
      "text": "Yeah, I agree. It also just, like, gets kinda boring after your first, like, three or four weeks on the job. You’re just like, “Okay, free lunch. Not a big deal.”"
    },
    {
      "timestamp": "0:50:29.0",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Yeah."
    },
    {
      "timestamp": "0:50:30.5",
      "speaker": "Jason Staten",
      "text": "I was going to say that there was a recent blog post about recruiters that have circulated the orange website I think, and it (laughs), it was talking about recruiters and how you get quite a big spread of messages; where you get the ones that are totally spammy that tell you absolutely nothing about the company other than it’s an urgent position."
    },
    {
      "timestamp": "0:50:55.5",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) That’s not attractive to me that it’s urgent. That’s-"
    },
    {
      "timestamp": "0:51:00.3",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:51:00.9",
      "speaker": "Adam Garrett-Harris",
      "text": "That’s a red flag."
    },
    {
      "timestamp": "0:51:01.4",
      "speaker": "Safia Abdalla",
      "text": "Yeah. (laughs)"
    },
    {
      "timestamp": "0:51:02.2",
      "speaker": "Jason Staten",
      "text": "Yeah. It, I mean it sounds like they need a superhero, which sometimes that’s actually what they say they need. But aside from that, like, they don’t tell you a whole lot and a lot of times it’s not even something that seems remotely relevant to you and then on the flip side of it you can have somebody who actually reaches out to you that has done their research and says, “You would be a good fit because of this.”"
    },
    {
      "timestamp": "0:51:26.8",
      "text": "And that is just polar opposite of the spectrum. One of them is just blasting out as many emails as possible and the other one is super targeted. And it definitely shows, like,when you receive a targeted one it shows, like, the recruiter knows what they are actually recruiting for; whereas when it’s just a blasted one that’s asking you to work on some sort of tech that would not remotely match the type of work that you're doing."
    },
    {
      "timestamp": "0:51:57.0",
      "text": "That definitely mirrors probably some of the situation that these recruiters were faced with and, I mean, I have to laugh at, like, the worst one that I ever received was that at one point my title was “Chief Architect” at a little startup and actually having a recruiter reach out to me looking for an actual architect, not like a software one."
    },
    {
      "timestamp": "0:52:17.9",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:52:19.6",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:52:19.6",
      "speaker": "Jason Staten",
      "text": "And I’ve… (laughs) That would have been a terrible choice on their part to move further with me. Like, building a house in Agile? Ugh."
    },
    {
      "timestamp": "0:52:30.7",
      "speaker": "Safia Abdalla",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:52:30.7",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Yeah."
    },
    {
      "timestamp": "0:52:34.5",
      "text": "So yeah, I think that about wraps it up this week. It kind of talks about how they've actually started cracking more of these codes and they’re actually starting to do better in the war and they’re actually getting a lot of Japanese ships and how a lot of the Japanese soldiers actually die from starvation or disease… because they’re cutting off their supply lines."
    },
    {
      "timestamp": "0:53:00.2",
      "speaker": "Jen Luker",
      "text": "Spoilers."
    },
    {
      "timestamp": "0:53:01.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, and Part III is called “The Tide Turns”."
    },
    {
      "timestamp": "0:53:04.3",
      "speaker": "Safia Abdalla",
      "text": "Ooh."
    },
    {
      "timestamp": "0:53:06.3",
      "speaker": "Adam Garrett-Harris",
      "text": "All right. So I’ll talk to y’all next time."
    },
    {
      "timestamp": "0:53:09.2",
      "speaker": "Jason Staten",
      "text": "Bye."
    },
    {
      "timestamp": "0:53:10.0",
      "speaker": "Safia Abdalla",
      "text": "Bye, everybody!"
    },
    {
      "timestamp": "0:53:11.2",
      "speaker": "Jen Luker",
      "text": "See ya."
    },
    {
      "timestamp": "0:53:11.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Bye."
    },
    {
      "text": "(Exit music: Electro swing)"
    }
  ]
}