{
  "note": "Do not edit this file directly. Edit the txt file and then run the convertTranscript script to generate this file.",
  "podcast": "BookBytes",
  "episode": "21",
  "transcript": [
    {
      "text": "(Intro music: Electro swing)"
    },
    {
      "timestamp": "0:00:14.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Hello and welcome to BookBytes, a book club podcast for developers. We recently read and talked about a children’s picture book called “Ara the Star Engineer” by Komal Singh, which was a bestseller on launch day, and today’s she’s been gracious enough to join us to talk about her book. She’s a program manager within engineering at Google on the ads infrastructure team based out of Waterloo, Canada. And she was inspired to write this book when her 4-year-old daughter told her that engineers are boys. So, welcome to the show!"
    },
    {
      "timestamp": "0:00:45.3",
      "speaker": "Komal Singh",
      "text": "Thank you. It’s my pleasure being here."
    },
    {
      "timestamp": "0:00:47.3",
      "speaker": "Adam Garrett-Harris",
      "text": "So I loved the story of what inspired you to write the book. You know, one day you’re working from home and your daughter saw you on a call with a bunch of engineers and you were explaining who they were and they were all guys and she said, “Oh, engineers are boys.” So, just curious if you’d expand on how did that make you feel? And then what motivated you to actually go and do something about that?"
    },
    {
      "timestamp": "0:01:11.4",
      "speaker": "Komal Singh",
      "text": "Right, so you know, I have been a woman in tech pretty much my entire life. I grew up in India in the ‘80s and I took a lot of computer science courses during high school. I then went on to domy Bachelor’s in Computer Science where, again, I was a minority and, you know, me and the girls in my class were maybe like, 10-15% of the population. I then went on to do my Master’s in Computer Science and, again, we were the minority. Perhaps 15-20% women in our class and I’ve been working in tech for the past 13 years or so and I think we all will vouch to the fact women are a minority, especially women of color."
    },
    {
      "timestamp": "0:01:50.6",
      "text": "So I had always felt strongly about, you know, wanting to do something to shift the ratio but I just wasn’t sure what can be done and what I can do that might be more fun and more captivating for people to hear and see. So although I had the desire to do something I just didn’t know what it was that I could do in my personal capacity. However, it took me being a mother and hearing my daughter proclaim that engineers are boys that really, really bummed me out and made me think really hard on what is it that I can do."
    },
    {
      "timestamp": "0:02:27.3",
      "text": "So I started researching more and more and I started discovering that when it comes to kids’ picture books only about 5%, or less, books are actually authored by people of color or feature girls or women in, you know, superhero or the protagonist roles. And this, combined with the fact, with research, that girls start doubting their intelligence in STEM as early as 6 years old, is what propelled me to think about writing a book because I think that’s a fun way to talk to kids, and to grownups for that matter, and to make things more whimsical. That’s how I came up with the idea."
    },
    {
      "timestamp": "0:03:07.6",
      "text": "I started this project as a 20% project at Google, and for those who are not aware what a 20% project is, it’s basically that you, as a Googler, can spend 20% of your time, your work time towards a project that you feel strongly about as long as it’s also aligned with, you know, company’s mission and values. So I started this book project as a passion project, as a side project and you know, with time as people heard about it they started pitching in with their ideas, with what skills that they could help out with such as writing, editing, giving feedback on illustrations, designing websites, designing activity sheets and whatnot. It took us a long time because we were all new to the process. It took us two years to get to the stage of finding a publisher and then finally publishing a book. So, that in a nutshell is the story behind the story."
    },
    {
      "timestamp": "0:04:02.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, so I read somewhere that when your daughter said that you didn’t know whether to feel sad, angry, upset, disappointed. You said “bummed out.”"
    },
    {
      "timestamp": "0:04:12.2",
      "speaker": "Komal Singh",
      "text": "Yeah."
    },
    {
      "timestamp": "0:04:13.2",
      "speaker": "Adam Garrett-Harris",
      "text": "So was it really a surprise to you that she said that?"
    },
    {
      "timestamp": "0:04:16.0",
      "speaker": "Komal Singh",
      "text": "It was a surprise! You know, I tend to think that me and my husband, we expose her to a wide array of things such as, you know, books on coding and STEM-based activities. So I thought we were doing a good job at not introducing any sort of bias from our end. Like, she’s free to play with princesses if she wants, free to play with, you know, coding based toys if she wants and read such books, and she does all of that."
    },
    {
      "timestamp": "0:04:44.0",
      "text": "But then for her to actually pick up on the hidden social patterns that we see in our society that I was maybe trying to hide from her was quite a shocker. And you know, kids are such smart creatures and they are such strong parsers of patterns, as I call them."
    },
    {
      "timestamp": "0:05:02.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:05:02.8",
      "speaker": "Komal Singh",
      "text": "And she was able to definitely parse that social pattern."
    },
    {
      "timestamp": "0:05:06.5",
      "speaker": "Jason Staten",
      "text": "How do those social patterns relate to those you experienced as a child in India?"
    },
    {
      "timestamp": "0:05:11.7",
      "speaker": "Komal Singh",
      "text": "So, you know, being a minority in all of my computer science courses I remember there were times when our teachers wouldn’t even take us seriously. They thought we were taking these courses for whatever reason and if we ever got some quiz right or high marks on quizzes they thought it was just a fluke."
    },
    {
      "timestamp": "0:05:30.4",
      "speaker": "Jason Staten",
      "text": "Hmm."
    },
    {
      "timestamp": "0:05:29.9",
      "speaker": "Komal Singh",
      "text": "So they were, never quite took us seriously and it annoyed me. Luckily I had a set of parents who both are very, you know, strong supporters and feminists and my dad, being an engineer, always encouraged me to do whatever I felt like doing and I wanted to be an engineer like him. So he was such a staunch supporter, but a lot of people don’t have such kind of support and I feel that it is because I had such a strong support system I was able to do what I wanted to do. Yeah, such stereotypes and biases exist everywhere."
    },
    {
      "timestamp": "0:06:04.0",
      "speaker": "Jen Luker",
      "text": "You know, I have to admit that your story sounds a lot like mine in that I’ve been in the industry for about 13 years, I went to college and I was like, one of two women in a class of 30 developers and, you know, it was really tough going through that."
    },
    {
      "timestamp": "0:06:18.6",
      "text": "But, you know, instead of having, like, that staunch support I remember my mother sitting me down, like, around the time I was hitting, like, 12 and said, “You know, you can do anything you want, but you have to understand that there’s going to be a point where you hit hard on that glass ceiling and there’s not going to be much you can do about that. Very rarely do women ever break through that glass ceiling and you’re going to get frustrated when you hit it. But sorry, that’s how it is.”"
    },
    {
      "timestamp": "0:06:47.7",
      "text": "And that made me so angry that day and I feel like the reason why I actually made it to become a developer is because I wanted to prove that women could do what boys do, better. (laughs)"
    },
    {
      "timestamp": "0:06:59.7",
      "speaker": "Komal Singh",
      "text": "Yes. I’m with you. I’m with you and, you know, your mom was coming from her place of truth, right? And the fact that she’s been able to raise a daughter who’s been able to break the glass ceiling is testament to the fact that she did something really right. And again, you know, that somehow is part of your support system, even though she might have given you the wrong advice because that was coming from her place of truth."
    },
    {
      "timestamp": "0:07:23.2",
      "text": "But yes, I was at a stage where it was anger that propelled me and fueled me, me wanting to prove to others that I can do it, but I think over the years that has changed. Over the years instead of feeling angry at such situations and people I actually just feel sorry for them and it’s not about them anymore. It’s more about me and me wanting to do something because I have the desire to do it for my own self and for my reasons."
    },
    {
      "timestamp": "0:07:51.1",
      "speaker": "Jen Luker",
      "text": "Exactly. It was that moment where I realized that I programmed because I loved it. I loved the problem solving, I loved the puzzles, I loved almost the instant gratification of seeing something compile and function and I could do something with what I was doing and it did change very much from that place of anger to that place of wonder, but I’m not sure that I would have gotten to where I am without that little bit of anger to fuel me on. And I do secretly wonder if my mother told me that because she knew it would fuel me."
    },
    {
      "timestamp": "0:08:24.2",
      "speaker": "Komal Singh",
      "text": "Mm-hmm (affirmative)."
    },
    {
      "timestamp": "0:08:24.2",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:08:25.2",
      "speaker": "Komal Singh",
      "text": "Right, you never know."
    },
    {
      "timestamp": "0:08:29.6",
      "speaker": "Safia Abdalla",
      "text": "I’m curious to know, one of the really interesting things about your book was the fact that you featured some of the real women that you worked with. Where did you get that idea? How did you pick the specific women that you highlighted and what was their reaction to be featured in the book?"
    },
    {
      "timestamp": "0:08:46.1",
      "speaker": "Komal Singh",
      "text": "Right. So, you know, I do read a lot of books with my daughter and every time I read a book, once we were reading a book about Ada Lovelace, a children’s book, a picture book, and then she told me, “Oh Mama, I want to meet Ada Lovelace.” So I was like, “Oh, yeah. That’s going to be a problem-"
    },
    {
      "timestamp": "0:09:01.5",
      "speaker": "ALL",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:09:00.8",
      "speaker": "Komal Singh",
      "text": "-but we can read more about her.” And then one day we were reading about Grace Hopper, another fantastic children’s picture book, and then again she said, “I want to meet Grace Hopper.” So I was like, “Um, yeah, okay. That might be another problem.”"
    },
    {
      "timestamp": "0:09:15.5",
      "speaker": "ALL",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:09:15.5",
      "speaker": "Komal Singh",
      "text": "And that’s when I thought, you know, why don’t we show kids today’s equivalents of Ada Lovelace and Grace Hopper? And that’s how I thought of featuring real life women superheros, you know, who you can probably reach out to and meet in person, see them in flesh and blood because I think when kids can see something they’ll relate with those things much better."
    },
    {
      "timestamp": "0:09:39.1",
      "text": "So, you know, I thought about the people that I admire at work, people I look up to, and the four superheroes, or “SHEroes” as we call them, that are featured in the book are ones whose tech talks I’ve heard many times and they represent, you know, a very diverse spectrum of cultural backgrounds, skin color, as well as tech specialties, and age range. So that’s how I kind of narrowed down on maybe, like, 7 or 8, hoping that you know, even if, like, one of them says yes I’ll feature one in the book. (laughs)  But luckily, pretty much all of them said yes. Some of them replied instantly to the proposal that I had written for the book and why I want to do this book and the vision that I had."
    },
    {
      "timestamp": "0:10:24.6",
      "text": "So then it became a problem of narrowing down from 7 or 8 down to 4 because that’s how the script evolved. Over time we thought that, you know, 4 might be the right balance. So yeah, I mean, their reactions were instantaneous and they were all very happy and excited to hear about such a unique way to potentially close the gender gap through a children’s picture book."
    },
    {
      "timestamp": "0:10:49.7",
      "text": "Does that help answer your question?"
    },
    {
      "timestamp": "0:10:52.0",
      "speaker": "Safia Abdalla",
      "text": "Yeah, and I think it’s really neat that all of those different women were available to you in the places that you worked at and you were able to, like, recruit them and they were on board to be a part of that process."
    },
    {
      "timestamp": "0:11:06.2",
      "speaker": "Komal Singh",
      "text": "Yes, definitely. I work out of Waterloo in Canada and they’re all based out of the Google mothership in Mountain View and they have crazy, you know, travel schedules. They’re always at conferences and whatnot, so in spite of all that, you know, because they believed in the message of the book they made time for interviews, they made time for polishing up the manuscript and making it all a reality."
    },
    {
      "timestamp": "0:11:32.0",
      "speaker": "Jen Luker",
      "text": "I did see a lot of myself in this book. And I realize, again, you know, I’m not exactly four, my daughter is, but I’m not. It was still exciting for me read to this book because I had, you know, luckily, similar heroes when I was younger. I swear someday I will meet Ayanna Howard and, you know, swoon, flush, and I will try not to faint."
    },
    {
      "timestamp": "0:11:54.7",
      "text": "However, when looking through this book it was amazing to see not just age differences and, you know, ethnicities and cultures experienced, you know, throughout this book, but you also had different physical abilities. There were people in wheelchairs, you had all sorts of people and it was really magical that no matter who you are, young or old, you know, walking or wheeling, you know, you could find yourself in this book."
    },
    {
      "timestamp": "0:12:24.8",
      "text": "And you know, with that in mind I also wondered about the illustrator and how closely you worked with the illustrator. I noticed going through the book that, you know, sometimes Ara’s knees are skinned and sometimes they’re not; and sometimes there’s one bandaid and sometimes there’s two, and I loved the fact that you kind of get the progression of time while she’s trying to solve these problems through something as simple as a childhood injury."
    },
    {
      "timestamp": "0:12:51.3",
      "speaker": "Komal Singh",
      "text": "Yeah (laughs). So I love that question and when I actually read that question on, you know, the email, I was smiling because we worked so hard on the fine details. So the illustrator, about the illustrator first of all, she is based out of Istanbul in Turkey and I found her very randomly. There’s a site called Behance and that’s sort of like an Etsy for artists, especially illustrators, and I saw her work on that site and I reached out to her. And then of course I was also talking to many other illustrators through many other connections and other mediums, and the thing that I loved about her, besides her amazing talent, is that she felt really strongly about the cause of the book and that’s what I wanted. I wanted someone who was passionate about the cause because, you know, passion trumps talent and I needed that."
    },
    {
      "timestamp": "0:13:48.4",
      "text": "And so that’s how I wanted to work with her, but then once I had sort of finalized the illustrator I also discovered that she has been a guest doodler and she has done a couple of Google Doodles, as well. So it was like a perfect match."
    },
    {
      "timestamp": "0:14:03.7",
      "speaker": "Jason Staten",
      "text": "Hmm."
    },
    {
      "timestamp": "0:14:04.6",
      "speaker": "Komal Singh",
      "text": "And yes, we worked throughout the illustration process. There were many, like, we had pretty much weekly meetings where she’d send me the sketches, not just me but, you know, the entire team and we would get on a hangout call and we’d discuss what needed changes and we’d try to give her a sneak peek into the tech work. We put together a fairly extensive mood board where we put pictures from so many places from, like, 10 of us putting pictures on the mood board which can be overwhelming for the illustrator, and at times it was ‘cause there was just so much detail-"
    },
    {
      "timestamp": "0:14:39.6",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:14:39.6",
      "speaker": "Komal Singh",
      "text": "But I guess everyone wanted the book to have so many elements. So, again, you know, diversity matters because everyone had such different life experiences in the world of tech that they wanted to put on their mood boards which eventually made their way into the book. And towards, you know, crunch time we even had meetings with the illustrator three times a week. So, trying to make sure that the book represents, you know, real life scenarios and is inspiring for not just children of one kind of genre, but children of many different genres and backgrounds."
    },
    {
      "timestamp": "0:15:15.8",
      "speaker": "Jason Staten",
      "text": "So on the mood board you said that there were a lot of things on there, what is a particular thing that you put on? Or what is a specific thing that you can tell me about that was placed on there and kind of has a little more backstory to it?"
    },
    {
      "timestamp": "0:15:28.0",
      "speaker": "Komal Singh",
      "text": "I can tell you a few. One is, so in the book Ara and DeeDee, they go through various locations. They go through coding pods, they go to an ideas lab, they go to XSpace, and they go to a data center. So for each of these four locations we had many, many slides on our mood board."
    },
    {
      "timestamp": "0:15:53.4",
      "text": "For data center, of course, we had pictures of many data centers and what people working in the data center look like. We wanted to show kids, you know, how small we look inside a data center. Like, the perspective needed to be huge for kids to realize how huge data centers are. So there were pictures of lots of racks and lots of pipes and people walking with their trolleys to fix things."
    },
    {
      "timestamp": "0:16:20.2",
      "text": "For the coding pods we, of course, had pictures of real life coders. Somebody, sometimes people who are sitting in a, you know, in a ball pit and coding and sometimes they’re having coffee and coding."
    },
    {
      "timestamp": "0:16:32.0",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:16:33.3",
      "speaker": "Komal Singh",
      "text": "Sometimes people are just, like, scratching their head and writing things on the whiteboard. So all of those pictures were from real life coding locations that were put on the mood board. There’s a hangar that’s in Moffett Park in Mountain View and that hangar is depicted in the launch pads in the book. So that’s based on a real life artifact, as well."
    },
    {
      "timestamp": "0:16:58.2",
      "speaker": "Jen Luker",
      "text": "The ball pit sounds problematic as far as programming goes."
    },
    {
      "timestamp": "0:17:02.8",
      "speaker": "Komal Singh",
      "text": "(laughs) Yeah, you’d be surprised at how many times I’ve seen people code inside ball pits."
    },
    {
      "timestamp": "0:17:08.5",
      "speaker": "Adam Garrett-Harris & Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:17:10.8",
      "speaker": "Jen Luker",
      "text": "Don’t your computers sink?"
    },
    {
      "timestamp": "0:17:12.3",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:17:12.3",
      "speaker": "Komal Singh",
      "text": "Oh I think they have some sort of a stand. (laughs)"
    },
    {
      "timestamp": "0:17:15.3",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs) Jason, didn’t your daughter have a question from the illustrations?"
    },
    {
      "timestamp": "0:17:20.6",
      "speaker": "Jason Staten",
      "text": "She did, yes. So I was reading with my daughter just the other night and she… I told her that I was speaking with the author and said, “Any question that you have we can get answered.” And so we stopped on the innovation plex page which I just love that page because there’s so much in it that I catch something new every time, and one of the things she pointed out was that Ara now has a hat on when she arrives at the innovation plex. (laughs) And she had asked me, “Why does she have a hat now?”"
    },
    {
      "timestamp": "0:17:58.4",
      "speaker": "Komal Singh",
      "text": "Right, that’s so cool. So the reason she has a hat is because at Google we have this culture of newbies being called “Nooglers”, so nooglers are people who are new to Google and, you know, by tradition they get this hat, it’s called a propeller hat because what it signifies is that you’re going to do great things and you’re going to fly high. So those are called Noogler Hats. So we wanted to depict that Ara and DeeDee are coming into a place of learning where they will begin anew and they are sort of being welcomed into the innovation plex, or being indoctrinated into the innovation plex through these hats."
    },
    {
      "timestamp": "0:18:40.1",
      "speaker": "Jason Staten",
      "text": "That is awesome. I will definitely pass that along. She will love that."
    },
    {
      "timestamp": "0:18:44.3",
      "speaker": "Komal Singh",
      "text": "Yes, cool! And if you just google “noogler hats” you will see what I’m talking about."
    },
    {
      "timestamp": "0:18:49.9",
      "speaker": "Jason Staten",
      "text": "All right."
    },
    {
      "timestamp": "0:18:50.8",
      "speaker": "Adam Garrett-Harris",
      "text": "That’s awesome, I love that there’s actually an answer to that question and it wasn’t just, “Oh, this is just some weird thing that we could throw in that would look cool.”"
    },
    {
      "timestamp": "0:18:57.8",
      "speaker": "Komal Singh",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:18:58.6",
      "speaker": "Adam Garrett-Harris",
      "text": "So, there must be a lot of those types of things throughout the book and I think, especially on this innovation plex scene outside the building. Is there anything in or on that page that you would like to point out that’s really special to you?"
    },
    {
      "timestamp": "0:19:11.1",
      "speaker": "Komal Singh",
      "text": "Yes! So I’m on that page and actually a lot of people who contributed on this project are on that page. They’ve been illustrated on the page, so about ten of us are on that page. So I will let you discover which one you think is me."
    },
    {
      "timestamp": "0:19:26.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh. Hmm."
    },
    {
      "timestamp": "0:19:28.2",
      "speaker": "Komal Singh",
      "text": "Then, you know, the glass building that you see, I don’t know if you noticed, but there’s shadows, or a reflection of things that are inside the building and each of those things actually turns into a location. There’s a reflection of data centers, there’s a reflection of XSpace, as well."
    },
    {
      "timestamp": "0:19:44.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Nice!"
    },
    {
      "timestamp": "0:19:45.1",
      "speaker": "Komal Singh",
      "text": "Yeah, I’m trying to think what else."
    },
    {
      "timestamp": "0:19:47.2",
      "speaker": "Jen Luker",
      "text": "I love easter eggs!"
    },
    {
      "timestamp": "0:19:48.7",
      "speaker": "Komal Singh",
      "text": "(laughs) Yeah. Oh yeah, and then there’s something called a spaceoid, there’s like a capsule that’s going up in the space, it was like a space elevator. So, you know, that spaceoid might make an appearance in the next book and might have more of a significant role."
    },
    {
      "timestamp": "0:20:06.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Oh! You said next book! I believe that was one of our questions, is do you plan on writing any more books?"
    },
    {
      "timestamp": "0:20:11.2",
      "speaker": "Komal Singh",
      "text": "I do. We all do. However, what I do want to do is I want to take the feedback of readers, especially young readers into account. I would love to know from them, you know, what is it that they want to see in the next book? Do they want it to be based of real life characters and what kind of topics do they want to learn or hear about? Maybe they want to hear about artificial intelligence, or maybe they want to hear about computational numbers. So, soon, maybe in the next couple of months we will open up a form and I would love your help to spread this form with the young readers, and grownups for that matter, so that we are able to take the feedback into account for the next book."
    },
    {
      "timestamp": "0:20:57.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Nice."
    },
    {
      "timestamp": "0:20:57.9",
      "speaker": "Safia Abdalla",
      "text": "What is some of the feedback that you’ve heard so far about the book from younger readers and did any of it surprise you?"
    },
    {
      "timestamp": "0:21:05.4",
      "speaker": "Komal Singh",
      "text": "So, yes. A lot of children have told us that their favorite page is the bio page at the end where we actually show the real life pictures of the sheroes that are in the book and they have loved reading about the work that they do and seeing their pictures."
    },
    {
      "timestamp": "0:21:22.9",
      "text": "So in the beginning we were a little bit hesitant about putting that page because we thought maybe there’s too much detail and kids might not want to read about all these details, but then we decided it needed to be there to, you know, give closure to the story. So it was really nice to see children appreciating that last biopage."
    },
    {
      "timestamp": "0:21:44.0",
      "text": "Oh yeah, this is another interesting one. We reintroduced the concept of algorithm in the book, and again we were debating whether or not it’s too techy for chidren, whether or not they would like it, but it turns out kids have loved, you know, using that word and also writing their own algorithms for things like feeding the cat, things like going to school, like, what’s the algorithm to get up from bed and go to school? So they’re already breaking the big problem into smaller problems and thinking in terms of stacks. So that was another really nice surprise."
    },
    {
      "timestamp": "0:22:16.7",
      "speaker": "Jason Staten",
      "text": "I would agree that my daughter spends a significant amount of time on the bio page every time that we get to the end asking, “Who’s that? And who’s that? And who’s that?” We often go over each person a couple of times. It’s, so it is a great highlight there."
    },
    {
      "timestamp": "0:22:33.7",
      "speaker": "Komal Singh",
      "text": "Oh wow."
    },
    {
      "timestamp": "0:22:34.4",
      "speaker": "Jason Staten",
      "text": "And-"
    },
    {
      "timestamp": "0:22:34.9",
      "speaker": "Komal Singh",
      "text": "I’m happy to hear that."
    },
    {
      "timestamp": "0:22:36.2",
      "speaker": "Jason Staten",
      "text": "(laughs) Yeah."
    },
    {
      "timestamp": "0:22:36.6",
      "speaker": "Komal Singh",
      "text": "And I love how, I mean, I think it’s so important for kids to hear, “Oh yeah, she is a Vice President.”, “Oh yeah, she is an Engineering Director.” So think about how that fires their neurons."
    },
    {
      "timestamp": "0:22:47.1",
      "speaker": "Jen Luker",
      "text": "My daughter is extremely maternal. She never goes anywhere without at least two babies, she takes better care of them than most parents take care of their children in general. It’s really impressive. So when we’re going through the book she points at things and she goes, “Can I have a doll of that? Can I have that baby? Can I have that one?”"
    },
    {
      "timestamp": "0:23:07.5",
      "speaker": "Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:23:08.7",
      "speaker": "Jen Luker",
      "text": "“I want that.” So it’s been interesting. It’s like, she loves the book in the back because it’s something that she can hold and she can relate to. Ara itself, the book is a bit too big for her to carry around and it can be a bit too unwieldy for her to hold at 4 years old so she carries around the little notebook that’s in the back but what she wants, also, are the babies, the dolls, the characters that she can then take and put into her own situations and to develop with. So I’ve had to get like, really artsy and craftsy and turn some, like, some of some her L.O.L. Surprise dolls or something into engineers in order to help her get that. But it’s been interesting seeing how she’s taken the story and then developed her own after that."
    },
    {
      "timestamp": "0:23:51.0",
      "speaker": "Komal Singh",
      "text": "Amazing. That gives us so many ideas. I mean, maybe we should think about creating some puppets or something based on the characters that kids can touch and carry around."
    },
    {
      "timestamp": "0:24:03.3",
      "speaker": "Jason Staten",
      "text": "Hmm."
    },
    {
      "timestamp": "0:24:04.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:24:04.5",
      "speaker": "Jason Staten",
      "text": "Another thing that’s covered in the notebook of Ara’s notes, it has the four C’s that are brought up throughout the book, the code, courage, creativity, and collaboration; how did you come up with those four things?"
    },
    {
      "timestamp": "0:24:21.3",
      "speaker": "Komal Singh",
      "text": "Right. So, you know, one thing that I had very clear in my mind is that I did not want this to be a book about coding. This is not a book on how to code and this is not a book that is telling children that coding rules above everything else."
    },
    {
      "timestamp": "0:24:37.0",
      "text": "I definitely wanted to give children the message that to be a leader in engineering, to be a leader in the world of computer science or coding you have to be more than just a coder. You have to have the skills to collaborate with your peers and take their feedback which is very important. You need to be creative with ideas, come up with novel solutions to old problems. You need to have the courage to try new things, the path will not always be rosy. You will have failures but what’s more important is that you try and bounce back up from those setbacks and failures."
    },
    {
      "timestamp": "0:25:11.5",
      "text": "So I was very sure that I wanted to showcase all of these qualities of being a leader and, you know, right now those qualities come out very nicely with the four C’s in the manuscript, but it wasn’t always like that. In the earlier drafts there was just so much narrative that the simplicity of the four C’s wasn’t coming across really well and that’s how we decided to actually extract all of the technical details from the narrative and make the book more of a layered experienced and put the tech details in the notebook and in the activity sheets and then just focus the story based on the four C’s so that, you know, each of the heroes can be giving one of the C’s as a badge of honor to Ara and DeeDee."
    },
    {
      "timestamp": "0:26:01.3",
      "speaker": "Jen Luker",
      "text": "Or in this case, a bracelet."
    },
    {
      "timestamp": "0:26:03.2",
      "speaker": "Komal Singh",
      "text": "That’s right. In this case a bracelet. I’m really impressed by how you all have actually extracted these nuggets from the book that we worked very hard including. So, thank you."
    },
    {
      "timestamp": "0:26:15.7",
      "speaker": "Jen Luker",
      "text": "We loved it!"
    },
    {
      "timestamp": "0:26:16.5",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, it was fun. Yeah."
    },
    {
      "timestamp": "0:26:17.8",
      "speaker": "Jason Staten",
      "text": "Oh yeah, it’s been great."
    },
    {
      "timestamp": "0:26:19.4",
      "speaker": "Komal Singh",
      "text": "Yeah, so pretty much each of the C’s, the four C’s, is represented by a bracelet and then, you know, the SHEro hands over the bracelet to Ara which presents a lesson learned about, let’s say coding, or courage, creativity, and collaboration."
    },
    {
      "timestamp": "0:26:35.3",
      "speaker": "Safia Abdalla",
      "text": "What was the motivation behind using the bracelet as a symbol for, like, the knowledge that Ara gained throughout the story and what was the process like towards getting to that symbol?"
    },
    {
      "timestamp": "0:26:49.1",
      "speaker": "Komal Singh",
      "text": "So from what I’ve seen all sorts of children, girls, boys, and nonbinary genders, they all love crafting things, they all love making things, and bracelets is something they all end up making for whatever reason and I’ve seen lots of children make their own bracelets. So we thought that this is something that, you know, when they get into the story and they pick on this nugget about bracelets they could actually create their own bracelets of their own which doesn’t take too much time and it’s an arts and crafts project and then they could wear it as, a bracelet as a badge of honor or a bracelet of learning."
    },
    {
      "timestamp": "0:27:26.0",
      "text": "Yeah, so that was the thought process behind the bracelets."
    },
    {
      "timestamp": "0:27:30.2",
      "speaker": "Jen Luker",
      "text": "I absolutely adore that the thought process is they could make it themselves."
    },
    {
      "timestamp": "0:27:33.8",
      "speaker": "Komal Singh",
      "text": "Yeah."
    },
    {
      "timestamp": "0:27:34.9",
      "speaker": "Jason Staten",
      "text": "Throughout the book Ara has her companion, DeeDee, and I really love that DeeDee is such an approachable thing. It’s not a, kind of, sterile computer but rather a friendly droid that helps boost her up, especially when times are down. I sometimes wish that compiler errors would be as nice as that for me."
    },
    {
      "timestamp": "0:27:58.5",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:27:59.0",
      "speaker": "Jason Staten",
      "text": "And (laughs), and so my question for you is why did you choose that representation of DeeDee for a computer?"
    },
    {
      "timestamp": "0:28:10.7",
      "speaker": "Komal Singh",
      "text": "So, firstly we wanted to show the children that, you know, it’s humans that control a computer and not the other way around, and that if you know how to control something in an ethical manner you can actually make that thing work for you, work to your advantage and that thing can be your companion, it can be your assistant and help you do things faster and help you in your path of problem solving."
    },
    {
      "timestamp": "0:28:37.5",
      "text": "So that was the idea behind coming up with a robo-sidekick that could accompany Ara and also introduce some humor into the story because the story can tend to be technical at times so DeeDee introduces humor into the story and DeeDee is programmable so children know that, you know, it’s, programming computers to follow their commands is in their hand."
    },
    {
      "timestamp": "0:29:02.0",
      "text": "And then the word “DeeDee” actually comes from the Hindi word “didi” which means an elder sister, and in Chinese I’ve been told it means brother. So we wanted DeeDee to be gender neutral, as well. So you will see that throughout the narrative we don’t actually refer to DeeDee as he or she, it’s always just DeeDee. And we wanted kids to just have this companion, this older sister or older brother so to say. And yeah, that’s about it about DeeDee."
    },
    {
      "timestamp": "0:29:35.0",
      "speaker": "Jen Luker",
      "text": "But with DeeDee it’s not about commanding her, it’s still about- or him, but it’s about working with DeeDee to come to a solution. It’s about that collaboration and when it comes to technology these days everything from Alexa to Cortana to, you know, Hello Google, we’ve got all of these machines that are just begging to be… controlled and commanded and I like the fact that the commands weren’t part of this book, that there was still that level of compassion."
    },
    {
      "timestamp": "0:30:10.6",
      "text": "I mean, I even expect my child to say please and thank you to the machines we command because I think part of it is the voices that go along with it. If we’re commanding women, for instance, that we’re just allowing that stereotype of “that’s how you speak to women” to continue, as well. So, I just appreicated that about the interactions between Ara and DeeDee, as well."
    },
    {
      "timestamp": "0:30:35.2",
      "speaker": "Komal Singh",
      "text": "Yes, thank you. Yeah, we wanted the interactions to be respectful."
    },
    {
      "timestamp": "0:30:40.1",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, I love the scene where they’re putting code on DeeDee and then the message on DeeDee says, “Yummy code.”"
    },
    {
      "timestamp": "0:30:46.8",
      "speaker": "Komal Singh",
      "text": "Yes, ‘cause DeeDee’s-"
    },
    {
      "timestamp": "0:30:48.0",
      "speaker": "Adam Garrett-Harris",
      "text": "So-"
    },
    {
      "timestamp": "0:30:48.3",
      "speaker": "Komal Singh",
      "text": "-eating something, that’s food for DeeDee."
    },
    {
      "timestamp": "0:30:50.2",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:30:50.8",
      "speaker": "Komal Singh",
      "text": "(laughs) Yeah. There’s one page where Ara is being explained what an algorithm is and DeeDee’s screen says “all got rhythm.” So we thought that might be a fun way for kids to remember algorithm, all got rhythm."
    },
    {
      "timestamp": "0:31:04.9",
      "speaker": "Adam Garrett-Harris",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:31:05.8",
      "speaker": "Safia Abdalla",
      "text": "(laughs) That’s so cute. What are some of the reactions in your reviews that you’ve heard from adults about this book? And how are they similar to or different from what kids have to say about it?"
    },
    {
      "timestamp": "0:31:18.5",
      "speaker": "Komal Singh",
      "text": "Right, reviews from adults have been another endearing factor. You know, when I was writing the manuscript, my husband is not a techy he’s from a mechanical engineering background but he’s never quite done computer science related work so when he was reading the manuscript and he was like, “Oh, yeah. I understand, you know, things like what an algorithm is and how do you go about coding.”"
    },
    {
      "timestamp": "0:31:41.4",
      "text": "And I’ve had so many mothers and actually fathers come to me and say that they feel they’ve learned about the process of engineering problem solving through, or they’ve been able to get a glimpse into it through the book. And they’ve been quite fascinated with it and, you know, that they can actually use words in everyday vocabulary. Words such as coding languages, what are some of the coding languages? So a lot of grownups have come to me and told me that they’ve learned from the book as well."
    },
    {
      "timestamp": "0:32:14.6",
      "speaker": "Safia Abdalla",
      "text": "Yeah, that’s a really interesting observation. One of the things I find when I go do a lot of work like speaking about my career to children is sometimes their parents have a very hard time understanding what it actually is and as a result kind of struggle to get their kids involved with it or to push their interests in it further. So I think it’s really great that with a picture book it’s accessible and universal to all readers."
    },
    {
      "timestamp": "0:32:40.9",
      "speaker": "Komal Singh",
      "text": "Right."
    },
    {
      "timestamp": "0:32:41.5",
      "speaker": "Adam Garrett-Harris",
      "text": "So since you said your initial motivation came from your daughter, how, what does your daughter think of the book and has it changed her attitude towards engineering?"
    },
    {
      "timestamp": "0:32:52.3",
      "speaker": "Komal Singh",
      "text": "Yes, it has but it has done so in a very subtle manner. Actually the book launched in China a few months ago and both my daughter and I, we went to China for the launch of the book. Somebody asked her at the Shanghai Book Fair, “What do you want to be when you grow up?”"
    },
    {
      "timestamp": "0:33:12.8",
      "text": "And she said, “Oh I want to be an author and an engineer.” She’s saying that because she sees me as an engineer and she sees me as as engineer so that was extremely endearing to hear. But I told her, “You know, you can be anything you want to be. You don’t have to confine yourself to what your mom is doing.”"
    },
    {
      "timestamp": "0:33:32.7",
      "text": "And she said, “Yes, but I want to be these things because if I’m an author I can create books that the whole world reads, and if I’m an engineer I can build my own things, anything that I want to build.” So yes, it has definitely shifted her perception, as well-"
    },
    {
      "timestamp": "0:33:49.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:33:50.5",
      "speaker": "Komal Singh",
      "text": "On what she can achieve."
    },
    {
      "timestamp": "0:33:51.9",
      "speaker": "Adam Garrett-Harris",
      "text": "That’s awesome, that’s really inspiring."
    },
    {
      "timestamp": "0:33:53.5",
      "speaker": "Komal Singh",
      "text": "(laughs) Yeah."
    },
    {
      "timestamp": "0:33:54.7",
      "speaker": "Jason Staten",
      "text": "On the Ara the Star Engineer website there are a number of resources there for learning about interest in engineering, and are there any particular ones that you’ve spent time on with your daughter?"
    },
    {
      "timestamp": "0:34:07.5",
      "speaker": "Komal Singh",
      "text": "Yes, so there are a bunch of activity sheets, about 12 or 15 of them, and all of these activity sheets are designed by real life engineers, people who helped me design them, and they’re themed on the book but they teach a concept. So one of those is called “Deconstructing DeeDee” and that’s actually an arts and crafts kind of activity to build a computer. So you’re basically building DeeDee from its individual components such as the memory and the processor chip and the censors and the motor, things like that. So a lot of kids really enjoy doing that activity and so does my daughter."
    },
    {
      "timestamp": "0:34:46.3",
      "speaker": "Jason Staten",
      "text": "That is great. I’m, have to spend more time with that material. We have been stuck on the book and it, like, it has definitely proved to be readable many times, but that may be one of our next places we venture. We have checked out the code.org where you tell angry birds what to do and she liked getting the pigs, but she loved blowing the bird up with TNT, and so (laughs), we’ll definitely check that out."
    },
    {
      "timestamp": "0:35:18.0",
      "speaker": "Komal Singh",
      "text": "Okay."
    },
    {
      "timestamp": "0:35:19.2",
      "speaker": "Adam Garrett-Harris",
      "text": "So I’m kind of curious about what it was like to finally get through this project and finish it and get the final copy in your hands and to get the kind of reviews that you got, like the one from Eric Schmidt, the former CEO of Google, where he said, “Ara and her friends are more than just characters; they are models for girls and boys to follow, if they are curious about the world—and want to build a better one”"
    },
    {
      "timestamp": "0:35:45.2",
      "speaker": "Komal Singh",
      "text": "Mm-hmm (affirmative).  Yes, so throughout the conception of this book I was actually pregnant with my second child and I had my baby and I was on maternity leave; so most of the work on the book was done while I was pregnant with my second child and on maternity leave. We get one year in Canada, so one year off with my second baby. I’m still on that by the way and I go back to work very soon. So producing this book, to me, has felt like producing a third baby."
    },
    {
      "timestamp": "0:36:19.7",
      "speaker": "Adam Garrett-Harris",
      "text": "Hmm."
    },
    {
      "timestamp": "0:36:20.4",
      "speaker": "Komal Singh",
      "text": "Like, it has all the anguish, all the turmoil, all the joy, everything that goes, (laughs) that comes with a pregnancy. So yes, it’s very dear to my heart and definitely to me is my third baby. And yes, when we did get that review from Eric Schmidt I was… I was speechless. I wasn’t sure if it’s a real review. I mean, I thought maybe somehow he thought he was reviewing something else. (laughs)"
    },
    {
      "timestamp": "0:36:49.0",
      "speaker": "Adam Garrett-Harris & Jason Staten",
      "text": "(laughs)"
    },
    {
      "timestamp": "0:36:49.3",
      "speaker": "Komal Singh",
      "text": "But he does mention the name Ara, so then I had to actually cross check before we put the review on site. We checked with his media team and yes, they confirmed it was from him, so we did our due diligence before putting up that review."
    },
    {
      "timestamp": "0:37:05.8",
      "text": "But also, more importantly, there were some of my favorite kids’ books authors, one of them is the author of “Hello Ruby” and one of them’s the author of “Women in Science” and the fact that they endorsed the book was a great source of validation for me because they are some of the best authors and I admire and love their work. So that was another great validation to have endorsements not just from tech leaders but also from kids’ book authors."
    },
    {
      "timestamp": "0:37:35.9",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah. Well congrats on the book and on your new baby as well."
    },
    {
      "timestamp": "0:37:41.0",
      "speaker": "Komal Singh",
      "text": "Thank you very much."
    },
    {
      "timestamp": "0:37:42.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, thank you so much for putting out all the energy to create this. I think it’s a huge contribution to the world."
    },
    {
      "timestamp": "0:37:49.6",
      "speaker": "Komal Singh",
      "text": "Thank you. It’s been so much fun talking to your entire team and I’ve really enjoyed how thorough the questions were and how much, you know, enthusiasm you put into reading the book and extracting all the fine details. That was just so nice to hear."
    },
    {
      "timestamp": "0:38:05.3",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah, it was fun."
    },
    {
      "timestamp": "0:38:06.6",
      "speaker": "Jason Staten",
      "text": "I look forward to hearing about the forum for the next upcoming book that you plan so we can pass along feedback."
    },
    {
      "timestamp": "0:38:14.8",
      "speaker": "Komal Singh",
      "text": "Yes, please. I will be sure to share that with you all."
    },
    {
      "timestamp": "0:38:19.4",
      "speaker": "Jason Staten",
      "text": "Great."
    },
    {
      "timestamp": "0:38:19.8",
      "speaker": "Adam Garrett-Harris",
      "text": "All right. Well, thank you so much for coming on."
    },
    {
      "timestamp": "0:38:23.0",
      "speaker": "Komal Singh",
      "text": "Thank you, it’s my pleasure, thanks very much."
    },
    {
      "timestamp": "0:38:26.4",
      "speaker": "Adam Garrett-Harris",
      "text": "Yeah."
    },
    {
      "timestamp": "0:38:27.4",
      "speaker": "Komal Singh",
      "text": "Kay, bye everybody!"
    },
    {
      "timestamp": "0:38:29.0",
      "speaker": "Jen Luker",
      "text": "Bye."
    },
    {
      "timestamp": "0:38:29.0",
      "speaker": "Jason Staten",
      "text": "Bye."
    },
    {
      "timestamp": "0:38:29.0",
      "speaker": "Safia Abdalla",
      "text": "Bye."
    },
    {
      "timestamp": "0:38:30.6",
      "speaker": "Adam Garrett-Harris",
      "text": "Bye."
    },
    {
      "text": "(Exit music: Electro swing)"
    }
  ]
}